---
id: os_config_profile_ui_install_disable
title: Disable Installation of Configuration Profiles through the User Interface
discussion: |
  Installation of configuration profiles through the user interface _MUST_ be disabled and only be permitted through an authorized MDM server.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowUIConfigurationProfileInstallation').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94177-3
  cci:
  - N/A
  800-53r5:
  - CM-5
  800-171r3:
  - 03.04.05
  cis:
    benchmark:
    - N/A
    controls v8:
    - N/A
  cmmc:
  - CM.L2-3.4.5
  srg:
  - N/A
  disa_stig:
  - N/A
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-171
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- cnssi-1253_moderate
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.applicationaccess
  PayloadContent:
    allowUIConfigurationProfileInstallation: false
