---
id: os_genmoji_disable
title: Disable Genmoji AI Creation
discussion: Apple Intelligence features that use off device AI _MUST_ be disabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowGenmoji').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94196-3
  cci:
  - CCI-000381
  - CCI-001774
  srg:
  - SRG-OS-000095-GPOS-00049
  disa_stig:
  - APPL-15-005140
  800-53r5:
  - AC-20
  - AC-20(1)
  - CM-7
  - CM-7(1)
  - SC-7(10)
  800-171r3:
  - 03.01.20
  - 03.04.06
  cmmc:
  - AC.L1-3.1.20
  - CM.L2-3.4.6
  - CM.L2-3.4.7
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_low
- cnssi-1253_high
- stig
- 800-171
- cmmc_lvl2
- cmmc_lvl1
- cnssi-1253_moderate
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.applicationaccess
  PayloadContent:
    allowGenmoji: false
