---
id: os_hibernate_mode_destroyfvkeyonstandby_enable
title: Enable DestroyFVKeyOnStandby on Hibernate
discussion: |
  DestroyFVKeyOnStandby on hibernate _MUST_ be enabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.MCX')\
  .objectForKey('DestroyFVKeyOnStandby').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94201-1
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r3:
    - N/A
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: macos
    version:
      - 15.0
tags:
  - none
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.MCX
    PayloadContent:
      DestroyFVKeyOnStandby: true
