---
id: os_handoff_disable
title: Disable Handoff
discussion: |
  Handoff _MUST_ be disabled.

  Handoff allows you to continue working on a document or project when the user switches from one Apple device to another. Disabling Handoff prevents data transfers to unauthorized devices.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowActivityContinuation').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94199-7
  cci:
  - CCI-000213
  - CCI-000381
  - CCI-001443
  800-53r5:
  - AC-3
  - AC-20
  - CM-7
  - CM-7(1)
  800-53r4:
  - AC-3
  - AC-20
  - CM-7
  - CM-7(1)
  srg:
  - SRG-OS-000300-GPOS-00118
  - SRG-OS-000080-GPOS-00048
  - SRG-OS-000095-GPOS-00049
  disa_stig:
  - APPL-15-005058
  800-171r3:
  - 03.01.02
  - 03.01.20
  - 03.04.06
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
  cmmc:
  - AC.L1-3.1.1
  - AC.L1-3.1.20
  - CM.L2-3.4.6
  - CM.L2-3.4.7
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cisv8
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- cmmc_lvl1
- stig
- cnssi-1253_moderate
severity: medium
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.applicationaccess
  PayloadContent:
    allowActivityContinuation: false
