---
id: os_ir_support_disable
title: Disable Infrared (IR) support
discussion: |
  Infrared (IR) support _MUST_ be disabled to prevent users from controlling the system with IR devices.

  By default, if IR is enabled, the system will accept IR control from any remote device.

  NOTE: This is applicable only to models of Mac Mini systems earlier than Mac Mini8,1.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.driver.AppleIRController')\
  .objectForKey('DeviceEnabled').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94214-4
  cci:
  - N/A
  800-53r5:
  - AC-18
  - CM-7
  - CM-7(1)
  800-53r4:
  - CM-7
  - CM-7(1)
  - AC-18
  srg:
  - N/A
  disa_stig:
  - N/A
  800-171r3:
  - 03.01.16
  - 03.04.06
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
    - 12.6
  cmmc:
  - AC.L2-3.1.16
  - CM.L2-3.4.6
  - CM.L2-3.4.7
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cisv8
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- cnssi-1253_moderate
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.ManagedClient.preferences
  PayloadContent:
    com.apple.driver.AppleIRController:
      DeviceEnabled: false
