---
id: os_password_proximity_disable
title: Disable Proximity Based Password Sharing Requests
discussion: |
  Proximity based password sharing requests _MUST_ be disabled.

  The default behavior of macOS is to allow users to request passwords from other known devices (macOS and iOS). This feature _MUST_ be disabled to prevent passwords from being shared.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowPasswordProximityRequests').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94249-0
  cci:
  - CCI-000381
  800-53r5:
  - IA-5
  800-53r4:
  - IA-5
  srg:
  - SRG-OS-000095-GPOS-00049
  disa_stig:
  - APPL-15-005060
  800-171r3:
  - 03.05.12
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
  cmmc:
  - IA.L2-3.5.8
  - IA.L2-3.5.9
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cisv8
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- stig
- cnssi-1253_moderate
severity: medium
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.applicationaccess
  PayloadContent:
    allowPasswordProximityRequests: false
