---
id: os_privacy_setup_prompt_disable
title: Disable Privacy Setup Services During Setup Assistant
discussion: |
  The prompt for Privacy Setup services during Setup Assistant _MUST_ be disabled.

  Organizations _MUST_ apply organization-wide configuration settings. The macOS Privacy Setup services prompt guides new users through enabling their own specific privacy settings; this is not essential and, therefore, _MUST_ be disabled to prevent against the risk of individuals electing privacy settings with the potential to override organization-wide settings.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipPrivacySetup').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94264-9
  cci:
  - CCI-000381
  800-53r5:
  - CM-7
  - CM-7(1)
  800-53r4:
  - CM-7
  - CM-7(1)
  srg:
  - SRG-OS-000095-GPOS-00049
  disa_stig:
  - APPL-15-002036
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
  cmmc:
  - CM.L2-3.4.6
  - CM.L2-3.4.7
  800-171r3:
  - 03.04.06
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-171
- cisv8
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- stig
- cnssi-1253_moderate
severity: medium
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.SetupAssistant.managed
  PayloadContent:
    SkipPrivacySetup: true
