---
id: os_rapid_security_response_allow
title: Enforce Rapid Security Response Mechanism
discussion: |
  Rapid security response mechanism _MUST_ be enabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowRapidSecurityResponseInstallation').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94269-8
  cci:
  - N/A
  800-53r5:
  - SI-2
  - SI-2(5)
  - SI-3
  srg:
  - N/A
  disa_stig:
  - N/A
  800-171r3:
  - 03.14.01
  - 03.14.02
  cis:
    benchmark:
    - N/A
    controls v8:
    - N/A
  cmmc:
  - SI.L1-3.14.1
  - SI.L1-3.14.2
  - SI.L1-3.14.4
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-171
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- cmmc_lvl1
- cnssi-1253_moderate
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.applicationaccess
  PayloadContent:
    allowRapidSecurityResponseInstallation: true
