---
id: os_screensaver_loginwindow_enforce
title: Enforce Screen Saver at Login Window
discussion: |
  A default screen saver _MUST_ be configured to display at the login window and _MUST_ not display any sensitive information.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
  .objectForKey('moduleName').js
  EOS
result:
  string: Sequoia
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94286-2
  cci:
  - CCI-000060
  800-53r5:
  - AC-11(1)
  800-53r4:
  - AC-11(1)
  srg:
  - N/A
  disa_stig:
  - N/A
  800-171r3:
  - 03.01.10
  cmmc:
  - AC.L2-3.1.10
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- cnssi-1253_moderate
severity: medium
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.screensaver
  PayloadContent:
    moduleName: Sequoia
