---
id: os_safari_advertising_privacy_protection_enable
title: Ensure Advertising Privacy Protection in Safari Is Enabled
discussion: |
  Allow privacy-preserving measurement of ad effectiveness _MUST_ be enabled in Safari.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c '"WebKitPreferences.privateClickMeasurementEnabled" = 1' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94280-5
  cci:
  - N/A
  800-53r5:
  - N/A
  800-53r4:
  - N/A
  disa_stig:
  - N/A
  srg:
  - N/A
  cis:
    benchmark:
    - 6.3.6 (level 1)
    controls v8:
    - 9.1
operating_system:
- name: macos
  version:
  - 15.0
tags:
- cis_lvl1
- cis_lvl2
- cisv8
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.Safari
  PayloadContent:
    WebKitPreferences.privateClickMeasurementEnabled: true
