---
id: os_skip_screen_time_prompt_enable
title: Disable Screen Time Prompt During Setup Assistant
discussion: The prompt for Screen Time setup during Setup Assistant _MUST_ be disabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipScreenTime').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94296-1
  cci:
  - CCI-000381
  800-53r5:
  - CM-7
  - CM-7(1)
  800-53r4:
  - CM-7
  - CM-7(1)
  srg:
  - SRG-OS-000095-GPOS-00049
  disa_stig:
  - APPL-15-005055
  cmmc:
  - CM.L2-3.4.6
  - CM.L2-3.4.7
  800-171r3:
  - 03.04.06
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-171
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- stig
- cnssi-1253_moderate
severity: low
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.SetupAssistant.managed
  PayloadContent:
    SkipScreenTime: true
