---
id: os_safari_warn_fraudulent_website_enable
title: Ensure Warn When Visiting A Fraudulent Website in Safari Is Enabled
discussion: |
  Warn when visiting a fraudulent website _MUST_ be enabled in Safari.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'WarnAboutFraudulentWebsites = 1' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94285-4
  cci:
  - N/A
  800-53r5:
  - N/A
  800-53r4:
  - N/A
  disa_stig:
  - N/A
  srg:
  - N/A
  cis:
    benchmark:
    - 6.3.3 (level 1)
    controls v8:
    - 9.1
    - 9.3
operating_system:
- name: macos
  version:
  - 15.0
tags:
- cis_lvl1
- cis_lvl2
- cisv8
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.Safari
  PayloadContent:
    WarnAboutFraudulentWebsites: true
