---
id: icloud_keychain_disable
title: Disable iCloud Keychain Sync
discussion: |
  The iOS system's ability to automatically synchronize a user's passwords to their iCloud account _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94416-5
  cci:
    - CCI-000097
    - CCI-000366
    - CCI-000370
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - "FMT_MOF_EXT.1.2 #40"
  disa_stig:
    - AIOS-18-003300
  indigo:
    - ANNEX D (Section 5.4 - iCloud restrictions)
    - ANNEX K
  cis:
    benchmark:
      - 3.2.1.6 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.1
      - 4.8
      - 15.3
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
  - indigo_base
  - indigo_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowCloudKeychainSync: false
