---
id: icloud_enterprisebook_metadata_sync_disable
title: Preventing synchronisation of enterprise book meta data.
discussion: |
  The iOS device _MUST_ be configured to prevent the synchronization of enterprise book meta data to Apple iCloud servers.

  Apple's iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, password management and synchronization _MUST_ be controlled by an organization approved service.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94566-7
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  indigo:
    - ANNEX K
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowEnterpriseBookMetadataSync: false
