id: pwpolicy_history_enforce
title: "Prohibit Password Reuse for a Minimum of Five Generations"
discussion: |
  The macOS _MUST_ be configured to enforce a password history of at least five previous passwords when a password is created. 

  This rule ensures that users are  not allowed to re-use a password that was used in any of the five previous password generations. 

  Limiting password reuse protects against malicious users attempting to gain access to the system via brute-force hacking methods.
check: | 
  /usr/bin/profiles -P -o stdout | /usr/bin/awk '/pinHistory/{sub(/;.*/,"");print $3}'
result:
  integer: 5
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85407-5
    cci: 
  - CCI-000200
  800-53r4: 
    - IA-5(1)
  srg: 
    - SRG-OS-000077-GPOS-00045
  disa_stig: 
    - AOSX-15-003009
  800-171r2:
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    pinHistory: 5
