id: pwpolicy_account_lockout_timeout_enforce
title: Set Account Lockout Time to $ODV Minutes
discussion: |
  The macOS _MUST_ be configured to enforce a lockout time period of at least $ODV minutes when the maximum number of failed logon attempts is reached.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods.
check: |
  /usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()="autoEnableInSeconds"]/following-sibling::integer[1]/text()' - | /usr/bin/awk '{ if ($1/60 >= $ODV ) {print "yes"} else {print "no"}}' | /usr/bin/uniq
result:
  string: 'yes'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95338-0
  cci:
    - CCI-002238
    - CCI-000044
  800-53r5:
    - AC-7
  800-53r4:
    - AC-7
  srg:
    - SRG-OS-000329-GPOS-00128
    - SRG-OS-000021-GPOS-00005
  disa_stig:
    - APPL-26-000060
  800-171r3:
    - 03.01.08
  cis:
    benchmark:
      - 5.2.1 (level 1)
    controls v8:
      - 6.2
  cmmc:
    - AC.L2-3.1.8
macOS:
  - '26.0'
odv:
  hint: Number of minutes.
  recommended: 15
  stig: 15
  cis_lvl1: 15
  cis_lvl2: 15
tags:
  - 800-171
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cisv8
  - cis_lvl1
  - cis_lvl2
  - cnssi-1253_low
  - cnssi-1253_high
  - cmmc_lvl2
  - stig
  - cnssi-1253_moderate
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minutesUntilFailedLoginReset: $ODV
ddm_info:
  declarationtype: com.apple.configuration.passcode.settings
  ddm_key: MaximumGracePeriodInMinutes
  ddm_value: $ODV