id: pwpolicy_special_character_enforce
title: "Require Passwords Contain a Minimum of One Special Character"
discussion: |
  The macOS _MUST_ be configured to require at least one special character be used when a password is created.

  Special characters are those characters that are not alphanumeric. Examples include: ~ ! @ # $ % ^ *.
  
  This rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users.
check: | 
  /usr/bin/profiles -P -o stdout | /usr/bin/awk '/minComplexChars/{sub(/;.*/,"");print $3}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84819-2
  cci: 
    - CCI-001619
  800-53r4: 
    - IA-5
    - IA-5(1)
  srg: 
    - SRG-OS-000266-GPOS-00101
  disa_stig: 
    - AOSX-14-003011
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minComplexChars: 1
