id: "pwpolicy_max_grace_period_enforce"
title: "Ensure Maximum grace period for device lock is set to Immediately"
discussion: |
  The iOS grace period for device lock _MUST_ be configured to immediately.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - AC-2(5)
    - AC-11
    - AC-11(1)
    - AC-12
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.4.5 (level 1)
      - 3.4.5 (level 1)
    v8:
      - 4.3
iOS:
  - "16.0"
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5
severity: ""
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxInactivity: 0
