id: pwpolicy_history_enforce
title: Prohibit Password Reuse for a Minimum of $ODV Generations
discussion: |
  The visionOS _MUST_ be configured to enforce a password history of at least $ODV previous passwords when a password is created.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-96717-4
  cci:
    - CCI-004061
  800-53r5:
    - IA-5(1)
  sfr:
    - "FMT_SMF.1.1 #47"
  disa_stig:
    - AVOS-02-006950
visionOS:
  - "26.0"
odv:
  hint: Number of previous passwords.
  recommended: 5
  visionos_stig: 2
tags:
- visionos
- visionos_stig
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
severity: high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    pinHistory: $ODV