id: pwpolicy_account_lockout_enforce
title: Limit Consecutive Failed Login Attempts to $ODV
discussion: |
  The visionOS device _MUST_ be configured to limit the number of failed login attempts to a maximum of $ODV.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-96715-8
  cci:
    - CCI-000044
  800-53r5:
    - AC-7
  sfr:
    - 'FMT_SMF.1.1 #2'
    - 'FIA_AFL_EXT.1.5'
  disa_stig:
    - AVOS-02-006900
visionOS:
  - '26.0'
odv:
  hint: Number of failed attempts.
  recommended: 6
  visionos_stig: 10
tags:
  - visionos
  - visionos_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxFailedAttempts: $ODV
