id: pwpolicy_max_lifetime_enforce
title: "Restrict Maximum Password Lifetime to $ODV Days"
discussion: |
  The macOS _MUST_ be configured to enforce a maximum password lifetime limit of at least $ODV days.

  This rule ensures that users are forced to change their passwords frequently enough to prevent malicious users from gaining and maintaining access to the system.

  NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
check: |
  /usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()="policyAttributeExpiresEveryNDays"]/following-sibling::*[1]/text()' -
result:
  integer: $ODV
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91922-5
  cci:
    - CCI-000199
  800-53r5:
    - IA-5
  800-53r4:
    - IA-5
    - IA-5(1)
  srg:
    - SRG-OS-000076-GPOS-00044
  disa_stig:
    - APPL-13-003008
  800-171r2:
    - 3.5.1
    - 3.5.2
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
  cis:
    benchmark:
      - 5.2.7 (level 1)
    controls v8:
      - 5.3
  cmmc:
    - IA.L2-3.5.8
    - IA.L2-3.5.9
macOS:
  - "13.0"
odv:
  hint: "Number of days."
  recommended: 60
  cis_lvl1: 365
  cis_lvl2: 365
  stig: 60
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1
  - cis_lvl2
  - cisv8
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - cmmc_lvl2
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxPINAgeInDays: $ODV
