id: pwpolicy_account_lockout_timeout_enforce
title: "Enforce account lockout time period of 15 minutes after the maximum failed logon attempts"
discussion: |
  macOS must enforce a lockout time period of at least 15 minutes after the maxium failed logon attempts.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'minutesUntilFailedLoginReset = 15' 
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84810-1
  cci: 
    - CCI-002238
  800-53r4: 
    - AC-7(b)
  srg: 
    - SRG-OS-000329-GPOS-00128
  disa_stig: 
    - AOSX-14-000021
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minutesUntilFailedLoginReset: 15
