id: pwpolicy_account_lockout_enforce
title: "Limit Consecutive Failed Login Attempts to Three"
discussion: |
  The macOS _MUST_ be configured to limit the number of failed login attempts to a maximum of three. When the maximum number of failed attempts is reached, the account _MUST_ be locked for a period of time after.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'maxFailedAttempts = 3' 
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - CCI-002238
  800-53r5:
    - AC-7
  800-53r4: 
    - AC-7
  srg: 
    - SRG-OS-000329-GPOS-00128
  disa_stig: 
    - APPL-12-XXXXXX
  800-171r2:
    - 3.1.8
macOS:
  - "12.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxFailedAttempts: 3
