id: pwpolicy_max_inactivity_enforce
title: "Ensure Maximum Auto-Lock is set to $ODV minutes or less"
discussion: |
  The iOS _MUST_ be configured to auto-lock after $ODV minutes.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94476-9
  cci: 
    - CCI-000057
  800-53r5:
    - AC-11
    - IA-11
  sfr:
    - 'FMT_SMF_EXT.1.1 #2b'
  disa_stig:
    - N/A
  indigo:
    - ANNEX D (Section 5.9.1 - Device-Code) 
    - ANNEX K
  cis:
    benchmark:
      - 2.4.4 (level 1 - End-User Owned Devices)
      - 3.4.4 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.3
iOS:
  - "18.0"
odv:
  hint: "Maximum Auto-Lock in Minutes."
  recommended: 2
  cis_lvl1_byod: 2
  cis_lvl2_byod: 2
  cis_lvl1_enterprise: 2
  cis_lvl2_enterprise: 2
  ios_stig: 5
  ios_stig_byoad: 5
  indigo_base: 2
  indigo_high: 2
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
  - ios_stig_byoad
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxInactivity: $ODV
