id: pwpolicy_minimum_length_enforce
title: "Require a Minimum Passcode Length of $ODV Characters"
discussion: |
  The iOS _MUST_ be configured to require a minimum of $ODV characters be used when a passcode is created.

  This rule enforces passcode complexity by requiring users to set passcode that are less vulnerable to malicious users. 
check: " " 
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.4.3 (level 1 - End-User Owned Devices)
      - 3.4.3 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 5.2
ios:
  - "16.0"
odv:
  hint: "Minimum passcode length."
  recommended: 6
  cis_lvl1: 6
  cis_lvl2: 6
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minLength: $ODV
