id: pwpolicy_max_grace_period_enforce
title: "Ensure Maximum grace period for device lock is set to Immediately"
discussion: |
  The iOS grace period for device lock _MUST_ be configured to immediately.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - CCI-000057
  800-53r5:
    - AC-11
    - IA-11
  sfr:
    - 'FMT_SMF_EXT.1.1 #2a'
  disa_stig: 
    - AIOS-16-006700
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.4.5 (level 1 - End-User Owned Devices)
      - 3.4.5 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.3
iOS:
  - "16.0"
odv:
  hint: "Maximum Grace Period in Minutes."
  recommended: 0
  cis_lvl1: 0
  cis_lvl2: 0
  ios_stig: 5
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxGracePeriod: $ODV
