id: pwpolicy_account_lockout_enforce
title: "Limit Consecutive Failed Login Attempts to $ODV"
discussion: |
  The iOS _MUST_ be configured to limit the number of failed login attempts to a maximum of $ODV.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.4.6 (level 1)
      - 3.4.6 (level 1)
    controls v8:
      - 4.3
ios:
  - "16.0"
odv:
  hint: "Number of failed attempts."
  recommended: 6
  cis_lvl1: 6
  cis_lvl2: 6
tags:
  - ios
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxFailedAttempts: $ODV
