id: pwpolicy_account_lockout_timeout_enforce
title: "Set Account Lockout Time to $ODV Minutes"
discussion: |
  The macOS _MUST_ be configured to enforce a lockout time period of at least $ODV minutes when the maximum number of failed logon attempts is reached.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. 
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.mobiledevice.passwordpolicy')\
  .objectForKey('minutesUntilFailedLoginReset').js
  EOS
result:
  integer: $ODV
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84810-1
  cci: 
    - CCI-002238
  800-53r5:
    - AC-7
  800-53r4: 
    - AC-7
  srg: 
    - SRG-OS-000329-GPOS-00128
  disa_stig: 
    - AOSX-15-000021
  800-171r2:
    - 3.1.8
  cis:
    benchmark:
      - N/A
    controls v8:
      - 4.1
macOS:
  - "10.15"
odv:
  hint: "Number of minutes."
  recommended: 15
  stig: 15
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minutesUntilFailedLoginReset: $ODV
