id: pwpolicy_passcode_history_enforce
title: "Enforce a passcode reuse prohibition of at least two generations"
discussion: |
  iOS-iPadOS 17 and later versions include a feature that allows the previous passcode to be valid for 72 hours after a passcode change. If the previous passcode has been compromised and the attacker has access to it and the Apple device, enterprise data and the enterprise network can be compromised. Currently there is no MDM control to force the old passcode to expire immediately after passcode change. The previous passcode will expire immediately after a passcode change if the MDM password history control is implemented.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - CCI-004061
  800-53r5:
    - IA-5(1) (b)
  sfr:
    - 'FMT_SMF.1.1 #47'
  disa_stig:
    - AIOS-18-006950
  800-171r2:
    - N/A
  cis:
    - N/A
iOS:
  - "18.0"
odv:
  hint: "Previous passcodes."
  recommended: 0 
  ios_stig: 2
  ios_stig_byoad: 2
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - ios_stig_byoad
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    pinHistory: $ODV
