id: pwpolicy_account_lockout_enforce
title: "Limit Consecutive Failed Login Attempts to $ODV"
discussion: |
  The iOS _MUST_ be configured to limit the number of failed login attempts to a maximum of $ODV.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - CCI-000044
  800-53r5:
    - AC-7
  sfr:
    - 'FMT_SMF_EXT.1.1 #2c'
    - 'FIA_AFL_EXT.1.5'
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.4.6 (level 1 - End-User Owned Devices)
      - 3.4.6 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.3
iOS:
  - "17.0"
odv:
  hint: "Number of failed attempts."
  recommended: 6
  cis_lvl1: 6
  cis_lvl2: 6
  ios_stig: 10
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxFailedAttempts: $ODV
