id: pwpolicy_alpha_numeric_enforce
title: "Require Passwords Contain a Minimum of One Numeric Character"
discussion: |
  The macOS _MUST_ be configured to require at least one numeric character be used when a password is created.

  This rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users. 
check: | 
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c "requireAlphanumeric = 1;"
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84811-9
  cci: 
    - CCI-000194
  800-53r4: 
    - IA-5(1)(a)
  srg: 
    - SRG-OS-000071-GPOS-00039
  disa_stig: 
    - AOSX-14-003007
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    requireAlphanumeric: true
