id: pwpolicy_history_enforce
title: "Prohibit Password Reuse for a Minimum of 2 Generations"
discussion: |
  The iOS _MUST_ be configured to enforce a password history of at least 2 previous passwords when a password is created.  
check: |
  Check your MDM to ensure that the password history has been enforced to 2 generations on the iOS endpoint.
result:
  integer: "2"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.9.1 - Device-Code) 
    - ANNEX K  
iOS:
  - "17.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    pinHistory: 2
