id: pwpolicy_max_lifetime_enforce
title: "Restrict Maximum Password Lifetime to $ODV Days"
discussion: |
  The macOS _MUST_ be configured to enforce a maximum password lifetime limit of at least $ODV days. 

  This rule ensures that users are forced to change their passwords frequently enough to prevent malicious users from gaining and maintaining access to the system.

  NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.mobiledevice.passwordpolicy')\
  .objectForKey('maxPINAgeInDays').js
  EOS
result:
  integer: $ODV
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85400-0
  cci: 
    - CCI-000199
  800-53r5:
    - IA-5
  800-53r4: 
    - IA-5
    - IA-5(1)
  srg: 
    - SRG-OS-000076-GPOS-00044
  disa_stig: 
    - APPL-11-003008
  800-171r2:
    - 3.5.1
    - 3.5.2
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
  cis:
    benchmark:
      - 5.2.7
    controls v8:
      - 5.3
macOS:
  - "11.0"
odv:
  hint: "Number of days."
  recommended: 60
  stig: 60
  cis_lvl1: 365
  cis_lvl2: 365
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - stig
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxPINAgeInDays: $ODV
