id: pwpolicy_account_lockout_enforce
title: "Limit Consecutive Failed Login Attempts to Three"
discussion: |
  The macOS _MUST_ be configured to limit the number of failed login attempts to a maximum of three. When the maximum number of failed attempts is reached, the account _MUST_ be locked for a period of time after.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'maxFailedAttempts = 3' 
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84809-3
  cci:
    - CCI-000044 
    - CCI-002238
  800-53r4: 
    - AC-7
  srg: 
    - SRG-OS-000021-GPOS-00005
    - SRG-OS-000329-GPOS-00128
  disa_stig: 
    - AOSX-15-000020
    - AOSX-15-000022
  800-171r2:
    - 3.1.8
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxFailedAttempts: 3
