id: pwpolicy_history_enforce
title: "Prohibit Password Reuse for a Minimum of $ODV Generations"
discussion: |
  The macOS _MUST_ be configured to enforce a password history of at least $ODV previous passwords when a password is created. 

  This rule ensures that users are  not allowed to re-use a password that was used in any of the $ODV previous password generations. 

  Limiting password reuse protects against malicious users attempting to gain access to the system via brute-force hacking methods.

  NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
check: | 
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.mobiledevice.passwordpolicy')\
  .objectForKey('pinHistory').js
  EOS
result:
  integer: $ODV
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85407-5
  cci: 
    - CCI-000200
  800-53r5:
    - IA-5(1)
  800-53r4: 
    - IA-5(1)
  srg: 
    - SRG-OS-000077-GPOS-00045
  disa_stig: 
    - APPL-11-003009
  800-171r2:
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
  cis:
    benchmark:
      - 5.2.8 (level 1)
    controls v8:
      - 5.2
macOS:
  - "11.0"
odv: 
  hint: "Number of previous passwords."
  recommended: 5
  stig: 5
  cis_lvl1: 15
  cis_lvl2: 15
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - stig
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    pinHistory: $ODV
