id: pwpolicy_alpha_numeric_enforce
title: Require Passwords Contain a Minimum of One Numeric Character
discussion: |
  The iOS _MUST_ be configured to require at least one numeric character be used when a password is created.
  
  This rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95547-6
  800-53r5:
    - IA-5(1)
  indigo:
    - ANNEX D (Section 5.9.1 - Device-Code)
    - ANNEX K
  cmmc:
    - IA.L2-3.5.8
    - IA.L2-3.5.9
    - IA.L2-3.5.7
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - indigo_base
  - indigo_high
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    requireAlphanumeric: true
