id: pwpolicy_account_lockout_timeout_enforce
title: "Set Account Lockout Time to $ODV Minutes"
discussion: "The macOS _MUST_ be configured to enforce a lockout time period of at least $ODV minutes when the maximum number of failed logon attempts is reached.\n\nThis rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. \n"
check: "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\"autoEnableInSeconds\"]/following-sibling::integer[1]/text()' - | /usr/bin/awk '{ if ($1/60 >= $ODV ) {print \"yes\"} else {print \"no\"}}' \n"
result:
  string: "yes"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91030-7
  cci:
    - CCI-002238
  800-53r5:
    - AC-7
  800-53r4:
    - AC-7
  srg:
    - SRG-OS-000329-GPOS-00128
  disa_stig:
    - APPL-12-000022
  800-171r2:
    - 3.1.8
  cis:
    benchmark:
      - N/A
    controls v8:
      - 4.1
  cmmc:
    - AC.L2-3.1.8
macOS:
  - "12.0"
odv:
  hint: "Number of minutes."
  recommended: 15
  stig: 15
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cisv8
  - stig
  - cmmc_lvl2
  - cmmc_lvl3
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minutesUntilFailedLoginReset: $ODV
