id: pwpolicy_minimum_length_enforce
title: "Require a Minimum Password Length of 15 Characters"
discussion: |
  The macOS _MUST_ be configured to require a minimum of 15 characters be used when a password is created.

  This rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'minLength = 15' 
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85409-1
  cci: 
    - CCI-000205
  800-53r5:
    - IA-5
    - IA-5(1)
  800-53r4: 
    - IA-5
    - IA-5(1)
  srg: 
    - SRG-OS-000078-GPOS-00046
  disa_stig: 
    - APPL-11-003010
  800-171r2:
    - 3.5.1
    - 3.5.2
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minLength: 15
