id: pwpolicy_60_day_enforce
title: "Restrict Maximum Password Lifetime to 60 Days"
discussion: |
  The macOS _MUST_ be configured to enforce a maximum password lifetime limit of at least 60 days. 

  This rule ensures that users are forced to change their passwords frequently enough to prevent malicious users from gaining and maintaining access to the system.

  NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/awk -F " = " '/maxPINAgeInDays/{sub(/;.*/,"");print $2}'
result:
  integer: 60
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85400-0
  cci: 
    - CCI-000199
  800-53r5:
    - IA-5
  800-53r4: 
    - IA-5
    - IA-5(1)
  srg: 
    - SRG-OS-000076-GPOS-00044
  disa_stig: 
    - APPL-11-003008
  800-171r2:
    - 3.5.1
    - 3.5.2
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
  cisv8:
    - 3.10
    - 4.1
    - 4.7
    - 6.1
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - stig
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxPINAgeInDays: 60
