id: pwpolicy_60_day_enforce
title: "Enforce a 60-day maximum password lifetime restriction"
discussion: |
  The macOS must limit the lifetime of a password to a maxiumum of at least 60 days and force users to change their passwords.
check: |
  /usr/bin/profiles -P -o stdout | awk -F " = " '/maxPINAgeInDays/{sub(/;.*/,"");print $2}'
result:
  integer: 60
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84807-7
  cci: 
    - CCI-000199
  800-53r4: 
    - IA-5(1)(d)
  srg: 
    - SRG-OS-000076-GPOS-00044
  disa_stig: 
    - AOSX-14-003008
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxPINAgeInDays: 60
