id: pwpolicy_minimum_length_enforce
title: "Require a Minimum Passcode Length of $ODV Characters"
discussion: |
  The visionOS _MUST_ be configured to require a minimum of $ODV characters be used when a passcode is created.

  This rule enforces passcode complexity by requiring users to set passcode that are less vulnerable to malicious users. 
check: " " 
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-96719-0
  cci: 
    - CCI-004066
  800-53r5:
    - IA-5(1)
  sfr:
    - 'FMT_SMF.1.1 #1'
  disa_stig:
    - AVOS-02-006500
visionOS:
  - "26.0"
odv:
  hint: "Minimum passcode length."
  recommended: 6
  visionos_stig: 6
tags:
  - visionos
  - visionos_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minLength: $ODV