id: pwpolicy_special_character_enforce
title: "Require Passwords Contain a Minimum of One Special Character"
discussion: |
  The macOS _MUST_ be configured to require at least one special character be used when a password is created.

  Special characters are those characters that are not alphanumeric. Examples include: ~ ! @ # $ % ^ *.
  
  This rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users.
  
  NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
check: | 
  /usr/bin/profiles -P -o stdout | /usr/bin/awk '/minComplexChars/{sub(/;.*/,"");print $3}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91040-6
  cci: 
    - CCI-001619
  800-53r5:
    - IA-5(1)
  800-53r4: 
    - IA-5
    - IA-5(1)
  srg:
    - SRG-OS-000266-GPOS-00101
  disa_stig: 
    - N/A
  800-171r2:
    - 3.5.1
    - 3.5.2
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
macOS:
  - "12.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minComplexChars: 1
