id: pwpolicy_alpha_numeric_enforce
title: "Require Passwords Contain a Minimum of One Numeric Character"
discussion: |
  The macOS _MUST_ be configured to require at least one numeric character be used when a password is created.
  
  This rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users. 
  
  NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
check: |
  /usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()="policyIdentifier"]/following-sibling::*[1]/text()' - | /usr/bin/grep "requireAlphanumeric" -c
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91031-5
  cci:
    - CCI-000194
  800-53r5:
    - IA-5(1)
  800-53r4:
    - IA-5
    - IA-5(1)
  srg:
    - SRG-OS-000071-GPOS-00039
  disa_stig:
    - APPL-12-003007
  800-171r2:
    - 3.5.1
    - 3.5.2
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
  cis:
    benchmark:
      - 5.2.3 (level 2)
      - 5.2.4 (level 2)
    controls v8:
      - 5.2
  cmmc:
    - IA.L2-3.5.7
    - IA.L2-3.5.8
    - IA.L2-3.5.9
macOS:
  - "12.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2
  - cisv8
  - stig
  - cmmc_lvl2
  - cmmc_lvl3
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    requireAlphanumeric: true
