id: pwpolicy_max_inactivity_enforce
title: "Ensure Maximum Auto-Lock is Set to $ODV Minutes or Less"
discussion: |
  The visionOS _MUST_ be configured to auto-lock after $ODV minutes.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - CCI-000057
  800-53r5:
    - AC-11
    - IA-11
  sfr:
    - "FMT_SMF.1.1 #2"
  disa_stig:
    - AVOS-02-006800
visionOS:
  - "26.0"
odv:
  hint: "Maximum Auto-Lock in Minutes."
  recommended: 2
  visionos_stig: 5
tags:
  - visionos
  - visionos_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxInactivity: $ODV