id: pwpolicy_account_lockout_enforce
title: "Limit Consecutive Failed Login Attempts to Three"
discussion: |
  The macOS _MUST_ be configured to limit the number of failed login attempts to a maximum of three. When the maximum number of failed attempts is reached, the account _MUST_ be locked for a period of time after.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. 
check: |
  /usr/bin/osascript -l JavaScript << EOS
  ObjC.import('Foundation')
  ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.mobiledevice.passwordpolicy')\
  .objectForKey('maxFailedAttempts'))
  EOS
result:
  integer: 3
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91029-9
  cci:
    - CCI-002238
  800-53r5:
    - AC-7
  800-53r4: 
    - AC-7
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.8
  cisv8:
    - 4.1
macOS:
  - "12.0"
tags:
  - 800-171 
  - cnssi-1253 
  - 800-53r4_low 
  - 800-53r4_moderate 
  - 800-53r4_high 
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxFailedAttempts: 3
