id: auth_smartcard_certificate_trust_enforce_high
title: "Set Smartcard Certificate Trust to High"
discussion: |
  The macOS system _MUST_ be configured to block access to users who are no longer authorized (i.e., users with revoked certificates).  
  
  To prevent the use of untrusted certificates, the certificates on a smartcard card _MUST_ meet the following criteria: its issuer has a system-trusted certificate, the certificate is not expired, its "valid-after" date is in the past, and it passes Certificate Revocation List (CRL) and Online Certificate Status Protocol (OCSP) checking.

  By setting the smartcard certificate trust level to high, the system will execute a hard revocation, i.e., a network connection is required. A verified positive response from the OSCP/CRL server is required for authentication to succeed.

  NOTE: Before applying this setting, please see the smartcard supplemental guidance.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/awk "/checkCertificateTrust/{print substr($3, 1, length($3)-1)}"
result: 
  integer: 3
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85278-0
  cci: 
    - CCI-000186
  800-53r4: 
    - IA-2(12)
    - IA-5(2)
  srg: 
   - SRG-OS-000067-GPOS-00035
  disa_stig: 
   - APPL-11-003002
macOS:
  - "11.0"
tags:
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    checkCertificateTrust: 3
