id: auth_smartcard_allow
title: "Allow Smartcard Authentication"
discussion: |
  Smartcard authentication _MUST_ be allowed. 

  The use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.
  
  When enabled, the smartcard can be used for login, authorization, and screen saver unlocking.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowSmartCard = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85277-2
  cci: 
   - N/A
  800-53r5:
    - IA-2(1)
    - IA-2(2)
    - IA-2(12)
  800-53r4: 
   - IA-2(12)
   - IA-5(11)
  srg: 
   - SRG-OS-000376-GPOS-00161
  disa_stig:
    - N/A
macOS:
  - "11.0"
tags:
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    allowSmartCard: true
