id: auth_smartcard_certificate_trust_enforce_moderate
title: "Set Smartcard Certificate Trust to Moderate"
discussion: |
  The macOS system must be configured to not allow access to users who are no longer authorized (users with revoked certificates). To prevent the use of untrusted certificates, the certificates on a smartcard card must meet the following criteria: its issuer has a system-trusted certificate, the certificate is not expired, its "valid-after" date is in the past, and it passes CRL and OCSP checking. 
  
  This is a soft revocation. If the OCSP/CRL server is unreachable, authentication will still succeed.
  
  NOTE: Before applying this setting, please see the <<scSupp,Smartcard Supplemental>> guidance.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/awk '/checkCertificateTrust/{print substr($3, 1, length($3)-1)}'
result:
  integer: 2
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84726-9
  cci: 
   - CCI-000186
  800-53r4: 
    - IA-2(12)
    - IA-5(2)
    - IA-5(2)(d)
  srg: 
   - SRG-OS-000067-GPOS-00035
  disa_stig: 
   - AOSX-14-003002
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-moderate
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    checkCertificateTrust: 2
