id: auth_smartcard_allow
title: "Allow Smartcard Authentication"
discussion: |
  Smartcard authentication _MUST_ be allowed. 

  The use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.
  
  When enabled, the smartcard can be used for login, authorization, and screen saver unlocking.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
  .objectForKey('allowSmartCard').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91736-9
  cci: 
    - N/A
  800-53r5:
    - IA-2(1)
    - IA-2(2)
    - IA-2(12)
  800-53r4: 
    - IA-2(12)
    - IA-5(11)
  srg:
    - N/A
  disa_stig:
    - N/A
  cis:
    benchmark:
      - N/A
    controls v8:
      - 6.3
      - 6.4
      - 6.5
  cmmc:
    - IA.L1-3.5.1
    - IA.L1-3.5.2
    - IA.L2-3.5.3
macOS:
  - "13.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - cnssi-1253
  - cisv8
  - cmmc_lvl3
  - cmmc_lvl2
  - cmmc_lvl1
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    allowSmartCard: true
