id: auth_smartcard_allow
title: "Allow Smartcard Authentication"
discussion: |
  Smartcard authentication _MUST_ be allowed. 

  The use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.
  
  When enabled, the smartcard can be used for login, authorization, and screen saver unlocking.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
  .objectForKey('allowSmartCard').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85277-2
  cci: 
   - N/A
  800-53r5:
    - IA-2(1)
    - IA-2(2)
    - IA-2(12)
  800-53r4: 
   - IA-2(12)
   - IA-5(11)
  srg: 
   - SRG-OS-000376-GPOS-00161
  disa_stig:
    - N/A
  cis:
    benchmark:
      - N/A
    controls v8:
      - 6.3
      - 6.4
      - 6.5
macOS:
  - "11.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - cnssi-1253
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    allowSmartCard: true
