id: sysprefs_loginwindow_prompt_username_password_enforce
title: "Configure Login Window to Prompt for Username and Password"
discussion: |
  The login window _MUST_ be configured to prompt all users for both a username and a password. 

  By default, the system displays a list of known users on the login window, which can make it easier for a malicious user to gain access to someone else’s account. Requiring users to type in both their username and password mitigates the risk of unauthorized users gaining access to the information system. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SHOWFULLNAME = 1'
result: 
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84839-0
  cci: 
    - N/A
  800-53r4: 
    - IA-2
  srg: 
    - SRG-OS-000480-GPOS-00229
  disa_stig: 
    - N/A
  800-171r2:
    - 3.5.1
    - 3.5.2
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    SHOWFULLNAME: true
