id: sysprefs_firewall_enable
title: "Enable macOS Application Firewall"
discussion: |
  The macOS Application Firewall is the built-in firewall that comes with macOS, and it _MUST_ be enabled. 

  When the macOS Application Firewall is enabled, the flow of information within the information system and between interconnected systems will be controlled by approved authorizations.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'EnableFirewall = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91055-4
  cci: 
    - CCI-000366
  800-53r5:
    - AC-4
    - SC-7(12)
    - CM-7
    - CM-7(1)
    - SC-7
  800-53r4: 
    - AC-4
    - AC-6(1)
    - AC-19
    - SC-7
    - CM-7
    - CM-7(1)
    - SC-7(12)
  srg:
    - SRG-OS-000480-GPOS-00232
  disa_stig: 
    - APPL-12-XXXXXX
  800-171r2:
    - 3.1.3
    - 3.1.5
    - 3.1.18
    - 3.4.6
    - 3.13.1
    - 3.13.2
    - 3.13.5
macOS:
  - "12.0"
tags:
  - 800-53r5_low
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.security.firewall:
    EnableFirewall: true