id: sysprefs_internet_sharing_disable
title: "Disable Internet Sharing"
discussion: |
  If the system does not require Internet sharing, support for it is non-essential and _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling Internet sharing helps prevent the unauthorized connection of devices, unauthorized transfer of information, and unauthorized tunneling.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'forceInternetSharingOff = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91063-8
  cci: 
    - CCI-000381
  800-53r5:
    - AC-4
    - AC-20
  800-53r4: 
    - AC-4
    - AC-20
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.3
    - 3.1.20
  cis:
    benchmark: 
      - 2.4.2 (level 1)
    v8: 
      - 4.1
      - 4.8
macOS:
  - "12.0"
tags:
  - 800-53r5_low 
  - 800-53r4_low 
  - 800-53r4_moderate 
  - 800-53r4_high 
  - 800-53r5_moderate 
  - 800-53r5_high 
  - 800-171 
  - cnssi-1253
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.MCX:
    forceInternetSharingOff: true
