id: sysprefs_automatic_login_disable
title: "Disable Unattended or Automatic Logon to the System"
discussion: |
  Automatic logon _MUST_ be disabled.

  When automatic logons are enabled, the default user account is automatically logged on at boot time without prompting the user for a password. Even if the screen is later locked, a malicious user would be able to reboot the computer and find it already logged in. Disabling automatic logons mitigates this risk.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c '"com.apple.login.mcx.DisableAutoLoginClient" = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84825-9
  cci:
    - CCI-000366
  800-53r4:
    - IA-2
    - IA-5(13)
  srg:
    - SRG-OS-000480-GPOS-00229
  disa_stig:
    - AOSX-15-002066
  800-171r2:
    - 3.5.1
    - 3.5.2
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    com.apple.login.mcx.DisableAutoLoginClient: true
