id: sysprefs_content_caching_disable
title: "Disable Content Caching Service"
discussion: |
  Content caching _MUST_ be disabled. 

  Content caching is a macOS service that helps reduce Internet data usage and speed up software installation on Mac computers. It is not recommended for devices furnished to employees to act as a caching server. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowContentCaching = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85422-4
  cci: 
    - N/A
  800-53r5:
    - CM-7
  800-53r4:
    - CM-7
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - 3.4.6
macOS:
  - "11.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowContentCaching: false