id: sysprefs_screensaver_password_enforce
title: "Enforce Screen Saver Password"
discussion: |
  Users _MUST_ authenticate when unlocking the screen saver. 
  
  The screen saver acts as a session lock and prevents unauthorized users from accessing the current user’s account.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'askForPassword = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85443-0
  cci: 
    - CCI-000056
  800-53r5:
    - AC-11
  800-53r4: 
    - AC-11
  srg: 
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - APPL-11-000002
  800-171r2:
    - 3.1.10
macOS:
  - "11.0"
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPassword: true
