id: sysprefs_internet_sharing_disable
title: "Disable Internet Sharing"
discussion: |
  If the system does not require Internet sharing, support for it is non-essential and _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling Internet sharing helps prevent the unauthorized connection of devices, unauthorized transfer of information, and unauthorized tunneling.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'forceInternetSharingOff = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85433-1
  cci: 
    - CCI-000381
  800-53r5:
    - AC-4
  800-53r4: 
    - AC-4
    - AC-20
  srg: 
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - APPL-11-002007
  800-171r2:
    - 3.1.3
    - 3.1.20
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.MCX:
    forceInternetSharingOff: true
