id: sysprefs_loginwindow_prompt_username_password_enforce
title: "Configure Logon Window to Prompt for Username and Password"
discussion: |
  The logon window _MUST_ be configured to prompt all users for both a username and a password. 

  By default, the system displays a list of known users on the logon screen, which can make it easier for a malicious user to gain access to someone else’s account. Requiring users to type in both their username and password mitigates the risk of unauthorized users gaining access to the information system. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SHOWFULLNAME = 1'
result: 
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84839-0
  cci: 
    - N/A
  800-53r4: 
    - IA-2
  srg: 
    - SRG-OS-000480-GPOS-00229
  disa_stig: 
    - N/A
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    SHOWFULLNAME: true
