id: sysprefs_loginwindow_loginwindowtext_enable
title: "Configure Login Window to Show A Custom Message"
discussion: |
  The login window _MUST_ be configured to show a custom access warning message. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'LoginwindowText'
result: 
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark: 
      - 6.1.1 (level 1)
macOS:
  - "12.0"
tags:
  - cis_lvl1
  - cis_lvl2
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    LoginwindowText: "Approved message goes here"
