id: sysprefs_screensaver_timeout_enforce
title: "Enforce Screen Saver Timeout"
discussion: |
  The screen saver timeout _MUST_ be set to 15 minutes or a shorter length of time. 
  
  This rule ensures that a full session lock is triggered within no more than 15 minutes of inactivity.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/egrep -o -e "idleTime\s=\s([^;]+)" | /usr/bin/awk '{ if ($3 <= 900) {print "Yes"} else {print "No"}}'
result:
  string: "Yes"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91074-5
  cci: 
    - CCI-000057
  800-53r5:
    - AC-11
    - IA-11
  800-53r4: 
    - AC-11
  srg: 
    - SRG-OS-000029-GPOS-00010
  disa_stig: 
    - APPL-12-XXXXXX
  800-171r2:
    - 3.1.10
macOS:
  - "12.0"
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r5_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    idleTime: 900
