id: sysprefs_siri_disable
title: "Disable Siri"
discussion: |
  Support for Siri is non-essential and _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c '"Ironwood Allowed" = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84843-2
  cci: 
    - CCI-000381
    - CCI-001774
  800-53r4: 
    - CM-7(5)(b)
    - CM-7(b)
  srg: 
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig: 
    - AOSX-14-002020
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.ironwood.support:
    "Ironwood Allowed": false
