id: sysprefs_touchid_unlock_disable
title: "Disable TouchID to unlock the device"
discussion: |
  TouchID enables the ability to unlock a Mac system with a user fingerprint. Disable TouchID for "Unlocking your Mac" on enabled Macs. TouchID must be disabled for "Unlocking your Mac" on all Macs that are capable of using Touch ID. The system must retains the session lock until the user reestablishes access using established identification and authentication procedures.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowFingerprintForUnlock = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84849-9
  cci: 
    - CCI-000056
  800-53r4: 
    - AC-11(b)
  srg: 
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - AOSX-14-000001
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowFingerprintForUnlock: false
