id: sysprefs_ad_tracking_disable
title: "Disable Ad Tracking"
discussion: |
  Ad tracking and targeted ads _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling ad tracking ensures that applications and advertisers are unable to track users' interests and deliver targeted advertisements.  
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.AdLib')\
  .objectForKey('forceLimitAdTracking').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84822-6
  cci: 
    - N/A
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
    - SC-7(10)      
  800-53r4: 
    - AC-20
    - CM-7
    - CM-7(1)
  srg: 
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.20
    - 3.4.6
  cisv8:
    - 4.1
    - 4.8    
macOS:
  - "10.15"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - cisv8  
mobileconfig: true
mobileconfig_info:
  com.apple.AdLib:
    forceLimitAdTracking: true
