id: sysprefs_time_machine_auto_backup_enable
title: "Configure Time Machine for Automatic Backups"
discussion: |
  Automatic backups _MUST_ be enabled when using Time Machine. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'AutoBackup = 1'
result: 
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark: 
      - 2.7.1 (level 2)
    v8:
      - 11.2
macOS:
  - "12.0"
tags:
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.TimeMachine:
    AutoBackup: true