id: sysprefs_gatekeeper_override_disallow
title: "Configure Gatekeeper to Disallow End User Override"
discussion: |
  Gatekeeper _MUST_ be configured with a configuration profile to prevent normal users from overriding its settings. 

  If users are allowed to disable Gatekeeper or set it to a less restrictive setting, malware could be introduced into the system. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'DisableOverride = 1' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85430-7
  cci: 
    - N/A
  800-53r5:
    - CM-5
    - SI-7(15)
  800-53r4: 
    - CM-5
    - SI-7(15)
  srg: 
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.4.5
macOS:
  - "11.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.systempolicy.managed:
    DisableOverride: true
    
