id: sysprefs_improve_siri_dictation_disable
title: "Disable Sending Siri and Dictation Information to Apple"
discussion: |
  The ability for Apple to store and review audio of your Siri and Dictation interactions _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling the submission of Siri and Dictation information will mitigate the risk of unwanted data being sent to Apple. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c '"Siri Data Sharing Opt-In Status" = 2;'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84912-5
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
    - SC-7(10)
  800-53r4: 
    - CM-7
    - CM-7(1)
    - AC-20
    - SC-7(10)
  800-171r2:
    - 3.1.20
    - 3.4.6
macOS:
  - "10.15"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.assistant.support:
      "Siri Data Sharing Opt-In Status": 2