id: sysprefs_internet_sharing_disable
title: "Disable Internet Sharing"
discussion: |
  If the system does not require Internet Sharing, support it is non-essential and must be disabled.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'forceInternetSharingOff = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84837-4
  cci: 
    - CCI-000381
  800-53r4: 
    - CM-7(a)
  srg: 
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - AOSX-14-002007
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.MCX:
    forceInternetSharingOff: true
