id: sysprefs_touchid_unlock_disable
title: "Disable TouchID for Unlocking the Device"
discussion: |
  TouchID enables the ability to unlock a Mac system with a user’s fingerprint. 
  
  TouchID _MUST_ be disabled for "Unlocking your Mac" on all macOS devices that are capable of using Touch ID. 
  
  The system _MUST_ remain locked until the user establishes access using an authorized identification and authentication method. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowFingerprintForUnlock = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91083-6
  cci: 
    - CCI-000056
  800-53r5:
    - AC-11
  800-53r4: 
    - AC-11
  srg:
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.10
macOS:
  - "12.0"
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowFingerprintForUnlock: false
