id: sysprefs_screensaver_ask_for_password_delay_enforce
title: "Enforce Session Lock After Screen Saver is Started"
discussion: |
  A screen saver _MUST_ be enabled and the system _MUST_ be configured to require a password to unlock once the screensaver has been on for a maximum of five seconds. 
  
  An unattended system with an excessive grace period is vulnerable to a malicious user. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'askForPasswordDelay = 5'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84785-5
  cci: 
    - CCI-000056
  800-53r4: 
    - AC-11
  srg: 
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - AOSX-15-000003
  800-171r2:
    - 3.1.10
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
severity:
  - "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPasswordDelay: 5

