id: sysprefs_wallet_applepay_prefpane_hide
title: "Hide the System Preference Pane for Wallet and Apple Pay"
discussion: |
  The system preference pane for Wallet and Apple Pay _MUST_ be hidden.

  Hiding the system preference pane prevents the users from configuring Wallet and Apple Pay. 
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="HiddenPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.wallet
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85486-9
  cci: 
    - CCI-001774
    - CCI-000381
  800-53r5:
    - CM-7
    - CM-7(5)
  800-53r4: 
    - CM-7
    - CM-7(5)
  srg: 
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - APPL-11-002052
  800-171r2:
    - N/A
macOS:
  - "11.0"
tags:
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    HiddenPreferencePanes: 
      - com.apple.preferences.wallet
