id: sysprefs_password_hints_disable
title: "Disable Password Hints"
discussion: |
  Password hints _MUST_ be disabled.
  
  Password hints leak information about passwords that are currently in use and can lead to loss of confidentiality. 
check: |
  /usr/bin/osascript -l JavaScript << EOS
  ObjC.import('Foundation')
  ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.loginwindow')\
  .objectForKey('RetriesUntilHint'))
  EOS
result:
  integer: 0
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91067-9
  cci:
    - CCI-000366
  800-53r5:
    - IA-6
  800-53r4:
    - IA-6
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - 3.5.11
macOS:
  - "12.0"
tags:
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high 
  - 800-53r4_low 
  - 800-53r4_moderate 
  - 800-53r4_high 
  - 800-171 
  - cnssi-1253
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    RetriesUntilHint: 0
