id: sysprefs_screensaver_timeout_enforce
title: "Enforce Screen Saver Timeout"
discussion: |
  The screen saver timeout _MUST_ be set to 15 minutes or a shorter length of time. 
  
  This rule ensures that a full session lock is triggered within no more than 15 minutes of inactivity.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  ObjC.import('Foundation')
  ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
  .objectForKey('idleTime'))
  EOS
result:
  string: "Yes"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91074-5
  cci: 
    - CCI-000057
  800-53r5:
    - AC-11
    - IA-11
  800-53r4: 
    - AC-11
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.10
  cisv8:
    - 4.3
macOS:
  - "12.0"
tags:
  - 800-53r5_moderate 
  - 800-53r5_high 
  - 800-53r5_low 
  - 800-53r4_moderate 
  - 800-53r4_high 
  - 800-171 
  - cnssi-1253
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    idleTime: 900
