id: sysprefs_airdrop_share_extension_disable
title: "Disable AirDrop Share Extension"
discussion: |
  AirDrop share extension _MUST_ be disabled.  
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/awk '/DeniedExtensions/,/com.apple.NSExtension/' | /usr/bin/grep -c 'com.apple.share.AirDrop.send'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-11111-1
  cci: 
    - CCI-000381
  800-53r4:
    - CM-7
    - AC-3
    - AC-18
    - AC-20
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - AOSX-15-002009
  800-171r2:
    - 3.1.1
    - 3.1.2
    - 3.1.16
    - 3.1.20
    - 3.4.6
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.NSExtension:
    DeniedExtensions: 
      - com.apple.share.AirDrop.send
