id: sysprefs_bluetooth_disable
title: "Disable Bluetooth When no Approved Device is Connected"
discussion: |
  The macOS system _MUST_ be configured to disable Bluetooth unless there is an approved device connected.

  [IMPORTANT]
  ====
  Information System Security Officers (ISSOs) may make the risk-based decision not to disable Bluetooth, so as to maintain necessary functionality, but they are advised to first fully weigh the potential risks posed to their organization. 
  ====
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'DisableBluetooth = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85420-8
  cci: 
    - CCI-002418
  800-53r5:
    - AC-18(3)
    - SC-8
  800-53r4: 
    - AC-18(3)
    - SC-8
  srg: 
    - SRG-OS-000481-GPOS-000481
  disa_stig: 
    - APPL-11-002062
  800-171r2:
    - 3.13.8
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
severity: "low"
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.MCXBluetooth:
      DisableBluetooth: true
