id: sysprefs_loginwindow_prompt_username_password_enforce
title: "Configure login window to prompt for username and password"
discussion: |
  The logon window must be configured to prompt all users for both a username and a password. By default, the system displays a list of known users at the logon screen.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SHOWFULLNAME = 1'
result: 
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84839-0
  cci: 
    - N/A
  800-53r4: 
    - CM-6(b)
  srg: 
    - SRG-OS-000480-GPOS-00229
  disa_stig: 
    - N/A
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    SHOWFULLNAME: true
