id: sysprefs_screensaver_timeout_enforce
title: "Enforce Screen Saver Timeout"
discussion: |
  The screen saver timeout _MUST_ be set to 15 minutes. 
  
  This rule ensures that a full session lock is triggered after 15 minutes of inactivity.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
  .objectForKey('idleTime').js
  EOS
result:
  integer: 1200
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84788-9
  cci: 
    - CCI-000057
  800-53r5:
    - AC-11
    - IA-11
  800-53r4: 
    - AC-11
  srg: 
    - SRG-OS-000029-GPOS-00010
  disa_stig: 
    - AOSX-15-000004
  800-171r2:
    - 3.1.10
  cis:
    benchmark:
      - N/A
    controls v8:
      - 4.3
macOS:
  - "10.15"
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r5_low
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    idleTime: 900
