id: sysprefs_airplay_receiver_disable
title: "Disable Airplay Receiver"
discussion: |
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'AirplayRecieverEnabled = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
  800-53r4: 
    - N/A
  srg: 
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
macOS:
  - "12.0"
tags:
  - none
mobileconfig: true
mobileconfig_info:
  com.apple.controlcenter:
    AirplayRecieverEnabled: false
