id: sysprefs_password_hints_disable
title: "Disable Password Hints"
discussion: |
  Password hints _MUST_ be disabled.
  
  Password hints leak information about passwords that are currently in use and can lead to loss of confidentiality. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'RetriesUntilHint = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84840-8
  cci:
    - CCI-000366
  800-53r4:
    - IA-6
  srg:
    - SRG-OS-000480-GPOS-00227
  disa_stig:
    - AOSX-15-003012
  800-171r2:
    - 3.5.11
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    RetriesUntilHint: 0
