id: sysprefs_touchid_prefpane_disable
title: "Disable the System Preference Pane for Touch ID"
discussion: |
  The system preference pane for Touch ID _MUST_ be disabled.

  Disabling the system preference pane prevents the users from configuring Touch ID. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'com.apple.preferences.password'  
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - CCI-001774
    - CCI-000381
  800-53r5:
    - CM-7
    - CM-7(5)
  800-53r4: 
    - CM-7
    - CM-7(5)
  srg: 
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - APPL-12-002051
  800-171r2:
    - N/A
macOS:
  - "12.0"
tags:
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes: 
      - com.apple.preferences.password
