id: sysprefs_critical_update_install_enforce
title: "Enforce Critical Security Updates to be Installed"
discussion: |
  Ensure that security updates are installed as soon as they are available from Apple. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'CriticalUpdateInstall = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84936-4
  800-53r5:
    - SI-2
  800-53r4: 
    - N/A
  srg: 
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
macOS:
  - "10.15"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
mobileconfig: true
mobileconfig_info:
  com.apple.SoftwareUpdate:
    CriticalUpdateInstall: true
