id: sysprefs_gatekeeper_override_disallow
title: "Configure Gatekeeper to Disallow End User Override"
discussion: |
  Gatekeeper _MUST_ be configured with a configuration profile to prevent normal users from overriding its settings. 

  If users are allowed to disable Gatekeeper or set it to a less restrictive setting, malware could be introduced into the system. 
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.systempolicy.managed')\
  .objectForKey('DisableOverride').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84835-8
  cci: 
    - CCI-000366
  800-53r5:
    - CM-5
    - SI-7(15)
  800-53r4: 
    - CM-5
    - SI-7(15)
  srg: 
    - SRG-OS-000480-GPOS-00227
  disa_stig: 
    - AOSX-15-002061
  800-171r2:
    - 3.4.5
macOS:
  - "10.15"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.systempolicy.managed:
    DisableOverride: true
    
