id: sysprefs_gatekeeper_override_disallow
title: "Configure Gatekeeper to Disallow End User Override"
discussion: |
  Gatekeeper _MUST_ be configured with a configuration profile to prevent normal users from overriding its settings. 

  If users are allowed to disable Gatekeeper or set it to a less restrictive setting, malware could be introduced into the system. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'DisableOverride = 1'
result:
  integer: 1
fix: |
  To implement the prescribed state with a Configuration Profile, create a configuration profile (com.apple.systempolicy.managed) with the following key DisableOverride set to true
  [source,xml]
  ----
  <key>DisableOverride</key>
  <true/>
  ----
  NOTE - This will apply to the whole system
references:
  cce:
    - CCE-84835-8
  cci: 
    - CCI-000366
  800-53r4: 
    - CM-5
    - SI-7(15)
  srg: 
    - SRG-OS-000480-GPOS-00227
  disa_stig: 
    - AOSX-14-002061
  800-171r2:
    - 3.4.5
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.systempolicy.managed:
    DisableOverride: true
    
