id: sysprefs_apple_watch_unlock_disable
title: "Prevent Apple Watch from Terminating a Session Lock"
discussion: |
  Apple Watches are not an approved authenticator and their use _MUST_ be disabled.

  Disabling Apple watches is a necessary step to ensuring that the information system retains a session lock until the user reestablishes access using an authorized identification and authentication procedures.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowAutoUnlock = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84824-2
  cci: 
    - CCI-000056
  800-53r4: 
    - AC-11(b)
  srg: 
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - AOSX-14-000001
macOS:
  - "10.15"
  - "10.14"
tags:
  - cnssi-1253
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAutoUnlock: false
