id: sysprefs_fast_user_switching_disable
title: "Ensure Fast User Switching Is Disabled"
discussion: |
  Fast user switching _MUST_ be disabled. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'MultipleSessionEnabled = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  disa_stig:
    - N/A
  srg:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark: 
      - 5.15 (level 2)
    v8:
      - 4.1 
macOS:
  - "12.0"
tags:
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  .GlobalPreferences:
    MultipleSessionEnabled: true
    

