id: sysprefs_diagnostics_reports_disable
title: "Disable Sending Diagnostic and Usage Data to Apple"
discussion: |
  The ability to submit diagnostic data to Apple _MUST_ be disabled.
  
  The information system _MUST_ be configured to provide only essential capabilities. Disabling the submission of diagnostic and usage information will mitigate the risk of unwanted data being sent to Apple. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -Ec '(allowDiagnosticSubmission = 0|AutoSubmit = 0)'
result:
  integer: 2
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91052-1
  cci: 
    - CCI-000382
  800-53r5:
    - SI-11
    - AC-20
    - SC-7(10)
  800-53r4: 
    - AC-20
    - SI-11
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.20
macOS:
  - "12.0"
tags:
  - 800-53r5_low 
  - 800-53r4_low 
  - 800-53r4_moderate 
  - 800-53r4_high 
  - 800-53r5_moderate 
  - 800-53r5_high 
  - 800-171 
  - cnssi-1253
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.SubmitDiagInfo:
    AutoSubmit: false
  com.apple.applicationaccess:
    allowDiagnosticSubmission: false
