id: sysprefs_time_server_enforce
title: "Enable macOS Time Synchronization Daemon (timed)"
discussion: |
  The timed service _MUST_ be enabled on all networked systems and configured to set time automatically from the approved time server.

  This rule ensures the uniformity of time stamps for information systems with multiple system clocks and systems connected over a network.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  ObjC.import('Foundation')
  ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.ManagedClient.preferences')\
  .objectForKey('com.apple.timed'))
  EOS
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91081-0
  cci: 
    - CCI-001891
    - CCI-002046
  800-53r5:
    - AU-12(1)
    - SC-45(1)
  800-53r4: 
    - AU-8(1)
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.3.7
  cisv8:
    - 8.4
macOS:
  - "12.0"
tags:
  - 800-171 
  - cnssi-1253 
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high 
  - 800-53r4_moderate 
  - 800-53r4_high
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.timed:
      TMAutomaticTimeOnlyEnabled: true

