id: sysprefs_guest_account_disable
title: "Disable the Guest Account"
discussion: |
  Guest access _MUST_ be disabled. 
  
  Turning off guest access prevents anonymous users from accessing files.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.MCX')\
  .objectForKey('DisableGuestAccount').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85320-0
  cci:
    - CCI-001813
  800-53r5:
    - AC-2
    - AC-2(9)
  800-53r4:
    - AC-2
    - AC-2(9)
  srg:
    - SRG-OS-000364-GPOS-00151
  disa_stig:
    - APPL-11-002063
  800-171r2:
    - 3.5.1
    - 3.5.2
  cis:
    benchmark: 
      - 6.1.3 (level 1)
    controls v8: 
      - 5.2
      - 5.3
      - 6.8
macOS:
  - "11.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - stig
  - cisv8
  - cis_lvl1
  - cis_lvl2
severity: "high"
mobileconfig: true
mobileconfig_info:
  com.apple.MCX:
    DisableGuestAccount: true