id: sysprefs_loginwindow_prompt_username_password_enforce
title: "Configure Login Window to Prompt for Username and Password"
discussion: |
  The login window _MUST_ be configured to prompt all users for both a username and a password. 

  By default, the system displays a list of known users on the login window, which can make it easier for a malicious user to gain access to someone else's account. Requiring users to type in both their username and password mitigates the risk of unauthorized users gaining access to the information system. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SHOWFULLNAME = 1'
result: 
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91065-3
  cci: 
    - CCI-000366
  800-53r5:
    - IA-2
  800-53r4: 
    - IA-2
  srg:
    - SRG-OS-000480-GPOS-00229
  disa_stig:
    - APPL-12-005052
  800-171r2:
    - 3.5.1
    - 3.5.2
  cis:
    benchmark: 
      - 6.1.1 (level 1)
    v8: 
      - 4.1
macOS:
  - "12.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - cis_lvl1
  - cis_lvl2
  - cisv8
  - stig
severity: "low"  
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    SHOWFULLNAME: true
