id: sysprefs_screensaver_timeout_enforce
title: "Enforce Screen Saver Timeout"
discussion: |
  The screen saver timeout _MUST_ be set to 15 minutes. 
  
  This rule ensures that a full session lock is triggered after 15 minutes of inactivity.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'idleTime = 900'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85444-8
  cci: 
    - CCI-000057
  800-53r4: 
    - AC-11
  srg: 
    - SRG-OS-000029-GPOS-00010
  disa_stig: 
    - AOSX-15-000004
  800-171r2:
    - 3.1.10
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    idleTime: 900
