id: sysprefs_apple_watch_unlock_disable
title: "Prevent Apple Watch from Terminating a Session Lock"
discussion: |
  Apple Watches are not an approved authenticator and their use _MUST_ be disabled.

  Disabling Apple watches is a necessary step to ensuring that the information system retains a session lock until the user reestablishes access using an authorized identification and authentication procedures.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowAutoUnlock = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85418-2
    cci: 
    - CCI-000056
  800-53r4: 
    - AC-11
  srg: 
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - AOSX-15-000001
  800-171r2:
    - 3.1.10
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAutoUnlock: false
