id: system_settings_bluetooth_prefpane_disable
title: "Disable the Bluetooth System Preference Pane"
discussion: |
  This is required for compliance with the DISA STIG for macOS.

  The domain *com.apple.systempreferences* has been deprecated by Apple in macOS 13. The recommended way to disable System Setting Panes is to use the *DisabledSystemSettings* key.

  link:https://developer.apple.com/documentation/devicemanagement/systempreferences[]
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="DisabledPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.Bluetooth
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-92012-4
  cci:
    - CCI-002418
    - CCI-001967
  800-53r5:
    - N/A
  800-53r4:
    - SC-8
  srg:
    - SRG-OS-000379-GPOS-00164
    - SRG-OS-000481-GPOS-00481
  disa_stig:
    - APPL-13-002062
  800-171r3:
    - N/A
macOS:
  - "12.0"
tags:
  - stig
severity: "low"
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes:
      - com.apple.preferences.Bluetooth