---
id: os_application_deny_list
title: Apps not allowed on the device
discussion: |
  In case specific apps are allowed to be used on the device a specific list _SHOULD_VALUEONDEMAND_ needs to be defined by the MDM. These apps will not open on the device.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94517-0
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.8 - App-Installation)
    - ANNEX N
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - manual
  - indigo_base
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      blockedAppBundleIDs:
        - bundleID1
        - bundleID2
