---
id: os_allow_contacts_read_managed_sources_unmanaged_destinations_disable
title: Ensure Managed Apps Cannot Read Unmanaged Contact Accounts
discussion: |-
  Managed Apps _MUST_ not be allowed to read contacts from unamanged contact destinations.
check: " "
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94425-6
  cci:
    - CCI-000366
    - CCI-000051
    - CCI-000370
  800-53r5:
    - AC-3
    - MP-2
    - SC-7(10)
    - SC-39
  sfr:
    - "FMT_SMF_EXT.1.1 #42"
    - FDP_ACF_EXT.1.2
  disa_stig:
    - AIOS-18-012400
  indigo:
    - ANNEX D (Section 5.6.3 - Contacts)
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: low
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowUnmanagedToReadManagedContacts: false
