---
id: os_airprint_force_trusted_TLS
title: Requires trusted certificates for TLS printing communication
discussion: |
  The service AirPrint _MUST_ be configured to require trusted certificates for TLS printing communication.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94516-2
  800-53r5:
    - AC-17(02)
  indigo:
    - ANNEX K
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - indigo_high
  - 800-53r5_moderate
  - 800-53r5_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      forceAirPrintTrustedTLSRequirement: true
