---
id: os_apple_watch_wrist_detection_enable
title: Ensure Force Apple Watch wrist detection is set to Enabled
discussion: |
  Wrist detection _MUST_ be enabled for paired Apple Watches.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94430-6
  cci:
    - CCI-000381
  800-53r5:
    - AC-3
    - CM-7
    - CM-7(1)
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AIOS-18-011800
  cis:
    benchmark:
      - 2.2.1.13 (level 1 - End-User Owned Devices)
      - 3.2.1.27 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 3.3
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: low
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      forceWatchWristDetection: true
