---
id: os_auto_correction_disable
title: Disable Auto Correction
discussion: |
  The device _MUST_ be configured not to use the auto correction feature of the iOS.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94518-8
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowAutoCorrection: false
