---
id: os_airplay_outgoing_password_require
title:
  Require the User to Enter a Password when Connecting to an AirPlay-enabled
  device for the First Time.
discussion: |
  When a user is allowed to use AirPlay without a password, it may mistakenly associate the iPhone and iPad with an AirPlay-enabled device other than the one intended (i.e., by choosing the wrong one from the AirPlay list displayed). This creates the potential for someone in control of a mistakenly associated device to obtain DoD sensitive information without authorization. Requiring a password before such an association mitigates this risk. Passwords do not require any administration and are not required to comply with any complexity requirements.
check: " "
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94424-9
  cci:
    - CCI-000063
  800-53r5:
    - IA-3
  sfr:
    - "FMT_SMF_EXT.1.1 #40"
  disa_stig:
    - AIOS-18-010900
    - AIOS-18-010950
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: low
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      forceAirPlayOutgoingRequestsPairingPassword: true
