---
id: os_apple_watch_pairing_disable
title: Ensure Apple Watch Pairing is Disabled
discussion: |
  Pairing an Apple Watch _MUST_ be disabled.

  NOTE: Any currently paired Apple Watch is unpaired and the watch's content is erased.
check: ""
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94429-8
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - CM-7
    - CM-7(1)
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AIOS-18-012600
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowPairedWatch: false
