---
id: os_airprint_disable
title: Disable AirPrint
discussion: |
  The iOS built-in AirPrint capability _MUST_ be disabled.

  The service AirPrint _MUST_ be disabled to prevent intendedly printing content on unknown printers and leaking data.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94515-4
  800-53r5:
    - N/A
  indigo:
    - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowAirPrint: false
