---
id: os_call_recording_disable
title: Disable Call Recording
discussion: |
  The built-in Call Recording _MUST_ be disabled in certain organizations or jurisdictions by legal statutes and/or privacy laws.

  The Call Recording service announces to all users that a cellular phone call is about to be recorded. When recording stops (either manually by the user or by ending the call), the recording is saved to a new note in the Notes app. This functionality may be prohibited by certain organizations or jurisdictions by legal statutes and/or privacy laws.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94515-4
  800-53r5:
    - N/A
  indigo:
    - N/A
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowCallRecording: false
