---
id: os_definition_lookup_disable
title: Disable Definition Lookup on the device.
discussion: |
  The iOS device _MUST_ be configured not use the spell check feature of the OS.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94521-2
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
  indigo:
    - ANNEX K
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowDefinitionLookup: false
