---
id: os_device_name_change_disable
title: Disable device name changes
discussion: |
  The iOS device _MUST_ be configured to disable device name changes.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94522-0
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - indigo_base
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowDeviceNameModification: false
