---
id: os_esim_transfers_disable
title: Ensure the ability to transfer an eSIM is set to Disabled
discussion: |
  Outgoing transfers of eSIMs _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94524-6
  cci:
    - N/A
  800-53r5:
    - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowESIMOutgoingTransfers: false
