---
id: os_exchange_SMIME_encryption_default_certificate_overwrite_enable
title: Enable selecting the appropriate S/MIME encryption certificate.
discussion: |
  The iOS device needs some specific configurations for the Exchange setup to meet the minimum requirements.

  The user _MUST_ be enabled to select the appropriate signing identity.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94526-1
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.mail.managed
    PayloadContent:
      SMIMEEncryptByDefaultUserOverrideable: false
