---
id: os_exchange_SMIME_encryption_enforce
title: Setting S/MIME encrytion as default.
discussion: |
  The iOS device needs some specific configurations for the Exchange setup to meet the minimum requirements.

  The usage of S/MIME encryption _MUST_ be configured to set mail signing as the default.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94527-9
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.eas.account
    PayloadContent:
      SMIMEEncryptByDefault: true
