---
id: os_exchange_SMIME_signing_certificate_overwirte_disable
title: Disable changing the S/MIME signing settings.
discussion: |
  The iOS device needs some specific configurations for the Exchange setup to meet the minimum requirements.

  The option for a user to overwrite the of S/MIME configuration _MUST_ prevented.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94529-5
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.mail.managed
    PayloadContent:
      SMIMESigningCertificateUUIDUserOverrideable: false
