---
id: os_exchange_mail_recents_sync_disable
title: Prevent synching of recent recipients.
discussion: |
  The iOS device needs some specific configurations for the Exchange setup to meet the minimum requirements.

  The synchronization of recent addresses _MUST_ be prevented not to synchronize sensitive addresses locally to the device.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94532-9
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.mail.managed
    PayloadContent:
      disableMailRecentsSyncing: true
