---
id: os_enterprise_books_disable
title: Ensure Backup of Enterprise Books is set to Disabled
discussion: |-
  Apps _MUST_ be installed from authorized application repositories. Disallowing enterprise app trust prevents apps from being provisioned by universal provisioning profiles.
check: " "
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94436-3
  cci:
    - CCI-000366
    - CCI-002110
  800-53r5:
    - CM-6 b
  sfr:
    - "FMT_MOF_EXT.1.2 #40"
  disa_stig:
    - AIOS-18-003700
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - ios_stig
  - indigo_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowEnterpriseBookBackup: false
