---
id: os_exchange_peraccountVPN
title: Enforce per account VPN for managed Mail accounts.
discussion: |
  The iOS device needs some specific configurations for the Exchange setup to meet the minimum requirements.

  When leveraging per account VPN configurations mail, calendar and contacts need to be configured to leverage the specific VPNUUID in addition.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94533-7
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_base
  - indigo_high
odv:
  hint: Use UUID to leverage the specific VPNUUID
  recommended: VPNUUID
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.mail.managed
    PayloadContent:
      VPNUUID: $ODV
