---
id: os_find_my_friends_disable
title: Disable Find My Friends Service
discussion: |
  The Find My Friends service _MUST_ be disabled.

  Sharing the location of a device may be an violation to an organization and potentially put users at risk.
check: ""
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94440-5
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AIOS-18-013100
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: low
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowFindMyFriends: false
