---
id: os_iphone_widgets_on_mac_disable
title: Disable use of iPhone widgets on Mac
discussion: |
  iPhone widgets on Mac _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94446-2
  cci:
    - CCI-000366
  800-53r5:
    - CM-7
    - CM-7(1)
  sfr:
    - "FMT_SMF_EXT.1.1 #8b"
  disa_stig:
    - AIOS-18-010850
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - ios_stig
severity: low
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowiPhoneWidgetsOnMac: false
