---
id: os_image_wand_disable
title: Disable Apple Intelligence ImageWand
discussion:
  Apple Intelligence features such as Apple ImageWand that use off device
  AI _MUST_ be disabled.
check: " "
result:
  string: "false"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94519-6
  cci:
    - N/A
  800-53r5:
    - N/A
  sfr:
    - N/A
  disa_stig:
    - N/A
  indigo:
    - ANNEX K
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowImageWand: false
