---
id: os_mail_maildrop_disable
title: Ensure Allow Mail Drop is set to Disabled
discussion: |
  Mail Drop _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94448-8
  cci:
    - CCI-000366
    - CCI-000370
    - CCI-002314
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
    - SC-07(10)
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AIOS-18-011000
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)
  cis:
    benchmark:
      - 2.7.2 (level 2 - End-User Owned Devices)
      - 3.7.2 (level 2 - Institutionally-Owned Devices)
    controls v8:
      - 3.3
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2_byod
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.mail.managed
    PayloadContent:
      allowMailDrop: false
