id: os_marketplace_prevent
title: "Prevent 3rd party marketplaces"
discussion: |
  The iOS device _MUST_ be configured to prevent 3rd party market places to be installed.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94540-2
  cci:
    - CCI-000366
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'    
  800-53r5:
    - CM-11
  disa_stig:
    - AIOS-18-014900  
  indigo:
    - ANNEX K
iOS:
  - "18.0"
tags:
  - ios
  - indigo_base
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
severity: medium
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowMarketplaceAppInstallation: false
