---
id: os_mail_move_messages_disable
title: Ensure Allow user to move messages from this account is set to Disabled
discussion: |
  Mail from institutionally configured mail accounts _MUST_ not be allowed to move to personaly mail accounts.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94449-6
  cci:
    - CCI-000366
    - CCI-000370
    - CCI-000764
  800-53r5:
    - AC-21
    - CM-7
    - CM-7(1)
    - SC-4
    - SC-07(10)
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AIOS-18-011400
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)
  cis:
    benchmark:
      - 2.7.1 (level 1 - End-User Owned Devices)
      - 3.7.1 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 3.3
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.mail.managed
    PayloadContent:
      PreventMove: false
