---
id: os_on_device_translation_enforce
title: Ensure On Device Translation is Enforced
discussion: |
  The device _MUST_ be configured for on device translation.

  By enforcing on device translation this will mitigate the risk of unwanted data being sent to Apple.
check: ""
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94453-8
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - SI-11
    - AC-20
    - SC-7(10)
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AIOS-18-014500
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      forceOnDeviceOnlyTranslation: true
