---
id: os_password_autofill_disable
title: Disable Password Autofill
discussion: |
  Password Autofill _MUST_ be disabled.

  iOS allows users to save passwords and use the Password Autofill feature in Safari and compatible apps. To protect against malicious users gaining access to the device, this feature _MUST_ be disabled to prevent users from being prompted to save passwords in applications.
check: ""
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94455-3
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - IA-5(13)
    - CM-7
    - CM-7(1)
    - IA-11
    - IA-5
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AIOS-18-012700
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowPasswordAutoFill: false
