---
id: os_rapid_security_responses_install_enable
title: Allow to install Rapid Security Responses
discussion: |
  The iOS device _MUST_ be configured to allow the user to install Rapid Security Responses to enable the user to be up to date with security fixes.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94544-4
  800-53r5:
    - SI-2
    - SI-2(5)
    - SI-3
  indigo:
    - ANNEX D (Section 6.3.1.3 - Rapid security response)
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_base
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowRapidSecurityResponseInstallation: true
