---
id: os_require_managed_pasteboard_enforce
title: Ensure copy/paste of data from Managed to Unmanaged Applications is Disabled
discussion: |-
  The device _MUST_ be configured to disable copy/paste of data from managed to unmanaged applications.

  If 'true', copy and paste functionality respects the 'allowOpenFromManagedToUnmanaged' and 'allowOpenFromUnmanagedToManaged' restrictions.
check: ""
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94459-5
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - AC-23
    - SC-7(10)
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AIOS-18-014600
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - ios_stig
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      requireManagedPasteboard: true
