id: os_safari_popups_disable
title: "Disable Safari Popups"
discussion: |
  The iOS device _MUST_ be configured to automatically prevent popups on the device to protect users from malicious content.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94547-7
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "18.0"
tags:
  - ios
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariAllowPopups: false
