---
id: os_screen_observation_unprompted_disable
title: Prevent unprompted screen observation.
discussion: |
  The iOS device _MUST_ be configured to prevent automatic acceptance for unprompted screen observations to prevent data leakage via the classroom app.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94549-3
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - indigo_base
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      forceClassroomUnpromptedScreenObservation: false
