---
id: os_siri_user_generated_content_disable
title: Disallow user generated content with Siri
discussion: |
  The iOS built-in Siri service _MUST_ be disabled to prevent organizational data from being synchronized to Apple servers.

  Apple's Siri service does not provide an organization with enough control over the storage and access of data, and, therefore, automated synchronization _MUST_ be controlled by an organization approved service.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94553-5
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
    - SC-7(10)
  indigo:
    - ANNEX K
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_base
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowAssistantUserGeneratedContent: false
