---
id: os_screen_observation_remote_disable
title: Prevent remote screen observation
discussion: |
  The iOS device _MUST_ be configured to prevent remote screen observation via the classroom app to prevent data leakage via the classroom app.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94548-5
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_base
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowRemoteScreenObservation: false
