---
id: os_show_control_center_lock_screen_disable
title: Ensure Show Control Center in Lock screen is set to Disabled
discussion: |
  Control Center _MUST_ be disabled in the lock screen.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94465-2
  cci:
    - N/A
  800-53r5:
    - AC-11(1)
  sfr:
    - N/A
  disa_stig:
    - N/A
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - 2.2.1.14 (level 1 - End-User Owned Devices)
      - 3.2.1.31 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.3
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowLockScreenControlCenter: false
