---
id: os_show_calendar_lock_screen_disable
title: Ensure Calendar Notifications when the Device is Locked is set to Disabled
discussion: |-
  Many mobile devices display notifications on the lock screen so users can obtain relevant information in a timely manner without having to frequently unlock the phone to determine if there are new notifications. However, in many cases, these notifications can contain sensitive information. When they are available on the lock screen, an adversary can see them merely by being in close physical proximity to the device. Configuring the MOS to not send notifications to the lock screen mitigates this risk.

check: " "
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94464-5
  cci:
    - CCI-000060
  800-53r5:
    - AC-11(1)
  sfr:
    - "FMT_SMF_EXT.1.1 #18"
  disa_stig:
    - AIOS-18-007600
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowLockScreenTodayView: false
