---
id: os_spell_check_disable
title: Disable Spell Check
discussion: |
  The iOS device _MUST_ be configured to not use the spell check feature.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94554-3
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  indigo:
    - ANNEX K
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowSpellCheck: false
