---
id: os_safari_JavaScript_disable
title: Prevent Java Script
discussion: |
  The iOS device _MUST_ be configured to prevent Java Script support in Safari to prevent malicious code execution on the device.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94546-9
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      safariAllowJavaScript: false
