---
id: os_ssl_for_exchange_activesync_enable
title: Ensure SSL for Exchange ActiveSync
discussion: |-
  Exchange email messages are a form of data in transit and thus are vulnerable to eavesdropping and man-in-the-middle attacks. Secure Sockets Layer (SSL), also referred to as Transport Layer Security (TLS), provides encryption and authentication services that mitigate the risk of breach.
check: " "
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94468-6
  cci:
    - CCI-000764
  800-53r5:
    - N/A
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AIOS-18-011300
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - ios_stig
  - indigo_base
  - indigo_high
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.eas.account
    PayloadContent:
      ssl: true
