---
id: os_safari_force_fraud_warning_enable
title: Ensure Force Fraud Warning is set to Enabled
discussion: |
  Force fraud warning _MUST_ be enabled in Safari.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94461-1
  cci:
    - N/A
  800-53r5:
    - N/A
  sfr:
    - N/A
  disa_stig:
    - N/A
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - 2.2.2.1 (level 1 - End-User Owned Devices)
      - 3.2.2.1 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 9.4
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      safariForceFraudWarning: true
