---
id: os_unpaired_boot_disable
title: Disable the option to recover the device via an unpaired host
discussion: |
  The iOS device _MUST_ be configured to disable unpaired devices to boot devices into recovery.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94557-6
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_base
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowUnpairedExternalBootToRecovery: false
