---
id: os_update_OTAPKI_allow
title: Allow OTA Update of PKI
discussion: |
  The device _MUST_ be configured that the OTA update of the PKI is allowed.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94558-4
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowOTAPKIUpdates: true
