---
id: os_update_enforced_software_update_delay
title: Enforce Software Update Delay.
discussion: |
  The iOS device _MUST_ be configured to enforce a software update delay by $ODV days in order to validate compatibility with required software and infrastructure.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94560-0
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 6.3.1.2 - Update management)
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_base
  - indigo_high
odv:
  hint: Enforced a software update delay in days
  recommended: 30
  indigo_base: 30
  indigo_high: 30
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      forceDelayedSoftwareUpdates: true
      enforcedSoftwareUpdateDelay: $ODV
