---
id: os_video_conferencing_remote_control_disable
title: Ensure the remotely control a system via videoconferencing is set to Disabled
discussion: |
  Video conferencing remote control _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94561-8
  cci:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
  sfr:
    - N/A
  disa_stig:
    - N/A
operating_system:
  - name: iOS
    version:
      - 18.0
tags:
  - ios
  - indigo_base
  - indigo_high
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowVideoConferenceingRemoteControl: false
