---
id: os_web_distribution_app_installation_disable
title: Ensure the ability to install apps directly from the web is set to Disabled
discussion: |
  Web distrubtion of app installation _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94562-6
  cci:
    - CCI-000366
  800-53r5:
    - CM-11
  indigo:
    - ANNEX K
  sfr:
    - "FMT_SMF_EXT.1.1 #3"
  disa_stig:
    - AIOS-18-015000
operating_system:
  - name: ios
    version:
      - 18.0
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - indigo_base
  - indigo_high
  - ios_stig
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowWebDistributionAppInstallation: false
