id: os_handoff_disable
title: "Disable Handoff"
discussion: |
  Handoff _MUST_ be disabled. 

  Handoff allows you to continue working on a document or project when the user switches from one Apple device to another. Disabling Handoff prevents data transfers to unauthorized devices.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93428-1
  cci: 
    - CCI-000366
    - CCI-000370
    - CCI-000381
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
  disa_stig:
    - N/A
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.11 (level 2 - End-User Owned Devices)
      - 3.2.1.24 (level 2 - Institutionally-Owned Devices)
    controls v8:
      - 3.3
iOS:
  - "17.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2_byod
  - cis_lvl2_enterprise
  - cisv8
severity: "low"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowActivityContinuation: false
