---
id: pwpolicy_minimum_length_enforce
title: Require a Minimum Password Length of $ODV Characters
discussion: "The macOS _MUST_ be configured to require a minimum of $ODV characters\
  \ be used when a password is created.\n\nThis rule enforces password complexity\
  \ by requiring users to set passwords that are less vulnerable to malicious users.\n\
  \nNOTE: To comply with Executive Order 14028, \u201CImproving the Nation's Cybersecurity\u201D\
  , OMB M-22-09, \u201CMoving the U.S. Government Toward Zero Trust Cybersecurity\
  \ Principles\u201D, and NIST SP-800-63b, \u201CDigital Identity Guidelines: Authentication\
  \ and Lifecycle Management\u201D federal, military, and intelligence communities\
  \ must adopt the following configuration settings. Password policies must not require\
  \ the use of complexity policies such as upper characters, lower characters, or\
  \ special characters. Password policies must also not require the use of regular\
  \ rotation. Password policies should define a minimum length. Multifactor authentication\
  \ should be used where ever possible.\n"
check: |
  /usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath 'boolean(//*[contains(text(),"policyAttributePassword matches '\''.{$ODV,}'\''")])' -
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94340-7
  cci:
  - CCI-000205
  - CCI-004066
  800-53r5:
  - IA-5(1)
  800-53r4:
  - IA-5
  - IA-5(1)
  srg:
  - SRG-OS-000078-GPOS-00046
  disa_stig:
  - APPL-15-003010
  800-171r3:
  - 03.05.07
  cis:
    benchmark:
    - 5.2.2 (level 1)
    controls v8:
    - 5.2
  cmmc:
  - IA.L2-3.5.7
  - IA.L2-3.5.8
  - IA.L2-3.5.9
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-171
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cis_lvl1
- cis_lvl2
- cisv8
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- stig
- cnssi-1253_moderate
severity: medium
odv:
  hint: Minimum password length.
  recommended: 15
  cis_lvl1: 15
  cis_lvl2: 15
  stig: 14
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.mobiledevice.passwordpolicy
  PayloadContent:
    minLength: $ODV
ddm_info:
  declarationtype: com.apple.configuration.passcode.settings
  ddm_key: MinimumLength
  ddm_value: $ODV
