id: os_disallow_enterprise_app_trust
title: "Disallow Apps to be Installed from Unauthorized Sources"
discussion: |-
  Apps _MUST_ be installed from authorized application repositories. Disallowing enterprise app trust prevents apps from being provisioned by universal provisioning profiles.
check: ' '
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-93262-4
  cci:
    - CCI-000366
  800-53r5:
    - CM-11
  sfr:
    - 'FMT_SMF_EXT.1.1 #8a'
  disa_stig:
    - AIOS-16-007000
    - AIOS-16-707000
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - "16.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - ios_stig_byoad
severity: low
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowEnterpriseAppTrust: false
