<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>ConsentText</key>
    <dict>
      <key>default</key>
      <string>THE SOFTWARE IS PROVIDED 'AS IS' WITHOUT ANY WARRANTY OF ANY KIND, EITHER EXPRESSED,
        IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY THAT THE SOFTWARE WILL
        CONFORM TO SPECIFICATIONS, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
        PARTICULAR PURPOSE, AND FREEDOM FROM INFRINGEMENT, AND ANY WARRANTY THAT THE DOCUMENTATION
        WILL CONFORM TO THE SOFTWARE, OR ANY WARRANTY THAT THE SOFTWARE WILL BE ERROR FREE. IN NO
        EVENT SHALL NIST BE LIABLE FOR ANY DAMAGES, INCLUDING, BUT NOT LIMITED TO, DIRECT, INDIRECT,
        SPECIAL OR CONSEQUENTIAL DAMAGES, ARISING OUT OF, RESULTING FROM, OR IN ANY WAY CONNECTED
        WITH THIS SOFTWARE, WHETHER OR NOT BASED UPON WARRANTY, CONTRACT, TORT, OR OTHERWISE,
        WHETHER OR NOT INJURY WAS SUSTAINED BY PERSONS OR PROPERTY OR OTHERWISE, AND WHETHER OR NOT
        LOSS WAS SUSTAINED FROM, OR AROSE OUT OF THE RESULTS OF, OR USE OF, THE SOFTWARE OR SERVICES
        PROVIDED HEREUNDER.</string>
    </dict>
    <key>PayloadContent</key>
    <array>
      <dict>
        <key>Subsystems</key>
        <dict>
          <key>com.apple.alf</key>
          <dict>
            <key>DEFAULT-OPTIONS</key>
            <dict>
              <key>Enable-Private-Data</key>
              <true />
            </dict>
          </dict>
        </dict>
        <key>PayloadDisplayName</key>
        <string>ManagedClient logging</string>
        <key>PayloadEnabled</key>
        <true />
        <key>PayloadIdentifier</key>
        <string>alacarte.macOS.F2703864-4C1D-4E4A-A4C0-2573561CBF9C</string>
        <key>PayloadType</key>
        <string>com.apple.system.logging</string>
        <key>PayloadUUID</key>
        <string>F2703864-4C1D-4E4A-A4C0-2573561CBF9C</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
      </dict>
    </array>
    <key>PayloadDescription</key>
    <string>Configuration settings for com.apple.system.logging</string>
    <key>PayloadDisplayName</key>
    <string>Enable Private Data (com.apple.alf)</string>
    <key>PayloadIdentifier</key>
    <string>com.apple.system.logging</string>
    <key>PayloadOrganization</key>
    <string>macOS Security Compliance Project</string>
    <key>PayloadRemovalDisallowed</key>
    <false />
    <key>PayloadScope</key>
    <string>System</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>4A4CB411-30E8-4BC0-AC8E-7F15FD7C175A</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
  </dict>
</plist>
