id: "os_airdrop_unmanaged_destination_enable"
title: "Ensure Treat AirDrop as unmanaged destination is set to Enabled"
discussion: |
  AirDrop _MUST_ be treated as an unmanaged destination.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.10 (level 1)
      - 3.2.1.23 (level 1)
    v8:
      - 3.3
ios:
  - "16.0"
tags:
  - ios
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: ""
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAirDropUnmanaged: true