id: os_airprint_force_trusted_TLS
title: Requires trusted certificates for TLS printing communication
discussion: |
  The service AirPrint _MUST_ be configured to require trusted certificates for TLS printing communication.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - AC-17(02)
  indigo:
    - ANNEX K
  cci:
    - CCI-000366
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-26-016900
iOS:
  - '26.0'
tags:
  - ios
  - indigo_high
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAirPrintTrustedTLSRequirement: true
