id: os_airprint_disable
title: Disable AirPrint
discussion: |
  The iOS built-in AirPrint capability _MUST_ be disabled.

  The service AirPrint _MUST_ be disabled to prevent printing content on unknown printers and leaking data.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95642-5
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
  cci:
    - CCI-000366
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-26-016600
iOS:
  - '26.0'
tags:
  - ios
  - indigo_high
  - ios_stig
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirPrint: false
