id: os_allow_documents_managed_sources_unmanaged_destinations_disable
title: "Ensure Allow documents from managed sources in unmanaged destinations is set to Disabled"
discussion: |
  Documents from managed sources _MUST_ not be allowed in unmanaged destinations.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95439-6
  cci: 
    - CCI-002233
    - CCI-002530
  800-53r5:
    - AC-3
    - MP-2
    - SC-7(10)
    - SC-39
  sfr:
    - "FMT_SMF_EXT.1.1 #42"
    - "FDP_ACF_EXT.1.2"
  disa_stig:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.3 - Contacts)
    - ANNEX K
  cis:
    benchmark:
      - 2.2.1.8 (level 1 - End-User Owned Devices)
      - 3.2.1.21 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 3.3
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowOpenFromManagedToUnmanaged: false
