id: os_airdrop_disable
title: Ensure AirDrop is set to Disabled
discussion: |
  AirDrop _MUST_ be disabled to prevent file transfers to or from unauthorized devices.

  AirDrop allows users to share and receive files from other nearby Apple devices. 
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95561-7
  800-53r5:
  - AC-3
  - AC-20
  - CM-7
  - CM-7(1)
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirDrop: false
