id: os_web_allow_web_distribution_app_installation
title: "Ensure the ability to install apps directly from the web is set to Disabled"
discussion: |
  Web distrubtion of app installation _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    -
  800-53r5:
    - 
  sfr:
    - ''
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 
    controls v8:
      -
iOS:
  - "18.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
severity: ""
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowWebDistributionAppInstallation: false
