id: os_airdrop_unmanaged_destination_enable
title: "Ensure Treat AirDrop as unmanaged destination is set to Enabled"
discussion: |
  AirDrop _MUST_ be treated as an unmanaged destination.
check: ""
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95562-5
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
    - MP-2
    - SC-7(10)
visionOS:
  - '26.0'
tags:
  - visionos
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAirDropUnmanaged: true