id: os_allow_writing_tools
title: "Ensure the ability to use AI writing tools is set to Disabled"
discussion: |
  The ChatGPT feature of Apple Intelligence allows DOD information to be downloaded from the DOD iPhone/iPad and processed by the ChatGPT application in the cloud. The ChatGPT feature of Apple Intelligence increases the risk of compromise of sensitive DOD informationAI writing tools _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - CCI-000366
  800-53r5:
    - CM-6 b
  sfr:
    - FMT_MOF_EXT.1.2 #47
  disa_stig:
    - AIOS-18-015400
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 
    controls v8:
      -
iOS:
  - "18.0"
tags:
  - ios
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
  - ios_stig
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowWritingTools: false
