id: os_auto_unlock_disable
title: "Prevent Apple Watch from Unlocking a Device"
discussion: |-
  Apple Watches are not an approved authenticator and their use _MUST_ be disabled.

  Disabling Apple watches is a necessary step to ensuring that the information system retains a session lock until the user reestablishes access using an authorized identification and authentication procedures.
check: ''
fix: This is implemented by a Configuration Profile
references:
  cce:
    - N/A
  cci:
    - CCI-000765
    - CCI-000767
    - CCI-002235
  800-53r5:
    - AC-11
    - IA-2(1)
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - - AIOS-18-014800
  800-171r2:
    - N/A
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - "17.0"
tags:
  - ios
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAutoUnlock: false
