id: os_allow_contacts_read_managed_sources_unmanaged_destinations_disable
title: "Ensure Managed Apps Cannot Read Unmanaged Contact Accounts"
discussion: |
  Managed Apps _MUST_ not be allowed to read contacts from unamanged contact destinations.
check: ""
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95563-3
  800-53r5:
    - AC-3
    - MP-2
    - SC-7(10)
    - SC-39
visionOS:
  - '26.0'
tags:
  - visionos
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowUnmanagedToReadManagedContacts: false