id: os_airprint_disable
title: "Disable AirPrint"
discussion: |
  The iOS built-in AirPrint capability _MUST_ be disabled.

  The service AirPrint _MUST_ be disabled to prevent intendedly printing content on unknown printers and leaking data.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirPrint: false
