id: os_automatic_app_download_disable
title: "Disallow Automatic Downloads of Apps Purchased on other Apple Devices."
discussion: |
  The automatic download of apps to a mobile device could cause the exposure of sensitive  information when an unauthorized app is installed.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - CCI-000366
  800-53r5:
    - CM-7
    - CM-7(1)
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-18-016400
  indigo:
    - N/A
iOS:
  - "18.0"
tags:
  - ios
  - ios_stig  
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAutomaticAppDownloads: false
