id: "os_apple_watch_wrist_detection_enable"
title: "Ensure Force Apple Watch wrist detection is set to Enabled"
discussion: |
  Wrist detection _MUST_ be enabled for paired Apple Watches.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - AC-3
    - AC-5
    - AC-6
    - MP-2
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - AIOS-16-011800
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.13 (level 1 - End-User Owned Devices)
      - 3.2.1.27 (level 1 - Institutionally-Owned Devices)
    v8:
      - 3.3
iOS:
  - "16.0"
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5
  - stig
severity: "low"
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceWatchWristDetection: true