id: os_allow_documents_managed_sources_unmanaged_destinations_disable
title: "Ensure Allow documents from managed sources in unmanaged destinations is set to Disabled"
discussion: |
  Documents from managed sources _MUST_ not be allowed in unmanaged destinations.
check: ' '
result: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - AC-3
    - MP-2
    - SC-7(10)
    - SC-39
visionOS:
  - '2.0'
tags:
  - visionos
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowOpenFromManagedToUnmanaged: false