id: os_airprint_disable
title: "Disable AirPrint"
discussion: |
  The iOS built-in AirPrint capability _MUST_ be disabled.

  The service AirPrint _MUST_ be disabled to prevent inadvertently printing content on unknown printers and leaking data.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94515-4
  cci:
    - CCI-000366  
  800-53r5:
    - CM-6
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'    
  disa_stig:
    - AIOS-18-016600
  indigo:
    - Annex K
iOS:
  - "18.0"
tags:
  - ios
  - ios_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high 
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirPrint: false
