id: os_airdrop_disable
title: "Ensure AirDrop is set to Disabled"
discussion: |
  AirDrop _MUST_ be disabled to prevent file transfers to or from unauthorized devices.
  
  AirDrop allows users to share and receive files from other nearby Apple devices. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95431-3
  cci: 
    - CCI-002536
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
  sfr:
    - "FMT_SMF_EXT.1.1/WLAN"
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - AO26-POOP-00001
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: "medium"
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirDrop: false
