id: os_airdrop_disable
title: "Disable AirDrop"
discussion:   
  AirDrop _MUST_ be disabled to prevent file transfers to or from unauthorized devices.
  
  AirDrop allows users to share and receive files from other nearby Apple devices. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'DisableAirDrop = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84747-5
  cci: 
    - CCI-000381
  800-53r4:
    - CM-7
    - AC-3
    - AC-18
    - AC-20
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - AOSX-14-002009
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.NetworkBrowser:
    DisableAirDrop: true
