id: os_auto_correction_disable
title: "Disable Auto Correction"
discussion: |
  The device _MUST_ be configured not to use the auto correction feature of the iOS.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAutoCorrection: false
