id: os_appleid_prompt_disable
title: "Disable Apple ID setup at login"
discussion: |
  The prompt for Apple ID must be disabled during login, as it might mislead new users into creating unwanted Apple ID accounts upon their first login.
check: | 
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SkipCloudSetup = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84748-3
  cci:
    - CCI-000381
  800-53r4: 
    - CM-6(b)
    - CM-7(a)
  srg: 
    - SRG-OS-000480-GPOS-00227
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - AOSX-14-002035
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipCloudSetup: true
