id: os_allow_video_conferencing_remote_control
title: "Ensure the remotely control a system via videoconferencing is set to Disabled"
discussion: |
  Video conferencing remote control _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - 
  sfr:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 
    controls v8:
      -
iOS:
  - "18.0"
tags:
  - ios
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowVideoConferenceingRemoteControl: false
