id: os_airdrop_unmanaged_destination_enable
title: "Ensure Treat AirDrop as unmanaged destination is set to Enabled"
discussion: |
  AirDrop _MUST_ be treated as an unmanaged destination.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95432-1
  cci: 
    - CCI-000366
    - CCI-002008
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
    - MP-2
    - SC-7(10)
  sfr:
    - "FMT_SMF_EXT.1.1 #47"
  disa_stig:
    - N/A
  indigo:
    - ANNEX D (Section 5.7.5 - AirDrop)
    - ANNEX K
  cis:
    benchmark:
      - 2.2.1.10 (level 1 - End-User Owned Devices)
      - 3.2.1.23 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 3.3
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAirDropUnmanaged: true
