id: os_account_modification_disable
title: "Disallow account modification."
discussion: |
  The iOS devices _MUST_ be configured to prevent the untrained user to change account information.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93468-7
  800-53r5:
    - N/A
  indigo:
    - ANNEX K  
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAccountModification: false
