id: os_authentication_password_autofill_enable
title: Ensure Require Touch ID / Face ID authentication before AutoFill is set to
  Enabled
discussion: |
  Re-authentication _MUST_ be enabled at each Autofill operation.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95567-4
  800-53r5:
  - AC-3
  - IA-11
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAuthenticationBeforeAutoFill: true
