id: os_allow_contacts_write_managed_sources_unmanaged_destinations_disable
title: "Ensure Managed Apps Cannot Write to Unmanaged Contact Accounts"
discussion: |-
  Managed Apps _MUST_ not be allowed to write contacts to unamanged contact destinations.  
check: ''
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-94426-4
  cci:
    - CCI-000366
    - CCI-000051
    - CCI-000370
  800-53r5:
    - AC-3
    - MP-2
    - SC-7(10)
    - SC-39
  sfr:
    - 'FMT_SMF_EXT.1.1 #42'
    - 'FDP_ACF_EXT.1.2'
  disa_stig:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.3 - Contacts) 
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - 3.3
iOS:
  - "18.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - ios_stig_byoad
  - indigo_base
  - indigo_high
severity: "low"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowManagedToWriteUnmanagedContacts: false
