id: os_auto_correction_disable
title: "Disable Auto Correction"
discussion: |
  The device _SHOULD_ be configured not to use the auto correction feature of the iOS.
  
  This configuration is recommended but can be changed by the CISO.  
check: |
  Check your MDM to ensure that auto correction is disabled on the iOS endpoint, if decided by the CISO.
result:
  string: "false"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAutoCorrection: false
