id: os_account_modification_disable
title: "Disallow Account Modification"
discussion: |
  The iOS devices _MUST_ be configured to prevent the untrained user to change account information.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95430-5
  800-53r5:
  - AC-20
  - AC-20(1)
  - CM-7
  - CM-7(1)
  indigo:
    - ANNEX K  
iOS:
- "26.0"
tags:
  - ios
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAccountModification: false
