id: os_account_modification_disable
title: Disable AppleID and Internet Account Modifications
discussion: "The system _MUST_ disable account modification. \n\nAccount modification\
  \ includes adding additional or modifying internet accounts in Apple Mail, Calendar,\
  \ Contacts, in the Internet Account System Setting Pane, or the AppleID System Setting\
  \ Pane.\n\nThis prevents the addition of unauthorized accounts.\n\n[IMPORTANT]\n\
  ====\nSome organizations may allow the use and configuration of the built-in Mail.app,\
  \ Calendar.app, and Contacts.app for organizational communication. Information System\
  \ Security Officers (ISSOs) may make the risk-based decision not to disable the\
  \ Internet Accounts System Preference pane to avoid losing this functionality, but\
  \ they are advised to first fully weigh the potential risks posed to their organization.\n\
  ====\n"
check: ''
fix: 'This is implemented by a Configuration Profile.

  '
references:
  cce:
  - CCE-95560-9
  800-53r5:
  - AC-20
  - AC-20(1)
  - CM-7
  - CM-7(1)
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAccountModification: false
