id: os_allow_contacts_read_managed_sources_unmanaged_destinations_disable
title: Ensure Managed Apps Cannot Read Unmanaged Contact Accounts
discussion: |
  Managed Apps _MUST_ not be allowed to read contacts from unmanaged contact destinations.
check: ' '
fix: |
  This is implemented by a Configuration Profile
references:
  cce:
    - CCE-95644-1
  cci:
    - CCI-000366
    - CCI-000051
    - CCI-000370
  800-53r5:
    - AC-3
    - MP-2
    - SC-7(10)
    - SC-39
  sfr:
    - 'FMT_SMF_EXT.1.1 #42'
    - FDP_ACF_EXT.1.2
  disa_stig:
    - AIOS-26-012400
  indigo:
    - ANNEX D (Section 5.6.3 - Contacts)
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
  cmmc:
    - SI.L1-B.1.XIII
    - AC.L1-B.1.I
    - AC.L2-3.1.1
    - AC.L2-3.1.3
    - MP.L2-3.8.2
    - SI.L2-3.14.2
iOS:
  - '26.0'
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - indigo_base
  - indigo_high
  - cmmc_lvl1
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - ios_stig
severity: low
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowUnmanagedToReadManagedContacts: false
