id: os_authentication_password_autofill_enable
title: "Ensure Require Touch ID / Face ID authentication before AutoFill is set to Enabled"
discussion: |
  Re-authentication _MUST_ be enabled at each Autofill operation.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95445-3
  cci:
  - N/A
  800-53r5:
  - AC-3
  - IA-11
  sfr:
  - N/A
  disa_stig:
  - N/A
  indigo:
    - N/A
  cis:
    benchmark:
    - 3.2.1.26 (level 1 - Institutionally-Owned Devices)
    controls v8:
    - 3.3
iOS:
- "26.0"
tags:
- ios
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cis_lvl1_enterprise
- cis_lvl2_enterprise
- cisv8
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAuthenticationBeforeAutoFill: true
