id: os_allow_documents_unmanaged_sources_managed_destinations_disable
title: "Ensure Allow documents from unmanaged sources in managed destinations is set to Disabled"
discussion: |
  Documents from unmanaged sources _MUST_ not be allowed in managed destinations.
check: " "
fix: 'This is implemented by a Configuration Profile.

  '
references:
  cce:
    - CCE-95440-4
  cci:
    - N/A
  800-53r5:
    - AC-3
    - MP-2
    - SC-7(10)
    - SC-39
  sfr:
    - N/A
  disa_stig:
    - N/A
  indigo:
    - ANNEX D (section 5.8.3 - Institutional procurement)
    - ANNEX K
  cis:
    benchmark:
      - 2.2.1.9 (level 1 - End-User Owned Devices)
      - 3.2.1.22 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 3.3
  cmmc:
    - SI.L1-B.1.XIII
    - AC.L1-B.1.I
    - AC.L2-3.1.1
    - AC.L2-3.1.3
    - MP.L2-3.8.2
    - SI.L2-3.14.2
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
  - cmmc_lvl1
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowOpenFromUnmanagedToManaged: false
