id: "os_authentication_password_autofill_enable"
title: "Ensure Require Touch ID / Face ID authentication before AutoFill is set to Enabled"
discussion: |
  Re-authentication _MUST_ be enabled at each Autofill operation.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - AC-3
    - AC-5
    - AC-6
    - MP-2
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 3.2.1.26 (level 1)
    v8:
      - 3.3
iOS:
  - "16.0"
tags:
  - ios
  - cis_lvl1
  - cis_lvl2
  - cisv8
  - 800-53r5
severity: ""
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAuthenticationBeforeAutoFill: true