id: os_allow_prerelease_disable
title: Disable the Ability to Install PreRelease Software
discussion: |
  Beta software may contain features that could lead to the compromise of sensitive information or provide a vector for the attack on a network.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-96711-7
  cci:
    - CCI-000366
  800-53r5:
    - CM-6
    - CM-7
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AVOS-26-015500
visionOS:
  - '26.0'
tags:
  - visionos
  - visionos_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.softwareupdate:
    AllowPreReleaseInstallation: false
