id: os_airdrop_disable
title: "Ensure AirDrop is set to Disabled"
discussion: |
  AirDrop _MUST_ be disabled to prevent file transfers to or from unauthorized devices.
  
  AirDrop allows users to share and receive files from other nearby Apple devices. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93408-3
  cci: 
    - CCI-002536
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
  sfr:
    - 'FMT_SMF_EXT.1.1/WLAN'
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - AIOS-17-010200
    - AIOS-17-012500
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - "17.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
severity: "medium"
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirDrop: false
