id: os_account_modification_disable
title: "Disallow account modification."
discussion: |
  The iOS devices _SHOULD_ be configured to prevent the untrained user to change account information.
  
  This configuration is recommended but can be changed by the CISO.  
check: |
  Check your MDM to ensure that account modification is disabled on the iOS endpoint, if decided by the CISO.
result:
  string: "false"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K  
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAccountModification: false
