id: os_airprint_force_trusted_TLS
title: "Requires trusted certificates for TLS printing communication"
discussion: |
  The service AirPrint _MUST_ be configured to require trusted certificates for TLS printing communication.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95436-2
  800-53r5:
    - AC-17(02)
  indigo:
    - ANNEX K  
iOS:
  - "26.0"
tags:
  - ios
  - indigo_high
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAirPrintTrustedTLSRequirement: true
