id: os_web_allow_web_distribution_app_installation
title: "Apple iOS/iPadOS 18 must disable app installation from a website."
discussion: |
  Forcing all applications to be installed from authorized application repositories can prevent unauthorized and malicious applications from being installed and executed on mobile devices. Allowing such installations and executions could cause a compromise of DOD data accessible by these unauthorized/malicious applications.
check: " "
fix: |
  Install a configuration profile to disable app installation from a website.
references:
  cce:
    - N/A
  cci:
    - CCI-000366
  800-53r5:
    - CM-6 b
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-18-015000
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 
    controls v8:
      -
iOS:
  - "18.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
severity: ""
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowWebDistributionAppInstallation: false
