id: os_airprint_force_trusted_TLS
title: "Requires trusted certificates for TLS printing communication"
discussion: |
  The service AirPrint _MUST_ be configured to require trusted certificates for TLS printing communication.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94516-2
  cci:
    - CCI-000366    
  800-53r5:
    - AC-17(2)
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-18-016900    
  indigo:
    - ANNEX K  
iOS:
  - "18.0"
tags:
  - ios
  - indigo_high
  - ios_stig
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAirPrintTrustedTLSRequirement: true
