id: os_allow_enterprise_trust_disabled
title: Disable Allow Trusting Enterprise Apps
discussion: |
  Forcing all applications to be installed from authorized application repositories can prevent unauthorized and malicious applications from being installed and executed on mobile devices. 
  
  Allowing such installations and executions could cause a compromise of data accessible by these unauthorized/malicious applications.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - CCI-000366
  800-53r5:
    - AC-19
    - SI-7(5)
  sfr:
    - "FMT_SMF.1.1 #8"
  disa_stig:
    - AVOS-02-007000
visionOS:
  - "26.0"
tags:
- visionos
- visionos_stig
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
severity: high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowEnterpriseAppTrust: false
