id: os_airprint_credential_storage_disable
title: Disable Storage of AirPrint Credentials
discussion: |
  Storage of AirPrint credentials _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - CCI-000366
  800-53r5:
    - CM-6
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-26-016800
  indigo:
    - N/A
iOS:
  - '26.0'
tags:
  - ios
  - ios_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirPrintCredentialsStorage: false
