id: "os_allow_documents_unmanaged_sources_managed_destinations_disable"
title: "Ensure Allow documents from unmanaged sources in managed destinations is set to Disabled"
discussion: |
  Documents from unmanaged sources _MUST_ not be allowed in managed destinations.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - AC-3
    - AC-5
    - AC-6
    - MP-2
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.9 (level 1 - End-User Owned Devices)
      - 3.2.1.22 (level 1 - Institutionally-Owned Devices)
    v8:
      - 3.3
iOS:
  - "16.0"
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5
severity: ""
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowOpenFromUnmanagedToManaged: false