id: os_allow_contacts_write_managed_sources_unmanaged_destinations_disable
title: Ensure Managed Apps Cannot Write to Unmanaged Contact Accounts
discussion: |
  Managed Apps _MUST_ not be allowed to write contacts to unamanged contact
  destinations.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95564-1
  800-53r5:
  - AC-3
  - MP-2
  - SC-7(10)
  - SC-39
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowManagedToWriteUnmanagedContacts: false
