id: os_bonjour_disable
title: "Disable Bonjour Multicast"
discussion: |
  Bonjour multicast advertising _MUST_ be disabled to prevent the system from broadcasting its presence and available services over network interfaces.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'NoMulticastAdvertisements = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84749-1
  cci: 
    - CCI-000381
  800-53r4: 
    - CM-7
  srg: 
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - AOSX-14-002005
  800-171r2:
    - 3.4.6
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.mDNSResponder:
    NoMulticastAdvertisements: true
