id: os_bonjour_disable
title: "Disable Bonjour Multicast"
discussion: |
  Bonjour multicast advertising _MUST_ be disabled to prevent the system from broadcasting its presence and available services over network interfaces.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'NoMulticastAdvertisements = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-90908-5
  cci: 
    - CCI-000381
  800-53r5:
    - CM-7
    - CM-7(1)
  800-53r4: 
    - CM-7
    - CM-7(1)
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.4.6
macOS:
  - "12.0"
tags:
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high 
  - 800-53r4_low 
  - 800-53r4_moderate 
  - 800-53r4_high 
  - 800-171 
  - cnssi-1253
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mDNSResponder:
    NoMulticastAdvertisements: true
