id: os_burn_support_disable
title: Disable Burn Support
discussion: |
  Burn support _MUST_ be disabled.

  [IMPORTANT]
  ====
  Some organizations rely on the use of removable media for storing and sharing data. Information System Security Officers (ISSOs) may make the risk-based decision not to disable external hard drives to avoid losing this functionality, but they are advised to first fully weigh the potential risks posed to their organization.
  ====
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -Ec '(BurnSupport = off;|ProhibitBurn = 1;)'
result:
  integer: 2
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95170-7
  cci:
    - N/A
  800-53r5:
    - MP-7
  800-53r4:
    - MP-7(1)
  srg:
    - N/A
  disa_stig:
    - N/A
  cmmc:
    - MP.L2-3.8.7
    - MP.L2-3.8.8
  800-171r3:
    - 03.08.07
macOS:
  - '26.0'
tags:
  - 800-171
  - cnssi-1253_low
  - cnssi-1253_high
  - cmmc_lvl2
  - cnssi-1253_moderate
severity: low
mobileconfig: true
mobileconfig_info:
  com.apple.finder:
    ProhibitBurn: true
  com.apple.DiscRecording:
    BurnSupport: 'off'
