id: os_bonjour_disable
title: "Disable Bonjour Multicast"
discussion: |
  Bonjour multicast advertising _MUST_ be disabled to prevent the system from broadcasting its presence and available services over network interfaces.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'NoMulticastAdvertisements = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85299-6
  cci: 
    - CCI-000381
  800-53r4: 
    - CM-7
  srg: 
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - APPL-11-002005
  800-171r2:
    - 3.4.6
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mDNSResponder:
    NoMulticastAdvertisements: true
