id: os_bluetooth_modification_disable
title: "Bluetooth Status Modification Disabled"
discussion: |
  The ability to enable or disable Bluetooth _MUST_ be disabled. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95655-7
  cci:
    - CCI-000366
  800-53r5:
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_SMF.1.1 #47'
  disa_stig:
    - AIOS-26-018200
  indigo:
    - N/A
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
  cmmc:
    - CM.L2-3.4.6
    - CM.L2-3.4.7
iOS:
  - '26.0'
tags:
  - ios
  - ios_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowBluetoothModification: false
