id: os_camera_disable
title: "Disable Camera"
discussion: |
  macOS _MUST_ be configured to disable the camera.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowCamera = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84751-7
  cci: 
    - CCI-000381
    - CCI-001774
  800-53r4:
    - N/A
  srg: 
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig:
    - AOSX-15-002017
macOS:
  - "10.15"
tags:
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCamera: false
