id: os_chat_disable
title: "Prevent the Usage of iMessage"
discussion: |
  The iOS device _MUST_ be configured to disable iMessage on the device to prevent receiving malicious content via iMessage.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95606-0
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
  indigo:
    - ANNEX K  
iOS:
  - "26.0"
tags:
  - ios
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowChat: false
