id: os_call_recording_disable
title: "Disable Call Recording"
discussion: |
  The built-in Call Recording _MUST_ be disabled in certain organizations or jurisdictions by legal statutes and/or privacy laws.

  The Call Recording service announces to all users that a cellular phone call is about to be recorded. When recording stops (either manually by the user or by ending the call), the recording is saved to a new note in the Notes app. This functionality may be prohibited by certain organizations or jurisdictions by legal statutes and/or privacy laws.

check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - N/A
iOS:
  - "18.1"
tags:
  - ios
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCallRecording: false
