id: os_definition_lookup_disable
title: "Disable Definition Lookup on the Device"
discussion: |
  The iOS device _MUST_ be configured not use the spell check feature of the OS.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95454-5
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
  indigo:
    - ANNEX K
  cmmc:
    - AC.L1-B.1.III
    - AC.L2-3.1.20
    - CM.L2-3.4.6
    - CM.L2-3.4.7
iOS:
  - "26.0"
tags:
  - ios
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cmmc_lvl1
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowDefinitionLookup: false
