id: os_dvdram_disable
title: "Disable Blank CD"
discussion: |
  Blank CD media _MUST_ be disabled.
  
  [IMPORTANT]
  ====
  Some organizations rely on the use of removable media for storing and sharing data. Information System Security Officers (ISSOs) may make the risk-based decision not to disable external hard drives to avoid losing this functionality, but they are advised to first fully weigh the potential risks posed to their organization.
  ====
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep 'dvdram' -A3 | /usr/bin/grep -Ec "eject|alert"
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - CCI-000366
    - CCI-001967
  800-53r5:
    - MP-7
  800-53r4: 
    - MP-7(1)
  srg:
    - SRG-OS-000480-GPOS-00227
    - SRG-OS-000319-GPOS-00164
  disa_stig:
    - APPL-12-005051
  800-171r2:
    - 3.8.8
macOS:
  - "12.0"
tags:
  - stig
mobileconfig: true
mobileconfig_info:
  com.apple.systemuiserver:
    mount-controls:
      dvdram: 
        - alert
        - eject
    
