id: os_device_name_change_disable
title: "Disable Device Name Changes"
discussion: |
  The iOS device _MUST_ be configured to disable device name changes.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95455-2
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "26.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowDeviceNameModification: false
