id: os_default_browser_modification_disable
title: "Disable Modifying the Default Web Browser Application"
discussion: |
  The ability to modify the default web browser application _MUST_ be disabled to prevent unauthorized changes to the device's behavior.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95451-1
  cci:
    - N/A
  800-53r5:
    - CM-7
    - CM-7(1)
    - CM-6
  indigo:
    - N/A
  cmmc:
    - AU.L2-3.3.3
    - CM.L2-3.4.1
    - CM.L2-3.4.2
    - CM.L2-3.4.6
    - CM.L2-3.4.7
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowDefaultBrowserModification: false
