id: os_definition_lookup_disable
title: "Disable Definition Lookup on the device."
discussion: |
  The iOS device _SHOULD_ be configured not use the spell check feature of the OS.
  
  This configuration is recommended but can be changed by the CISO.  
check: |
  Check your MDM to ensure that definition lookup is disabled on the iOS endpoint, if decided by the CISO.
result:
  string: "false"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowDefinitionLookup: false
