id: os_diagnostics_reports_modification_disable
title: "Disable changing Sending Diagnostic and Usage Data to Apple"
discussion: |
  The ability to change the setting to submit diagnostic data to Apple _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling the submission of diagnostic and usage information will mitigate the risk of unwanted data being sent to Apple.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95457-8
  800-53r5:
    - SI-11
    - AC-20
    - SC-7(10)
  indigo:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: "high"
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowDiagnosticSubmissionModification: false
