id: os_diagnostics_reports_disable
title: Disable Sending Diagnostic and Usage Data to Apple
discussion: |
  The ability to submit diagnostic data to Apple _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling the submission of diagnostic and usage information will mitigate the risk of unwanted data being sent to Apple. 
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95570-8
  cci:
    - CCI-001199
  800-53r5:
    - AC-20
    - SC-7(10)
    - SI-11
  sfr:
    - 'FMT_SMF.1.1 #47a'
  disa_stig:
    - AVOS-26-013400
visionOS:
  - '26.0'
tags:
  - visionos
  - visionos_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowDiagnosticSubmission: false
