id: os_definition_lookup_disable
title: "Disable Definition Lookup on the device."
discussion: |
  The iOS device _MUST_ be configured not use the spell check feature of the OS.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
  indigo:
    - ANNEX K
iOS:
  - "26.0"
tags:
  - ios
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowDefinitionLookup: false
