id: os_exchange_SMIME_signing_certificate_overwrite_disable
title: "Disable changing the S/MIME signing settings"
discussion: |
  The iOS device needs some specific configurations for the Exchange setup to meet the minimum requirements.

  The option for a user to overwrite the of S/MIME configuration _MUST_ prevented.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)  
iOS:
  - "26.0"
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed: 
    SMIMESigningCertificateUUIDUserOverrideable: false
