id: os_esim_transfers_disable
title: "Ensure the ability to transfer an eSIM is set to Disabled"
discussion: |
  Outgoing transfers of eSIMs _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowESIMOutgoingTransfers: false
