id: os_external_intelligence_integration_disable
title: "External Intelligence Integrations Must Be Disabled"
discussion: |
  The external intelligence integration feature of Apple Intelligence allows information to be downloaded from the device and processed by an external application in the cloud. The external intelligence integration feature of Apple Intelligence increases the risk of compromise of sensitive information.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95473-5
  cci: 
    - CCI-000366
  800-53r5:
    - CM-6
    - CM-7
    - AC-20
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'    
  disa_stig:
    - N/A
iOS:
  - "18.2"
tags:
  - ios
  - ios_stig
severity: medium
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowExternalIntelligenceIntegrations: false
