id: os_external_intelligence_integration_sign_in_disable
title: "Sign In to External Intelligence Integrations Must Be Disabled"
discussion: |
  The ability to sign into external intelligence integrations _MUST_ be disabled.
  
  The external intelligence integration feature of Apple Intelligence allows information to be downloaded from the device and processed by an external application in the cloud. The external intelligence integration feature of Apple Intelligence increases the risk of compromise of sensitive information. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95574-0
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
visionOS:
  - "2.4"
tags:
  - visionos
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowExternalIntelligenceIntegrationsSignIn: false
