id: os_exchange_SMIME_signing_enabled
title: "Enable S/MIME signing of mails."
discussion: |
  The iOS device needs some specific configurations for the Exchange setup to meet the minimum requirements. 

  The usage of S/MIME signing _MUST_ be configured to set mail signing as the default.
check: ""
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95468-5
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)   
iOS:
  - "26.0"
tags:
  - ios
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed: 
    SMIMESigningEnabled: true
