id: os_exchange_SMIME_encryption_enforce
title: "Setting S/MIME encrytion as default."
discussion: |
  The iOS device needs some specific configurations for the Exchange setup to meet the minimum requirements.

  The usage of S/MIME encryption _MUST_ be configured to set mail signing as the default.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95465-1
  800-53r5:
    - N/A
  indigo:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
mobileconfig: true
mobileconfig_info:
  com.apple.eas.account: 
    SMIMEEncryptByDefault: true
