id: os_esim_delete
title: "Ensure the eSIM Contents are Deleted When Device is Erased"
discussion: |
  An eSIM may contain sensitive data and must be wiped of data when the mobile device is wiped to protect sensitive data from exposure.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95461-0
  cci:
  - CCI-001033
  800-53r5:
  - MP-6
  sfr:
  - "FMT_MOF_EXT.1.2 #47"
  disa_stig:
  - N/A
iOS:
- "26.0"
tags:
- ios
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
severity: medium
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forcePreserveESIMOnErase: false
