id: os_enterprise_books_disable
title: Ensure Backup of Enterprise Books is set to Disabled
discussion: |
  If a user is able to configure the security setting, the user could inadvertently or maliciously set it to a value that poses unacceptable risk to DoD information systems. An adversary could exploit vulnerabilities created by the weaker configuration to compromise DoD sensitive information.
check: ' '
fix: This is implemented by a Configuration Profile
references:
  cce:
    - N/A
  cci:
    - CCI-000366
    - CCI-002110
  800-53r5:
    - CM-6
  sfr:
    - 'FMT_MOF_EXT.1.2 #40'
  disa_stig:
    - AIOS-18-003700
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - '26.0'
tags:
  - ios
  - ios_stig
  - indigo_high
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowEnterpriseBookBackup: false
