id: os_esim_transfers_disable
title: "Ensure the ability to transfer an eSIM is set to Disabled"
discussion: |
  Outgoing transfers of eSIMs _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94524-6
  cci: 
    - CCI-000366
  800-53r5:
    - CM-7    
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'    
  disa_stig:
    - AIOS-18-017900
iOS:
  - "18.0"
tags:
  - ios
  - ios_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowESIMOutgoingTransfers: false
