id: os_external_intelligence_integration_sign_in_disable
title: Sign In to External Intelligence Integrations Must Be Disabled
discussion: |
  The ability to sign into external intelligence integrations _MUST_ be disabled.

  The external intelligence integration feature of Apple Intelligence allows information to be downloaded from the device and processed by an external application in the cloud. The external intelligence integration feature of Apple Intelligence increases the risk of compromise of sensitive information. 
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95574-0
  cci:
    - CCI-000366
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AVOS-26-015400
visionOS:
  - '26.0'
tags:
  - visionos
  - visionos_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowExternalIntelligenceIntegrationsSignIn: false
ddm_info:
  declarationtype: com.apple.configuration.external-intelligence.settings
  ddm_key: AllowSignIn
  ddm_value: false