id: os_external_intelligence_integration_sign_in_disable
title: Sign In to External Intelligence Integrations Must Be Disabled
discussion: "The ability to sign into external intelligence integrations _MUST_ be\
  \ disabled.\n\nThe external intelligence integration feature of Apple Intelligence\
  \ allows information to be downloaded from the device and processed by an external\
  \ application in the cloud. The external intelligence integration feature of Apple\
  \ Intelligence increases the risk of compromise of sensitive information. \n"
check: ' '
fix: 'This is implemented by a Configuration Profile.

  '
references:
  cce:
  - CCE-95474-3
  cci:
  - CCI-000366
  800-53r5:
  - CM-6
  - CM-7
  - AC-20
  sfr:
  - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
  - N/A
iOS:
- '26.0'
tags:
- ios
- ios_stig
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
severity: medium
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowExternalIntelligenceIntegrationsSignIn: false
