id: os_exchange_SMIME_encryption_default_certificate_overwrite_enable
title: "Enable selecting the appropriate S/MIME encryption certificate."
discussion: |
  The iOS device needs some specific configurations for the Exchange setup to meet the minimum requirements.

  The user _MUST_ be enabled to select the appropriate signing identity.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95464-4
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)  
iOS:
  - "26.0"
tags:
  - ios
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed:
    SMIMEEncryptByDefaultUserOverrideable: false
