id: "os_files_network_drive_access_disable"
title: "Ensure Allow network drive access in Files app is set to Disabled"
discussion: |
  Network drive acces in Files app _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 3.2.1.9 (level 2)
    v8:
      - 1.2
ios:
  - "16.0"
tags:
  - ios
  - cis_lvl2
  - cisv8
severity: ""
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowFilesNetworkDriveAccess: false