id: os_facetime_disable
title: Disable FaceTime App
discussion: |
  FaceTime _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - CCI-000366
  800-53r5:
    - CM-6
    - CM-7
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-18-017800
  indigo:
    - N/A
iOS:
  - '26.0'
tags:
  - ios
  - ios_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
severity: high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowVideoConferencing: false
