id: os_files_network_drive_access_disable
title: Ensure Allow network drive access in Files app is set to Disabled
discussion: 'Network drive access in Files app _MUST_ be disabled.

  '
check: ''
fix: 'This is implemented by a Configuration Profile.

  '
references:
  cce:
  - CCE-95575-7
  800-53r5:
  - AC-20(2)
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowFilesNetworkDriveAccess: false
