id: os_files_usb_drive_access_disable
title: Ensure Allow USB Drive Access in Files App is Set to Disabled
discussion: |
  USB drive access in Files app _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95630-0
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - AC-20(2)
  800-53r4:
    - N/A
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - AIOS-26-013300
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - 3.2.1.8 (level 2 - Institutionally-Owned Devices)
    controls v8:
      - 1.2
iOS:
  - '26.0'
tags:
  - ios
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - ios_stig
severity: medium
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowFilesUSBDriveAccess: false
