id: os_filevault_autologin_disable
title: "Disable FileVault Automatic Login"
discussion: |
  If FileVault is enabled, automatic login _MUST_ be disabled, so that both FileVault and login window authentication are required.
  
  The default behavior of macOS when FileVault is enabled is to automatically log in to the computer once successfully passing your FileVault credentials. 
check: | 
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c "DisableFDEAutoLogin = 1"
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85310-1
  800-53r4:
    - AC-2(11)
    - AC-3
    - IA-5(13)
  srg: 
    - SRG-OS-000480-GPOS-00227
  disa_stig:
    - APPL-11-000033
  cci:
    - CCI-002143
  800-171r2:
    - 3.1.1
    - 3.1.2
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    DisableFDEAutoLogin: true
