id: os_force_date_and_time_enable
title: Ensure Force automatic date and time is set to Enabled
discussion: |
  Automatic date and time _MUST_ be enabled.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95576-5
  800-53r5:
  - AU-12(1)
  - SC-45(1)
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAutomaticDateAndTime: true
