id: os_firewall_log_enable
title: "Enable Firewall Logging"
discussion: |
  Firewall logging _MUST_ be enabled. 

  Firewall logging ensures that malicious network activity will be logged to the system. 

  NOTE: The firewall data is logged to Apple's Unified Logging with the subsystem com.apple.alf and the data is marked as private.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'EnableLogging = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - AU-12
    - SC-7
  800-53r4: 
    - SC-7
    - AU-12
  srg: 
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.3.1
    - 3.3.2
    - 3.13.1
    - 3.13.2
    - 3.13.5
macOS:
  - "12.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
mobileconfig: true
mobileconfig_info:
  com.apple.security.firewall:
    EnableLogging: true