id: os_force_date_and_time_enable
title: Ensure Force automatic date and time is set to Enabled
discussion: |
  Automatic date and time _MUST_ be enabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95478-4
  cci:
  - N/A
  800-53r5:
  - AU-12(1)
  - SC-45(1)
  sfr:
  - N/A
  disa_stig:
  - N/A
  indigo:
  - N/A
  cis:
    benchmark:
    - 2.2.1.7 (level 1 - End-User Owned Devices)
    - 3.2.1.17 (level 1 - Institutionally-Owned Devices)
    controls v8:
    - 8.4
iOS:
- '26.0'
tags:
- ios
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cis_lvl1_byod
- cis_lvl2_byod
- cis_lvl1_enterprise
- cis_lvl2_enterprise
- cisv8
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAutomaticDateAndTime: true
