id: os_files_network_drive_access_disable
title: "Ensure Allow network drive access in Files app is set to Disabled"
discussion: |
  Network drive access in Files app _MUST_ be disabled.
check: ' '
result: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - AC-20(2)
visionOS:
  - '2.0'
tags:
  - visionos
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowFilesNetworkDriveAccess: false