id: os_force_encrypted_backups_enable
title: "Ensure Force Encrypted Backups is Enabled"
discussion: |
  iOS and iPadOS backups _MUST_ be encrypted.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - AIOS-16-007300
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.4 (level 1 - End-User Owned Devices)
      - 3.2.1.10 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 11.3
ios:
  - "16.0"
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceEncryptedBackup: true