id: os_firewall_ui_disable
title: "Disable Firewall User Interface"
discussion: |
  The macOS Application Firewall is the built-in firewall that comes with macOS, and it _MUST_ be enabled and changes to the firewall through the user interface must be disabled.

check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.preference.security')\
  .objectForKey('dontAllowFireWallUI').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - CM-5
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - 3.4.5
  cis:
    benchmark: 
      - N/A
    controls v8: 
      - N/A
macOS:
  - "13.0"
tags:
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
mobileconfig: true
mobileconfig_info:
  com.apple.preference.security:
    dontAllowFireWallUI: true