id: os_gatekeeper_enable
title: "Enable Gatekeeper"
discussion: |
  Gatekeeper _MUST_ be enabled. 

  Gatekeeper is a security feature that ensures that applications are digitally signed by an Apple-issued certificate before they are permitted to run. Digital signatures allow the macOS host to verify that the application has not been modified by a malicious third party.

  Administrator users will still have the option to override these settings on a case-by-case basis.
check: | 
  /usr/sbin/spctl --status | /usr/bin/grep -c "assessments enabled"
result:
  integer: 1
fix: |
  [source,bash]
  ----
  /usr/sbin/spctl --global-enable
  ----
references:
  cce:
    - CCE-91793-0
  cci: 
    - CCI-001749
  800-53r5:
    - CM-14
    - CM-5
    - SI-7(1)
    - SI-7(15)
    - SI-3
  800-53r4: 
    - CM-5(3)
    - CM-5
    - SI-3
    - SI-7(15)
  srg:
    - SRG-OS-000366-GPOS-00153
  disa_stig:
    - APPL-12-002064
  800-171r2:
    - 3.4.5
  cis:
    benchmark:
      - 2.6.4 (level 1)
    controls v8:
      - 10.1
      - 10.2
      - 10.5
macOS:
  - "13.0"
tags:
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high 
  - 800-53r4_moderate 
  - 800-53r4_high 
  - 800-171 
  - cnssi-1253
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: "high"
mobileconfig: true
mobileconfig_info:
  com.apple.systempolicy.control:
    EnableAssessment: true
