id: os_genmoji_disable
title: "Ensure the ability to create Genmojis is set to Disabled"
discussion: |
  Use of Genmojis _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95577-3
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
visionOS:
  - "2.4"
tags:
  - visionos
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowGenmoji: false
