id: os_gatekeeper_rearm
title: "Enforce Gatekeeper 30 Day Automatic Rearm"
discussion: |
  Gatekeeper _MUST_ be configured to automatically rearm after 30 days if disabled.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'GKAutoRearm = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-90927-5
  cci: 
    - N/A
  800-53r5:
    - CM-5
  800-53r4: 
    - CM-5
    - SI-3
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - 3.4.5
  cisv8:
    - 10.5
macOS:
  - "12.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.security:
      GKAutoRearm: true