id: os_genmoji_disable
title: Disable Genmoji AI Creation
discussion: Apple Intelligence features such as Genmoji _MUST_ be disabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowGenmoji').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95196-2
  cci:
    - CCI-000381
    - CCI-001774
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - APPL-26-005140
  800-53r5:
    - CM-7
    - CM-7(1)
  800-171r3:
    - 03.04.06
  cmmc:
    - CM.L2-3.4.6
    - CM.L2-3.4.7
  hicp:
    - 2.L.A
macOS:
  - '26.0'
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_low
  - cnssi-1253_high
  - stig
  - 800-171
  - cmmc_lvl2
  - cmmc_lvl1
  - cnssi-1253_moderate
  - hicp_lp
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowGenmoji: false
