id: os_gatekeeper_rearm
title: "Enforce Gatekeeper 30 Day Automatic Rearm"
discussion: |
  Gatekeeper _MUST_ be configured to automatically rearm after 30 days if disabled.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'GKAutoRearm = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84852-3
  cci: 
    - N/A
  800-53r4: 
    - CM-5
  srg: 
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.4.5
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.security:
      GKAutoRearm: true