id: os_gatekeeper_rearm
title: "Enforce Gatekeeper 30 Day Automatic Rearm"
discussion: |
  Gatekeeper _MUST_ be configured to automatically rearm after 30 days if disabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security')\
  .objectForKey('GKAutoRearm').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85316-8
  cci: 
    - N/A
  800-53r5:
    - CM-5
  800-53r4: 
    - CM-5
    - SI-3
  srg: 
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.4.5
  cis:
    benchmark:
      - N/A
    controls v8:
      - 10.5
macOS:
  - "11.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.security:
      GKAutoRearm: true