id: os_gatekeeper_rearm
title: "Enforce Gatekeeper 30 day rearm"
discussion: |
  If Gatekeeper is disabled, there is an automatic setting for to be re-enabled after 30 days.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'GKAutoRearm = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84852-3
  cci: 
    - N/A
  800-53r4: 
    - CM-6(b)
  srg: 
    - N/A
  disa_stig: 
    - N/A
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.security:
      GKAutoRearm: true