id: os_gatekeeper_enable
title: "Enable Gatekeeper"
discussion: |
  Gatekeeper settings must be configured correctly to only allow the system to run applications downloaded from the Mac App Store or applications signed with a valid Apple Developer ID code. Administrator users will still have the option to override these settings on a per-app basis. Gatekeeper is a security feature that ensures that applications must be digitally signed by an Apple-issued certificate in order to run. Digital signatures allow the macOS host to verify that the application has not been modified by a malicious third party.
check: | 
  /usr/sbin/spctl --status | grep -c "assessments enabled"
result:
  integer: 1
fix: |
  [source,bash]
  ----
  /usr/sbin/spctl --master-enable
  ----
references:
  cce:
    - CCE-84759-0
  cci: 
    - CCI-001749
  800-53r4: 
    - CM-5(3)
    - CM-6(b)
  srg: 
    - SRG-OS-000366-GPOS-00153
  disa_stig: 
    - AOSX-14-002064
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.systempolicy.control:
    EnableAssessment: true
