id: os_handoff_disable
title: "Disable Handoff"
discussion: |
  Handoff _MUST_ be disabled. 

  Handoff allows you to continue working on a document or project when the user switches from one Apple device to another. Disabling Handoff prevents data transfers to unauthorized devices.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowActivityContinuation = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85321-8
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
  800-53r4:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
  disa_stig:
    - N/A
  srg: 
    - N/A
  cci: 
    - N/A    
  800-171r2:
    - 3.1.1
    - 3.1.2
    - 3.1.20
    - 3.4.6
  cisv8:
    - 3.3
    - 4.1
    - 4.8
    - 6.7
    - 12.2
macOS:
  - "11.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowActivityContinuation: false
