id: os_handoff_disable
title: "Disable Handoff"
discussion: |
  Handoff allows you to continue working from one Apple device to another. This feature should be disabled to prevent data transfers to unauthorized devices.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowActivityContinuation = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84763-2
  800-53r4:
    - AC-18(3)
    - CM-6(b)
    - CM-7(a)
    - CM-7(5)(b)
  disa_stig:
    - N/A
  srg: 
    - N/A
  cci: 
    - N/A    
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowActivityContinuation: false
