id: os_handoff_disable
title: Disable Handoff
discussion: "Handoff _MUST_ be disabled. \n\nHandoff allows you to continue working\
  \ on a document or project when the user switches from one Apple device to another.\
  \ Disabling Handoff prevents data transfers to unauthorized devices.\n"
check: ''
fix: 'This is implemented by a Configuration Profile.

  '
references:
  cce:
  - CCE-95578-1
  800-53r5:
  - AC-3
  - AC-20
  - CM-7
  - CM-7(1)
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowActivityContinuation: false
