id: os_iphone_mirroring_disable
title: "Ensure the Ability to Mirror a Device is Set to Disabled"
discussion: |
  Device mirroring _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95486-7
  cci:
    - CCI-000366
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
  sfr:
    - "FMT_MOF_EXT.1.2 #47"
  indigo:
    - ANNEX K
  disa_stig:
    - AIOS-26-015800
  cmmc:
    - AC.L1-B.1.I
    - AC.L2-3.1.1
    - AC.L1-B.1.III
    - AC.L2-3.1.20
    - CM.L2-3.4.6
    - CM.L2-3.4.7
iOS:
  - '26.0'
tags:
  - ios
  - ios_stig
  - indigo_base
  - indigo_high
  - cmmc_lvl1
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowiPhoneMirroring: false
