id: os_ir_support_disable
title: "Disable Infrared (IR) support"
discussion: |
  Infrared (IR) support _MUST_ be disabled to prevent users from controlling the system with IR devices. 
  
  By default, if IR is enabled, the system will accept IR control from any remote device. 
  
  Note: This is applicable only to models of Mac Mini systems earlier than Mac Mini8,1.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'DeviceEnabled = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84768-1
  cci: 
    - CCI-000366
  800-53r5:
    - AC-18
    - CM-7
  800-53r4: 
    - CM-7
    - AC-18
  srg: 
    - SRG-OS-000480-GPOS-00227
  disa_stig: 
    - AOSX-13-000075
  800-171r2:
    - 3.1.16
    - 3.4.6
macOS:
  - "10.15"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.driver.AppleIRController:
      DeviceEnabled: false