id: os_icloud_storage_prompt_disable
title: "Disable iCloud Storage setup at login" 
discussion: |
  The prompt for iCloud Storage Setup services must be disabled.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SkipiCloudStorageSetup = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84766-5
  cci:
    - CCI-000381
  800-53r4: 
    - CM-7(a)
  srg: 
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - AOSX-14-002037
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipiCloudStorageSetup: true
