id: os_image_wand_disable
title: Disable Apple Intelligence ImageWand
discussion: |
  Apple Intelligence features such as Apple ImageWand _MUST_ be disabled.
check: ' '
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95483-4
  cci:
    - CCI-000366
  800-53r5:
    - CM-7
    - CM-7(1)
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-26-017200
  indigo:
    - ANNEX K
iOS:
  - '26.0'
tags:
  - ios
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - ios_stig
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowImageWand: false
ddm_info:
  declarationtype: com.apple.configuration.intelligence.settings
  ddm_key: AllowImageWand
  ddm_value: false