id: os_image_wand_disable
title: Disable Apple Intelligence ImageWand
discussion: |-
  Apple Intelligence features such as Apple ImageWand that use off device AI _MUST_ be disabled.
check: " "
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
visionOS:
  - "2.4"
tags:
  - visionos
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowImageWand: false