id: os_image_wand_disable
title: Disable Apple Intelligence ImageWand
discussion: Apple Intelligence features such as Apple ImageWand _MUST_ be disabled.
check: ' '
result:
  string: 'false'
fix: 'This is implemented by a Configuration Profile.

  '
references:
  cce:
  - CCE-95580-7
  800-53r5:
  - CM-7
  - CM-7(1)
visionOS:
- '2.4'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowImageWand: false
