id: os_iphone_mirroring_disable
title: "Ensure the ability to mirror a device is set to Disabled"
discussion: |
  Device mirroring _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94537-8
  cci: 
    - CCI-000366
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  indigo:
    - ANNEX K
  disa_stig:
    - AIOS-18-015800
iOS:
  - "18.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowiPhoneMirroring: false
