id: os_icloud_storage_prompt_disable
title: "Disable iCloud Storage Setup during Setup Assistant" 
discussion: |
  The prompt to set up iCloud storage services during Setup Assistant _MUST_ be disabled.
  
  The default behavior of macOS is to prompt new users to set up storage in iCloud. Disabling the iCloud storage setup prompt provides organizations more control over the storage of their data. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SkipiCloudStorageSetup = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85324-2
  cci:
    - CCI-000381
  800-53r5:
    - AC-20
  800-53r4: 
    - AC-20
  srg: 
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - APPL-11-002037
  800-171r2:
    - 3.1.20
  cisv8:
    - 15.2
macOS:
  - "11.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - stig
  - cisv8
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipiCloudStorageSetup: true
