id: os_image_wand_disable
title: Disable Apple Intelligence ImageWand
discussion: |-
  Apple Intelligence features such as Apple ImageWand that use off device AI _MUST_ be disabled.
check: " "
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94519-6
  cci:
    - CCI-000366
  800-53r5:
    - CM-7
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-18-017200
  indigo:
    - ANNEX K
iOS:
  - "18.0"
tags:
  - ios
  - ios_stig
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high    
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowImageWand: false