id: os_ir_support_disable
title: "Disable Infrared (IR) support"
discussion: |
  Infrared (IR) support _MUST_ be disabled to prevent users from controlling the system with IR devices. 
  
  By default, if IR is enabled, the system will accept IR control from any remote device. 
  
  NOTE: This is applicable only to models of Mac Mini systems earlier than Mac Mini8,1.
check: |
  osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.driver.AppleIRController')\
  .objectForKey('DeviceEnabled').js
  EOS
result:
  string: "false"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85329-1
  cci: 
    - CCI-000366
  800-53r5:
    - AC-18
    - CM-7
    - CM-7(1)
  800-53r4: 
    - CM-7
    - CM-7(1)
    - AC-18
  srg: 
    - SRG-OS-000480-GPOS-00227
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.16
    - 3.4.6
  cis:
    benchmark:
      - N/A
    v8:
      - 4.1
      - 4.8
      - 12.6
macOS:
  - "11.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.driver.AppleIRController:
      DeviceEnabled: false