id: os_internet_accounts_prefpane_disable
title: "The macOS system must be configured to disable the system preference pane for Internet Accounts."
discussion: |
  The system preference panel's Internet Accounts must be disabled to prevent the addition of unauthorized internet accounts.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'com.apple.preferences.internetaccounts'  
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84767-3
  cci: 
    - CCI-001774
  800-53r4: 
    - CM-7(5)(b)
    - CM-7(a)
  srg: 
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig: 
    - AOSX-14-002032
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes: 
      - com.apple.preferences.internetaccounts
