id: os_image_playground_disable
title: Ensure the ability to use AI image generation is set to Disabled
discussion: |
  AI image generation _MUST_ be disabled.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95579-9
  800-53r5:
  - CM-7
  - CM-7(1)
visionOS:
- '2.4'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowImagePlayground: false
