id: os_iphone_mirroring_disable
title: Disable iPhone Mirroring
discussion: |-
  iPhone mirroring _MUST_ be disabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowiPhoneMirroring').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.references:
references:
  cce:
    - CCE-94213-6
  cci:
    - N/A
  800-53r5:
    - N/A
macOS:
  - '15.0'
tags:
  - none
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowiPhoneMirroring: false
