id: os_ir_support_disable
title: "Disable Infrared (IR) support"
discussion: |
  IR support must be disabled to prevent users from controlling the system with IR devices. By default, if IR is enabled, the system will accept IR control from any remote device.
  Note: This is only appliciable to Mac Mini systems with a model earlier than MacMini8,1. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'DeviceEnabled = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84768-1
  cci: 
    - CCI-000366
  800-53r4: 
    - CM-6(b)
  srg: 
    - SRG-OS-000480-GPOS-00227
  disa_stig: 
    - AOSX-13-000075
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.driver.AppleIRController:
      DeviceEnabled: false