id: os_image_playground_disable
title: "Ensure the ability to use AI image generation is set to Disabled"
discussion: |
  AI image generation _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
visionOS:
  - "2.4"
tags:
  - visionos
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowImagePlayground: false
