id: os_iphone_mirroring_disable
title: Ensure the ability to mirror a device is set to Disabled
discussion: |
  Device mirroring _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95486-7
  cci:
  - CCI-000366
  800-53r5:
  - AC-3
  - AC-20
  - CM-7
  - CM-7(1)
  sfr:
  - 'FMT_MOF_EXT.1.2 #47'
  indigo:
    - N/A
iOS:
- '26.0'
tags:
- ios
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowiPhoneMirroring: false
