id: os_limit_ad_tracking_enable
title: Enable Limit Ad Tracking
discussion: |
  Ad tracking and targeted ads _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling ad tracking ensures that applications and advertisers are unable to track users' interests and deliver targeted advertisements.
check: ' '
fix: |
  This is implemented by a Configuration Profile
references:
  cce:
    - N/A
  cci:
    - CCI-000366
    - CCI-000370
    - CCI-001199
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - AIOS-26-010500
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - 4.8
iOS:
  - '26.0'
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cisv8
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - ios_stig
severity: low
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceLimitAdTracking: true
