id: os_lock_screen_notification_disable
title: Disable Notifications on the Lock Screen
discussion: |
  The visionOS device _MUST_ be configured to disable notifications on the lock screen as this could contain sensitive information.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - CCI-000060
  800-53r5:
    - CM-6
    - CM-7
  sfr:
    - "FMT_SMF.1.1 #18"
  disa_stig:
    - AVOS-02-007500
visionOS:
  - "26.0"
tags:
- visionos
- visionos_stig
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
severity: high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess::
    allowLockScreenNotificationsView: false
    