id: os_mail_summary_disable
title: Disable Apple Intelligence Mail Summary
discussion: Apple Intelligence features such as Apple Mail Summary that use off device
  AI _MUST_ be disabled.
check: ' '
result:
  string: 'false'
fix: This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95584-9
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
visionOS:
  - '26.0'
tags:
  - visionos
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowMailSummary: false
ddm_info:
  declarationtype: com.apple.configuration.intelligence.settings
  ddm_key: Apps
  ddm_value:
    Mail: 
      AllowSummary: false