id: "os_mail_maildrop_disable"
title: "Ensure Allow Mail Drop is set to Disabled"
discussion: |
  Mail Drop _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - AC-3
    - AC-5
    - AC-6
    - MP-2
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.7.2 (level 2 - End-User Owned Devices)
      - 3.7.2 (level 2 - Institutionally-Owned Devices)
    v8:
      - 3.3
iOS:
  - "16.0"
tags:
  - ios
  - cis_lvl2_byod
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5
severity: ""
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed:
    allowMailDrop: false