id: os_mail_summary_disable
title: "Disable Apple Intelligence Mail Summary"
discussion: |
  Apple Intelligence features such as Apple Mail Summary that use off device AI _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95668-0
  cci:
    - N/A
  800-53r5:
    - N/A
  sfr:
    - N/A
  disa_stig:
    - N/A
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - 2.9.3 (level 1 - End-User Owned Devices)
      - 3.10.3 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.1
      - 4.8
      - 15.3
iOS:
  - '26.0'
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowMailSummary: false