id: os_mail_summary_disable
title: "Disable Apple Intelligence Mail Summary"
discussion: |
  Apple Intelligence features such as Apple Mail Summary that use off device AI _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95494-1
  cci:
    - N/A
  800-53r5:
    - N/A
  sfr:
    - N/A
  disa_stig:
    - N/A
  indigo:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowMailSummary: false