id: os_mail_summary_disable
title: Disable Apple Intelligence Mail Summary
discussion: |-
  Apple Intelligence features such as Apple Mail Summary that use off device AI _MUST_ be disabled.
check: " "
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A
  sfr:
    - N/A
  disa_stig:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "18.0"
tags:
  - ios
  - indigo_base
  - indigo_high
tags:
  - ios
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowMailSummary: false