id: os_modify_cellular_data_app_settings_disable
title: "Ensure Allow Modifying Cellular Data App Settings is Set to Disabled"
discussion: |
  The ability to modify cellular data app settings _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95496-6
  cci:
    - N/A
  800-53r5:
    - CM-7
    - CM-7(1)
  sfr:
    - N/A
  disa_stig:
    - N/A
  cis:
    benchmark:
      - 3.2.1.18 (level 2 - Institutionally-Owned Devices)
    controls v8:
      - 4.1
  cmmc:
    - CM.L2-3.4.6
    - CM.L2-3.4.7
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2_enterprise
  - cisv8
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAppCellularDataModification: false
