id: os_mail_smart_reply_disable
title: Disable Apple Intelligence Mail Smart Replies
discussion: |
  Apple Intelligence features such as Mail Smart Replies that use off device AI _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94574-1
  cci: 
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  indigo:
    - N/A
iOS:
  - "18.4"
tags:
  - ios
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowMailSmartReplies: false