id: os_mail_app_disable
title: "Disable Mail App"
discussion: |
  The macOS built-in Mail.app _MUST_ be disabled. 

  The Mail.app contains functionality that can establish connections to Apple’s iCloud, even when security controls to disable iCloud access have been put in place.
check: |  
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -A 20 familyControlsEnabled | /usr/bin/grep -c "/Applications/Mail.app"
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84769-9
  cci: 
    - CCI-000381
    - CCI-001774
  800-53r4:
    - CM-7
    - AC-20
  srg:
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig:
    - AOSX-15-002019
  800-171r2:
    - 3.1.20
    - 3.4.6
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess.new:
    familyControlsEnabled: true
    pathBlackList: 
      - /Applications/Mail.app
