id: os_notes_transcription_summary_disable
title: "Disable Apple Intelligence Notes Transcription Summary"
discussion: |
  Apple Intelligence features such as Notes Transcription Summary that use off device AI _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
   - CCE-95500-5
  cci:
   - N/A
  800-53r5:
   - AC-20
   - AC-20(1)
   - CM-7
   - CM-7(1)
   - SC-7(10)
  indigo:
   - ANNEX K
  cis:
    benchmark:
      - 2.9.2 (level 1 - End-User Owned Devices)
      - 3.10.2 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.1
      - 4.8
      - 15.3
iOS:
 - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowNotesTranscriptionSummary: false
ddm_info:
  declarationtype: com.apple.configuration.intelligence.settings
  ddm_key: Apps
  ddm_value:
    Notes: 
      AllowTranscriptionSummary: false