id: os_new_device_proximity_disable
title: Ensure Allow Setting Up New Nearby Devices is Set to Disabled
discussion: |
  The setting up of new nearby devices _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95671-4
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - CM-6
    - CM-7
    - CM-7(1)
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - AIOS-26-012800
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - 3.2.1.28 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 3.13
  cmmc:
    - AU.L2-3.3.3
    - CM.L2-3.4.1
    - CM.L2-3.4.2
    - CM.L2-3.4.6
    - CM.L2-3.4.7
iOS:
  - '26.0'
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - ios_stig
severity: medium
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowProximitySetupToNewDevice: false
