id: os_new_device_proximity_disable
title: "Ensure Allow setting up new nearby devices is set to Disabled"
discussion: |
  The setting up of new nearby devices _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93235-0
  cci: 
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - CM-6
    - CM-7
    - CM-7(1)
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig: 
    - AIOS-16-012800
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 3.2.1.28 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 3.13
iOS:
  - "16.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
severity: "medium"
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowProximitySetupToNewDevice: false