id: os_network_known_only
title: "Only Allow Known Networks"
discussion: |
  The iOS device _MUST_ be configured to only allow known networks in case only trustworthy networks can be used. This can have a limitation on connectivity especially when devices are used in area with low or no network connectivity. 
check: " "
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95670-6
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.7 - Interfaces)
iOS:
  - '26.0'
tags:
  - ios
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceWiFiToAllowedNetworksOnly: true
