id: os_on_device_dictation_enforce
title: Ensure On Device Dictation is Enforced
discussion: |
  The device _MUST_ be configured for on device dictation.


  By enforcing on device dictation this will mitigate the risk of unwanted data being
  sent to Apple.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95585-6
  800-53r5:
  - SI-11
  - AC-20
  - SC-7(10)
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceOnDeviceOnlyDictation: true
