id: os_on_device_translation_enforce
title: "Ensure On Device Translation is Enforced"
discussion: |
  The device _MUST_ be configured for on device translation.

  By enforcing on device translation this will mitigate the risk of unwanted data being sent to Apple.
check: ''
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-93437-2
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - SI-11
    - AC-20
    - SC-7(10)
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - AIOS-17-014500
  800-171r2:
    - N/A
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - "17.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - indigo_base
  - indigo_high
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceOnDeviceOnlyTranslation: true
