id: os_on_device_dictation_enforce
title: Ensure On Device Dictation is Enforced
discussion: |
  The device _MUST_ be configured for on device dictation.

  By enforcing on device dictation this will mitigate the risk of unwanted data being sent to Apple.
check: ' '
fix: |
  This is implemented by a Configuration Profile
references:
  cce:
    - CCE-95672-2
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - SI-11
    - AC-20
    - SC-7(10)
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - AIOS-26-014400
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
  bio:
    - 8.12
iOS:
  - '26.0'
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - ios_stig
  - nlmapgov_plus
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceOnDeviceOnlyDictation: true
ddm_info:
  declarationtype: com.apple.configuration.intelligence.settings
  ddm_key: ForceOnDeviceOnlyTranslation
  ddm_value: true