id: os_password_autofill_disable
title: "Disable Password Autofill"
discussion: |
  macOS allows users to save passwords and use the AutoFill passwords feature in Safari and compatible apps. This feature shall be disabled to prevent users from being prompted to save passwords in applications.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowPasswordAutoFill = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84774-9
  800-53r4:
    - CM-6(a)
    - CM-6(b)
  disa_stig:
    - N/A
  srg:
    - N/A
  cci:
    - N/A
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordAutoFill: false
