id: os_password_sharing_disable
title: "Disable Password Sharing"
discussion: |
  Password Sharing _MUST_ be disabled. 

  The default behavior allows users to share a password over Airdrop with other Apple devices. This feature _MUST_ be disabled to prevent passwords from being shared.
check: ""
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - IA-5
visionOS:
  - '26.0'
tags:
  - visionos
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordSharing: false