id: os_pairing_non_configurator_hosts_disable
title: "Ensure Allow pairing with non-Configurator hosts is set to Disabled"
discussion: |
  Host pairing with a non-Configurator host _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93438-0
  cci: 
    - N/A
  800-53r5:
    - CM-6
    - CM-7
    - CM-7(1)
  sfr:
    - N/A
  disa_stig:
    - N/A
  cis:
    benchmark:
      - 3.2.1.20 (level 2 - Institutionally-Owned Devices)
    controls v8:
      - 4.8
iOS:
  - "17.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2_enterprise
  - cisv8
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowHostPairing: false