id: os_photos_app_disable
title: "Disable Photos App"
discussion: |-
  The iOS built-in Photos.app connection to Apple's iCloud service _MUST_ be disabled. 
  
  Apple's iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, automated photo synchronization _MUST_ be controlled by an organization approved service.
check: ' '
fix: This is implemented by a Configuration Profile
references:
  cce:
    - N/A
  cci:
    - CCI-000097
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - NA
  disa_stig:
    - AIOS-16-012000
  800-171r2:
    - N/A
  cis:
    benchmark:
      - N/A
    controls:
      - N/A
iOS:
  - '16.0'
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - stig
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudPhotoLibrary: false
