id: os_password_sharing_disable
title: Disable Password Sharing
discussion: |
  Password Sharing _MUST_ be disabled.

  The default behavior of iOS/iPadOS is to allow users to share a password over Airdrop between other macOS and iOS devices. This feature _MUST_ be disabled to prevent passwords from being shared.
check: ' '
fix: |
  This is implemented by a Configuration Profile
references:
  cce:
    - N/A
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - IA-5
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - AIOS-26-013000
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - '26.0'
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - ios_stig
severity: medium
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordSharing: false
