id: os_password_proximity_disable
title: "Disable Proximity Based Password Sharing Requests"
discussion: |
  Proximity based password sharing requests _MUST_ be disabled. 
  
  The default behavior of iOS is to allow users to request passwords from other known devices (macOS and iOS). This feature _MUST_ be disabled to prevent passwords from being shared.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - AIOS-16-012900
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 3.2.1.29 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 13.5
iOS:
  - "16.0"
tags:
  - ios
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordProximityRequests: false
