id: os_password_autofill_disable
title: Disable Password Autofill
discussion: |
  Password Autofill _MUST_ be disabled. 

  The system allows users to save passwords and use the Password Autofill feature in Safari and compatible apps. To protect against malicious users gaining access to the device, this feature _MUST_ be disabled to prevent users from being prompted to save passwords in applications.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95586-4
  cci:
    - CCI-0000366
  800-53r5:
    - IA-5(13)
    - CM-7
    - CM-7(1)
    - IA-11
    - IA-5
  sfr:
    'FMT_SMF.1.1 #47'
  disa_stig:
    - AVOS-02-12700
visionOS:
  - '26.0'
tags:
  - visionos
  - visionos_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordAutoFill: false
