id: os_password_proximity_disable
title: "Disable Proximity Based Password Sharing Requests"
discussion: |
  Proximity based password sharing requests _MUST_ be disabled. 
  
  The default behavior of iOS is to allow users to request passwords from other known devices (macOS and iOS). This feature _MUST_ be disabled to prevent passwords from being shared.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94456-1
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
  - IA-5
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - AIOS-18-012900
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - 3.2.1.29 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 13.5
iOS:
  - "18.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: "medium"
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordProximityRequests: false
