id: os_privacy_setup_prompt_disable
title: "Disable Privacy Setup Services During Setup Assistant"
discussion: |
  The prompt for Privacy Setup services during Setup Assistant _MUST_ be disabled.

  Organizations _MUST_ apply organization-wide configuration settings. The macOS Privacy Setup services prompt guides new users through enabling their own specific privacy settings; this is not essential and, therefore, _MUST_ be disabled to prevent against the risk of individuals electing privacy settings with the potential to override organization-wide settings.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SkipPrivacySetup = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85362-2
  cci:
    - CCI-000381
  800-53r4: 
    - N/A
  srg: 
    - SRG-OS-000480-GPOS-00227
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - AOSX-15-002036
macOS:
  - "11.0"
tags:
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipPrivacySetup: true