id: os_personalized_advertising_disable
title: Disable Personalized Advertising
discussion: "Ad tracking and targeted ads _MUST_ be disabled.\n\nThe information system\
  \ _MUST_ be configured to provide only essential capabilities. Disabling ad tracking\
  \ ensures that applications and advertisers are unable to track users' interests\
  \ and deliver targeted advertisements.  \n"
check: ''
fix: 'This is implemented by a Configuration Profile.

  '
references:
  cce:
  - CCE-95588-0
  800-53r5:
  - AC-20
  - CM-7
  - CM-7(1)
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowApplePersonalizedAdvertising: false
