id: os_password_proximity_disable
title: "Disable Proximity Based Password Sharing Requests"
discussion: |
  Proximity based password sharing requests _MUST_ be disabled. 
  
  The default behavior of macOS is to allow users to request passwords from other known devices (macOS and iOS). This feature _MUST_ be disabled to prevent passwords from being shared.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowPasswordProximityRequests = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85352-3
  cci:
    - N/A
  800-171r2:
    - 3.5.1
    - 3.5.2
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordProximityRequests: false
