id: os_personalized_handwriting_disable
title: "Ensure the ability to Analyze Handwriting is Set to Disabled"
discussion: |
  AI handwriting analysis _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95508-8
  cci:
  - N/A
  800-53r5:
  - AC-20
  - AC-20(1)
  - CM-7
  - CM-7(1)
  - SC-7(10)
  sfr:
  - N/A
  indigo:
  - ANNEX K
  disa_stig:
  - N/A
iOS:
- "26.0"
tags:
- ios
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- indigo_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPersonalizedHandwritingResults: false
