id: os_parental_controls_enable
title: "Enable Parental Controls"
discussion: |
  Parental Controls _MUST_ be enabled. 
  
  Control of program execution is a mechanism used to prevent program execution of unauthorized programs, which is critical to maintaining a secure system baseline.

  Parental Controls on the macOS consist of many different payloads, which are set individually depending on the type of control required. Enabling parental controls allows for further configuration of these restrictions.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess.new')\
  .objectForKey('familyControlsEnabled').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85350-7
  cci: 
    - CCI-001812
    - CCI-001764
  800-53r5:
    - CM-7(2)
  800-53r4: 
    - CM-7(2)
  srg: 
    - SRG-OS-000362-GPOS-00149
    - SRG-OS-000368-GPOS-00154
  disa_stig: 
    - N/A
  800-171r2:
    - 3.4.7
  cis:
    benchmark:
      - N/A
    controls v8:
      - 4.8
macOS:
  - "11.0"
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess.new:
    familyControlsEnabled: true
