id: os_password_sharing_disable
title: Disable Password Sharing
discussion: |
  Password Sharing _MUST_ be disabled. 

  The default behavior allows users to share a password over Airdrop with other Apple devices. This feature _MUST_ be disabled to prevent passwords from being shared.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95587-2
  cci:
    - CCI-000366
  800-53r5:
    - IA-5
  sfr:
    - 'FMT_SMF.1.1 #47'
  disa_stig:
    - AVOS-02-0130000
visionOS:
  - '26.0'
tags:
  - visionos
  - visionos_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordSharing: false
