id: os_predictive_keyboard_disable
title: "Disable the Use of Predictable Keyboards"
discussion: |
  The device _MUST_ be configured that the usage of the predictable keyboard feature is not possible.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95509-6
  800-53r5:
    - N/A
  indigo:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPredictiveKeyboard: false
