id: os_personalized_advertising_disable
title: "Disable Personalized Advertising"
discussion: |
  Ad tracking and targeted ads _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling ad tracking ensures that applications and advertisers are unable to track users' interests and deliver targeted advertisements.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93442-2
  cci: 
    - N/A
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
  sfr:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.5 (level 1 - End-User Owned Devices)
      - 3.2.1.11 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.8
iOS:
  - "17.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
severity: ""
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowApplePersonalizedAdvertising: false