id: os_password_sharing_disable
title: "Disable Password Sharing"
discussion: |
  Password Sharing _MUST_ be disabled. 
  
  The default behavior of macOS is to allow users to share a password over Airdrop between other macOS and iOS devices. This feature _MUST_ be disabled to prevent passwords from being shared.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowPasswordSharing = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84776-4
  800-53r5:
    - IA-5
  800-53r4:
    - IA-5
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - N/A
  srg:
    - N/A
  cci:
    - N/A
  800-171r2:
    - 3.5.1
    - 3.5.2
  cisv8:
    - 4.1
    - 4.8
macOS:
  - "10.15"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordSharing: false
