id: os_personalized_advertising_disable
title: "Disable Personalized Advertising"
discussion: |
  Ad tracking and targeted ads _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling ad tracking ensures that applications and advertisers are unable to track users' interests and deliver targeted advertisements.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94505-5
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
visionOS:
  - '2.0'
tags:
  - visionos
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowApplePersonalizedAdvertising: false