id: os_password_proximity_disable
title: "Disable Proximity Based Password Sharing Requests"
discussion: |
  Proximity based password sharing requests _MUST_ be disabled. 
  
  The default behavior of macOS is to allow users to request passwords from other known devices (macOS and iOS). This feature _MUST_ be disabled to prevent passwords from being shared.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowPasswordProximityRequests = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-90968-9
  cci:
    - N/A
  800-53r5:
    - IA-5
  800-53r4:
    - IA-5
  srg:
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig:
    - N/A
  srg:
    - N/A
  cci:
    - N/A
  800-171r2:
    - 3.5.1
    - 3.5.2
macOS:
  - "12.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordProximityRequests: false
