id: os_password_sharing_disable
title: "Disable Password Sharing"
discussion: |
  macOS allows you to share a password over Airdrop between other macOS and iOS devices. This feature shall be disabled to prevent passwords from being shared.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowPasswordSharing = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84776-4
  800-53r4:
    - CM-7(a)
    - CM-7(5)(b)
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - N/A
  srg:
    - N/A
  cci:
    - N/A
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordSharing: false
