id: os_rapid_security_responses_remove_disable
title: Disallow to remove Rapid Security Responses
discussion: 'The iOS device _MUST_ be configured not to allow the user to remove rapid
  security responses.

  '
check: ' '
fix: 'This is implemented by a Configuration Profile.

  '
references:
  cce:
  - CCE-95511-2
  800-53r5:
  - SI-2
  - SI-2(5)
  - SI-3
  indigo:
  - ANNEX D (Section 6.3.1.3 - Rapid security response)
iOS:
- '26.0'
tags:
- ios
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowRapidSecurityResponseRemoval: false
