id: os_rapid_security_responses_remove_disable
title: "Disallow to Remove Rapid Security Responses"
discussion: |
  The iOS device _MUST_ be configured not to allow the user to remove rapid security responses.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95511-2
  800-53r5:
    - SI-2
    - SI-2(5)
    - SI-3
  indigo:
    - ANNEX D (Section 6.3.1.3 - Rapid security response)
  cmmc:
    - SI.L1-B.1.XII
    - SI.L1-B.1.XIII
    - SI.L1-B.1.XIV
    - SI.L1-B.1.XV
    - SI.L2-3.14.1
    - SI.L2-3.14.2
    - SI.L2-3.14.4
    - RA.L2-3.11.3
iOS:
  - '26.0'
tags:
  - ios
  - indigo_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cmmc_lvl1
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowRapidSecurityResponseRemoval: false
