id: os_rapid_security_responses_install_enable
title: "Allow to install Rapid Security Responses"
discussion: |
  The iOS device _MUST_ be configured to allow the user to install Rapid Security Responses to enable the user to be up to date with security fixes.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 6.3.1.3 - Rapid security response)
iOS:
  - "17.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowRapidSecurityResponseInstallation: true
