id: os_rapid_security_response_allow
title: "Enforce Rapid Security Response Mechanism"
discussion: |
  Rapid security response mechanism _MUST_ be enabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowRapidSecurityResponseInstallation').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - SI-2
    - SI-2(5)
    - SI-3
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - 3.14.1
    - 3.14.2
    - 3.13.3
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
macOS:
  - "13.0"
tags:
  - N/A
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowRapidSecurityResponseInstallation: true