id: os_require_managed_pasteboard_enforce
title: "Ensure copy/paste of data from Managed to Unmanaged Applications is Disabled"
discussion: |
  The device _MUST_ be configured to disable copy/paste of data from managed to unmanaged applications.

  If 'true', copy and paste functionality respects the 'allowOpenFromManagedToUnmanaged' and 'allowOpenFromUnmanagedToManaged' restrictions. 
check: ''
fix: |
  This is implemented by a Configuration Profile
references:
  cce:
    - CCE-95512-0
  cci:
    - CCI-000366
    - CCI-000097
    - CCI-000370
  800-53r5:
    - AC-23
    - SC-7(10)
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - N/A
  indigo:
    - N/A
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - "26.0"
tags:
  - ios
  - ios_stig
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    requireManagedPasteboard: true
