id: os_removable_media_disable
title: "Disable Removable Storage Devices"
discussion: |
  Removable media, such as USB connected external hard drives, thumb drives, and optical media, _MUST_ be disabled for users.
  
  Disabling removable storage devices reduces the risks and known vulnerabilities of such devices (e.g., malicious code insertion)
  
  [IMPORTANT]
  ====
  Some organizations rely on the use of removable media for storing and sharing data. Information System Security Officers (ISSOs) may make the risk-based decision not to disable external hard drives to avoid losing this functionality, but they are advised to first fully weigh the potential risks posed to their organization.
  ====
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.systemuiserver')\
  .objectForKey('mount-controls').js
  EOS
result:
  string: "harddisk-external:deny"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-90991-1
  cci: 
    - N/A
  800-53r5:
    - MP-7
  800-53r4: 
    - MP-7(1)
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.8.8
macOS:
  - "12.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
mobileconfig: true
mobileconfig_info:
  com.apple.systemuiserver:
    mount-controls:
      harddisk-external: 
        - alert
        - eject
    
