id: os_screen_observation_remote_disable
title: "Prevent Remote Screen Observation"
discussion: |
  The iOS device _MUST_ be configured to prevent remote screen observation via the classroom app to prevent data leakage via the classroom app.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95685-4
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "26.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowRemoteScreenObservation: false
    
