id: os_screensaver_ask_for_password_delay_enforce
title: "Enforce session lock no more than 5 seconds after screen saver is started"
discussion: |
  A screen saver must be enabled and set to require a password to unlock. An excessive grace period impacts the ability for a session to be truly locked, requiring authentication to unlock.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'askForPasswordDelay = 5'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84785-5
  cci: 
    - CCI-000056
  800-53r4: 
    - AC-11(b)
  srg: 
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - AOSX-14-000003
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPasswordDelay: 5

