id: os_safari_password_autofill_disable
title: "Disable Automatic Completion of Safari Browser Passcodes"
discussion: |
  The AutoFill functionality in the Safari web browser allows the user to complete a form that contains sensitive information, such as PII, without previous knowledge of the information. By allowing the use of the AutoFill functionality, an adversary who learns a user's iPhone or iPad passcode, or who otherwise is able to unlock the device, may be able to further breach other systems by relying on the AutoFill feature to provide information unknown to the adversary. By disabling the AutoFill functionality, the risk of an adversary gaining additional information about the device's user or compromising other systems is significantly mitigated.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - CCI-000366
    - CCI-000370
    - CCI-000381
  800-53r5:
    - IA-5(13)
    - CM-7
    - CM-7(1)
    - IA-11
    - IA-5
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - N/A
    controls v8:
      - 4.1
      - 4.8
iOS:
  - "17.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cisv8
severity: "low"
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariAllowAutoFill: false