id: os_safari_JavaScript_disable
title: "Prevent Jave Script"
discussion: |
  The iOS device _SHOULD_ be configured to prevent Java Script support in Safari to prevent malicious code execution on the device.
  
  This configuration is recommended but can be changed by the CISO.  
check: |
  Check your MDM to ensure that Safari JavaScript has been disabled on the iOS endpoint, if decided by the CISO.
result:
  string: "false"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariAllowJavaScript: false
