id: os_safari_show_status_bar_enabled
title: "Ensure Show Safari shows the Status Bar is Enabled"
discussion: |
  Safari _MUST_ be configured to show the status bar.
check: |

  if [ -n "${CACHED_PROFILES_FILE:-}" ] && [ -f "${CACHED_PROFILES_FILE}" ]; then
    /usr/bin/grep -qE 'ShowOverlayStatusBar = 1' "${CACHED_PROFILES_FILE}" && echo 1 || echo 0
  else
    /usr/bin/sudo /usr/bin/profiles -P -o stdout | /usr/bin/grep -qE 'ShowOverlayStatusBar = 1' && echo 1 || echo 0
  fi
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94284-7
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  disa_stig:
    - N/A
  srg:
    - N/A
  cis:
    benchmark:
      - 6.3.10 (level 1)
    controls v8:
      - 9.1
macOS:
  - '15.0'
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.Safari:
    ShowOverlayStatusBar: true
