id: os_safari_JavaScript_disable
title: "Prevent JavaScript"
discussion: |
  The iOS device _MUST_ be configured to prevent JavaScript support in Safari to prevent malicious code execution on the device.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95680-5
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "26.0"
tags:
  - ios
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariAllowJavaScript: false
