id: os_skip_unlock_with_watch_enabled
title: "Disable Unlock with Apple Watch During Setup Assistant"
discussion: |
  The prompt for Apple Watch unlock setup during Setup Assistant _MUST_ be disabled. 
  
  Disabling Apple watches is a necessary step to ensuring that the information system retains a session lock until the user reestablishes access using an authorized identification and authentication procedures.
check: | 
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SkipUnlockWithWatch = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91002-6
  cci:
    - CCI-000381
  800-53r5:
    - AC-20
  800-53r4: 
    - AC-20
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.20
macOS:
  - "12.0"
tags:
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high 
  - 800-53r4_low 
  - 800-53r4_moderate 
  - 800-53r4_high 
  - 800-171 
  - cnssi-1253
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipUnlockWithWatch: true
