id: os_skip_screen_time_prompt_enable
title: Disable Screen Time Prompt During Setup Assistant
discussion: The prompt for Screen Time setup during Setup Assistant _MUST_ be disabled.
check: |
  /usr/bin/osascript -l JavaScript 2>/dev/null << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipSetupItems').containsObject("ScreenTime")
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95300-0
  cci:
    - CCI-000381
  800-53r5:
    - CM-7
    - CM-7(1)
  800-53r4:
    - CM-7
    - CM-7(1)
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - APPL-26-005055
  cmmc:
    - CM.L2-3.4.6
    - CM.L2-3.4.7
  800-171r3:
    - 03.04.06
  hicp:
    - 2.L.A
macOS:
  - '26.0'
tags:
  - 800-171
  - cnssi-1253_low
  - cnssi-1253_high
  - cmmc_lvl2
  - stig
  - cnssi-1253_moderate
  - hicp_lp
severity: low
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipSetupItems:
      - ScreenTime
