id: os_safari_force_fraud_warning_enable
title: "Ensure Force Fraud Warning is set to Enabled"
discussion: |
  Force fraud warning _MUST_ be enabled in Safari.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95515-3
  cci: 
    - N/A
  800-53r5:
    - N/A
  sfr:
    - N/A
  disa_stig:
    - N/A
  indigo:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariForceFraudWarning: true