id: os_siri_user_generated_content_disable
title: "Disallow user generated content with Siri"
discussion: |
  The iOS built-in Siri service _MUST_ be disabled to prevent organizational data from being synchronized to Apple servers.

  Apple's Siri service does not provide an organization with enough control over the storage and access of data, and, therefore, automated synchronization _MUST_ be controlled by an organization approved service.  
check: |
  Check your MDM to ensure that user generated content with Siri has been disabled on the iOS endpoint.
result:
  string: "false"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAssistantUserGeneratedContent: false
