id: os_safari_password_autofill_disable
title: Disable Automatic Completion of Safari Browser Passcodes
discussion: |
  The AutoFill functionality in the Safari web browser allows the user
  to complete a form that contains sensitive information, such as PII, without previous
  knowledge of the information. By allowing the use of the AutoFill functionality,
  an adversary who learns a user''s iPhone or iPad passcode, or who otherwise is able
  to unlock the device, may be able to further breach other systems by relying on
  the AutoFill feature to provide information unknown to the adversary. By disabling
  the AutoFill functionality, the risk of an adversary gaining additional information
  about the device''s user or compromising other systems is significantly mitigated.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95590-6
  800-53r5:
  - IA-5(13)
  - CM-7
  - CM-7(1)
  - IA-11
  - IA-5
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariAllowAutoFill: false
