id: os_safari_popups_disabled
title: "Ensure Pop-Up Windows are Blocked in Safari"
discussion: |
  Safari _MUST_ be configured to block Pop-Up windows.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'safariAllowPopups = 0' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93014-9
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  disa_stig:
    - N/A
  srg:
    - N/A
  cis:
    benchmark:
      - 6.3.10 (level 1)
    controls v8:
      - 9.1
macOS:
  - "14.0"
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.Safari:
    safariAllowPopups: false
