id: os_safari_open_safe_downloads_disable
title: "Disable Automatic Opening of Safe Files in Safari"
discussion: |
  Open "safe" files after downloading _MUST_ be disabled in Safari. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'AutoOpenSafeDownloads = 0' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85510-6
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  disa_stig:
    - N/A
  srg:
    - N/A
  cis:
    benchmark:
      - 6.3 (level 1)
    v8:
      - 9
macOS:
  - "11.0"
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.Safari:
    AutoOpenSafeDownloads: false
