id: "os_safari_cookies_set"
title: "Ensure Accept cookies is set to From websites I visit or From current website only"
discussion: |
  Acceptance of cookies _MUST_ be only from sites visited.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - PM-20(01)
  sfr:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.2.2 (level 1 - End-User Owned Devices)
      - 3.2.2.2 (level 1 - Institutionally-Owned Devices)
    v8:
      - 9.4
ios:
  - "16.0"
tags:
  - ios
  - 800-53r5_privacy
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
severity: ""
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariAcceptCookies: 1.5