id: os_siri_user_generated_content_disable
title: "Disallow User Generated Content with Siri"
discussion: |
  The iOS built-in Siri service _MUST_ be disabled to prevent organizational data from being synchronized to Apple servers.

  Apple's Siri service does not provide an organization with enough control over the storage and access of data, and, therefore, automated synchronization _MUST_ be controlled by an organization approved service.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95528-6
  cci:
    - CCI-000366
  800-53r5:
    - AC-20
    - CM-7
    -  CM-7(1)
    - SC-7(10)
  indigo:
    - ANNEX K
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-26-016200
iOS:
- "26.0"
tags:
- ios
- ios_stig
- indigo_base
- indigo_high
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAssistantUserGeneratedContent: false
ddm_info:
  declarationtype: com.apple.configuration.siri.settings
  ddm_key: AllowUserGeneratedContent
  ddm_value: false