id: os_screenshots_disable
title: "Ensure Allow screenshots and screen recording is set to Disabled"
discussion: |
  Screenshots and screen recordings on _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - CM-7
    - CM-7(1)
    - SC-07(10)
visionOS:
  - '2.0'
tags:
  - visionos
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowScreenShot: false