id: os_spell_check_disable
title: "Disable Spell Check"
discussion: |
  The iOS device _MUST_ be configured not use the spell check feature of the OS.  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93502-3
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowSpellCheck: false
