id: os_screensaver_loginwindow_enforce
title: "Enforce Screen Saver at Login Window"
discussion: |
  A default screen saver _MUST_ be configured to display at the login window and _MUST_ not display any sensitive information.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
  .objectForKey('loginWindowModulePath').js
  EOS
result:
  string: "/System/Library/Screen Savers/Flurry.saver"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84786-3
  cci:
    - N/A
  800-53r5:
    - AC-11(1)
  800-53r4:
    - AC-11(1)
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - 3.1.10
macOS:
  - "10.15"
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    loginWindowModulePath: "/System/Library/Screen Savers/Flurry.saver"
