id: "os_screenshots_disable"
title: "Ensure Allow screenshots and screen recording is set to Disabled"
discussion: |
  Screenshots and screen recordings on iOS _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 3.2.1.1 (level 2 - Institutionally-Owned Devices)
    controls v8:
      - 3.3
iOS:
  - "16.0"
tags:
  - ios
  - cis_lvl2_enterprise
  - cisv8
severity: ""
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowScreenShot: false