id: os_share_location_data_disable
title: "Ensure Sharing of Location Data is Disabled"
discussion: |
  Sharing of location data is an operational security (OPSEC) risk because it potentially allows an adversary to determine a DoD user's location, movements, and patterns in those movements over time. An adversary could use this information to target the user or gather intelligence on the user's likely activities. Using commercial cloud services to store and handle location data could leave the data vulnerable to breach, particularly by sophisticated adversaries. Disabling the use of such services mitigates this risk.
check: ' '
fix: This is implemented by a Configuration Profile
references:
  cce:
    - N/A
  cci:
    - CCI-000048
  800-53r5:
    - AC-20
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - AIOS-16-011700
  800-171r2:
    - N/A
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - "16.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - stig
  - manual
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
