id: os_safari_force_fraud_warning_enable
title: "Ensure Force fraud warning is set to Enabled"
discussion: |
  Warn when visiting a fraudulent website _MUST_ be enabled in Safari. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  disa_stig:
    - N/A
  srg:
    - N/A
  cis:
    benchmark:
      - 2.2.2.1 (level 1)
      - 3.2.2.1 (level 1)
    controls v8:
      - 9.4
ios:
  - "16.0"
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariForceFraudWarning: true
