id: os_safari_popups_disable
title: "Disable Safari Popups"
discussion: |
  The iOS device _SHOULD_ be configured to automatically prevent popups on the device to protect users from malicious content.
  
  This configuration is recommended but can be changed by the CISO.  
check: |
  Check your MDM to ensure that AirPrint has been Safari popups are disabled on the iOS endpoint, if decided by the CISO.
result:
  string: "false"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariAllowPopups: false
