id: os_screenshots_disable
title: "Ensure Allow Screenshots and Screen Recording is Set to Disabled"
discussion: |
  Screenshots and screen recordings on iOS _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95521-1
  cci:
    - CCI-000366
  800-53r5:
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_MOF_EXT.1.2 #47'
  disa_stig:
    - AIOS-26-018000
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - 3.2.1.1 (level 2 - Institutionally-Owned Devices)
    controls v8:
      - 3.3
  cmmc:
    - CM.L2-3.4.6
    - CM.L2-3.4.7
iOS:
  - '26.0'
tags:
  - ios
  - ios_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
  - cmmc_lvl2
  - cmmc_lvl3
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowScreenShot: false
