id: os_safari_show_status_bar_enabled
title: "Ensure Show Safari shows the Status Bar is Enabled"
discussion: |
  Safari _MUST_ be configured to show the status bar.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'ShowOverlayStatusBar = 1' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95288-7
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  disa_stig:
    - N/A
  srg:
    - N/A
  cis:
    benchmark:
      - 6.3.10 (level 1)
    controls v8:
      - 9.1
  bio:
    - 8.27.01
macOS:
  - '26.0'
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
  - nlmapgov_plus
mobileconfig: true
mobileconfig_info:
  com.apple.Safari:
    ShowOverlayStatusBar: true
