id: os_siri_when_locked_disabled
title: "Ensure Allow Siri dialing while device is locked is set to Disabled"
discussion: |
  Accessing Siri while the device is locked _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.2 (level 1 - End-User Owned Devices)
      - 3.2.1.3 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.3
ios:
  - "16.0"
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAssistantWhileLocked: false