id: os_screensaver_password_enforce
title: "Enforce Screen Saver Password"
discussion: |
  Users _MUST_ authenticate when unlocking the screen saver. 
  
  The screen saver acts as a session lock and prevents unauthorized users from accessing the current user’s account.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'askForPassword = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84787-1
  cci: 
    - CCI-000056
  800-53r4: 
    - AC-11(b)
  srg: 
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - AOSX-14-000002
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPassword: true
