id: os_screenshots_disable
title: Ensure Allow screenshots and screen recording is set to Disabled
discussion: |
  Screenshots and screen recordings on iOS _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95521-1
  cci:
  - N/A
  800-53r5:
  - CM-7
  - CM-7(1)
  - SC-07(10)
  sfr:
  - N/A
  disa_stig:
  - N/A
  indigo:
    - N/A
  cis:
    benchmark:
    - 3.2.1.1 (level 2 - Institutionally-Owned Devices)
    controls v8:
    - 3.3
iOS:
- '26.0'
tags:
- ios
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cis_lvl2_enterprise
- cisv8
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowScreenShot: false
