id: "os_show_control_center_lock_screen_disable"
title: "Ensure Show Control Center in Lock screen is set to Disabled"
discussion: |
  Control Center _MUST_ be disabled in the lock screen.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - AC-2(5)
    - AC-11
    - AC-11(1)
    - AC-12
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.14 (level 1 - End-User Owned Devices)
      - 3.2.1.31 (level 1 - Institutionally-Owned Devices)
    v8:
      - 4.3
iOS:
  - "16.0"
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5
severity: ""
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowLockScreenControlCenter: false