id: os_skip_screen_time_prompt_enable
title: "Disable Screen Time Prompt During Setup Assistant"
discussion:   
  The prompt for Screen Time setup during Setup Assistant _MUST_ be disabled. 
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipScreenTime').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91880-5
  cci: 
    - N/A
  800-53r5:
    - CM-7
    - CM-7(1)
  800-53r4:
    - CM-7
    - CM-7(1)
  srg:
    - N/A
  disa_stig:
    - N/A
  cmmc:
    - CM.L2-3.4.6
    - CM.L2-3.4.7
macOS:
  - "13.0"
tags:
  - cmmc_lvl3
  - cmmc_lvl2
severity: "low"
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipScreenTime: true
