id: os_safari_reader_summary_disable
title: "Disable Apple Intelligence Safari Reader Summary"
discussion: |
  Apple Intelligence features such as Safari Reader Summary that use off device AI _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95518-7
  cci:
  - N/A
  800-53r5:
  - AC-20
  - AC-20(1)
  - CM-7
  - CM-7(1)
  - SC-7(10)
  indigo:
  - ANNEX K
iOS:
- "26.0"
tags:
- ios
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- indigo_base
- indigo_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowSafariSummary: false
ddm_info:
  declarationtype: com.apple.configuration.intelligence.settings
  ddm_key: Apps
  ddm_value:
    Safari: 
      AllowSummary: false