id: os_touchid_prompt_disable
title: "Disable TouchID Prompt during Setup Assistant"
discussion: |
  The prompt for TouchID during Setup Assistant _MUST_ be disabled.

  macOS prompts new users through enabling TouchID during Setup Assistant; this is not essential and, therefore, _MUST_ be disabled to prevent against the risk of individuals electing to enable TouchID to override organization-wide settings.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SkipTouchIDSetup = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91020-8
  cci:
    - CCI-000381
  800-53r5: 
    - CM-6
  800-53r4: 
    - CM-6
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig: 
    - APPL-12-005054
  800-171r2:
    - 3.4.1
    - 3.4.2
  cisv8:
    - 4.1
macOS:
  - "12.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - cisv8
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipTouchIDSetup: true
