id: os_touchid_prompt_disable
title: "Disable TouchID Prompt during Setup Assistant"
discussion: |
  The prompt for TouchID during Setup Assistant _MUST_ be disabled.

  MacOS prompts new users through enabling TouchID during Setup Assistant; this is not essential and, therefore, _MUST_ be disabled to prevent against the risk of individuals electing to enable TouchID to override organization-wide settings.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SkipTouchIDSetup = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84802-8
  cci:
    - N/A
  800-53r4: 
    - CM-6
  srg: 
    - SRG-OS-000480-GPOS-00227
  disa_stig: 
    - N/A
  800-171r2:
    - 3.4.1
    - 3.4.2
macOS:
  - "10.15"
tags:
  - 800-171
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipTouchIDSetup: true
