id: os_touchid_prompt_disable
title: Disable TouchID Prompt during Setup Assistant
discussion: |
  The prompt for TouchID during Setup Assistant _MUST_ be disabled.

  macOS prompts new users through enabling TouchID during Setup Assistant; this is not essential and, therefore, _MUST_ be disabled to prevent against the risk of individuals electing to enable TouchID to override organization-wide settings.
check: |
  /usr/bin/osascript -l JavaScript 2>/dev/null << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipSetupItems').containsObject("Biometric")
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95326-5
  cci:
    - CCI-000381
  800-53r5:
    - CM-6
  800-53r4:
    - CM-6
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - APPL-26-005054
  800-171r3:
    - 03.04.02
  cis:
    benchmark:
      - N/A
    controls v8:
      - 4.1
  cmmc:
    - CM.L2-3.4.2
  hicp:
    - 2.L.A
    - 3.L.A
macOS:
  - '26.0'
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
  - cnssi-1253_low
  - cnssi-1253_high
  - cmmc_lvl2
  - stig
  - cnssi-1253_moderate
  - hicp_lp
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipSetupItems:
      - Biometric
