id: os_touchid_prompt_disable
title: "Disable TouchID Prompt during Setup Assistant"
discussion: |
  The prompt for TouchID during Setup Assistant _MUST_ be disabled.

  macOS prompts new users through enabling TouchID during Setup Assistant; this is not essential and, therefore, _MUST_ be disabled to prevent against the risk of individuals electing to enable TouchID to override organization-wide settings.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipTouchIDSetup').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84802-8
  cci:
    - N/A
  800-53r5:
    - CM-6
  800-53r4: 
    - CM-6
  srg: 
    - SRG-OS-000480-GPOS-00227
  disa_stig: 
    - N/A
  800-171r2:
    - 3.4.1
    - 3.4.2
  cis:
    benchmark:
      - N/A
    controls v8:
      - 4.1
macOS:
  - "10.15"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipTouchIDSetup: true
