id: os_user_app_installation_prohibit
title: "Prohibit User Installation of Software into /Users/"
discussion: |
  Users _MUST_ not be allowed to install software into /Users/. 
  
  Allowing regular users to install software, without explicit privileges, presents the risk of untested and potentially malicious software being installed on the system. Explicit privileges (escalated or administrative privileges) provide the regular user with explicit capabilities and control that exceeds the rights of a regular user.
check: |
  /usr/bin/profiles -P -o stdout-xml | /usr/bin/sed -n '/pathBlackList/,/key/p' | /usr/bin/grep -c "/Users/"
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91023-2
  cci:
    - CCI-001812
  800-53r5:
    - CM-11(2)
  800-53r4:
    - CM-11(2)
  srg:
    - N/A
  disa_stig:
    - N/A
macOS:
  - "12.0"
tags:

severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess.new:
    familyControlsEnabled: true
    pathBlackList: 
      - "/Users/"
