id: os_update_enforced_software_update_delay
title: "Enforce Software Update Delay."
discussion: |
  The iOS device _MUST_ be configured to enforce a software update delay by $ODV days in order to validate compatibility with required software and infrastructure.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94560-0
  800-53r5:
    - N/A
  indigo:
    - N/A
iOS:
  - "18.0"
odv:
  hint: "Enforced a software update delay in days"
  recommended: 30
tags:
  - ios
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceDelayedSoftwareUpdates: true
    enforcedSoftwareUpdateDelay: $ODV
