id: os_unpaired_boot_disable
title: "Disable the Option to Recover the Device via an Unpaired Host"
discussion: |
  The iOS device _MUST_ be configured to disable unpaired devices to boot devices into recovery.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95695-3
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "26.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowUnpairedExternalBootToRecovery: false