id: "os_usb_accessories_when_locked_disable"
title: "Ensure Allow USB accessories while the device is locked is set to Disabled"
discussion: |
  USB devices _MUST_ not be allowed to connect while the device is locked.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - CM-8(3)
  800-53r4: 
    - N/A
  srg:
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 3.2.1.19 (level 1 - Institutionally-Owned Devices)
    v8:
      - 1.2
iOS:
  - "16.0"
tags:
  - ios
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5
severity: ""
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowUSBRestrictedMode: false