id: os_untrusted_tls_disable
title: "Ensure Allow Users to Accept Untrusted TLS Certificates is Set to Disabled"
discussion: |
  Users _MUST_ not be allowed to accept self-signed or unverified certificates.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
  disa_stig:
    - N/A
  sfr:
    - N/A
  indigo:
    - ANNEX K
  cis:
    benchmark:
      - 2.2.1.6 (level 2 - End-User Owned Devices)
      - 3.2.1.13 (level 2 - Institutionally-Owned Devices)
    controls v8:
      - 4.1
iOS:
  - "26.0"
tags:
  - ios
  - cis_lvl2_byod
  - cis_lvl2_enterprise
  - cisv8
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowUntrustedTLSPrompt: false
