id: os_video_conferencing_remote_control_disable
title: "Ensure the Remote Control of a System via Videoconferencing is Set to Disabled"
discussion: |
  Video conferencing remote control _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
  sfr:
    - N/A
  disa_stig:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowVideoConferenceingRemoteControl: false
