id: os_video_conferencing_remote_control_disable
title: "Ensure the remotely control a system via videoconferencing is set to Disabled"
discussion: |
  Video conferencing remote control _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95541-9
  cci: 
    - N/A
  800-53r5:
    - N/A
  indigo:
    - N/A
  sfr:
    - N/A
  disa_stig:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowVideoConferenceingRemoteControl: false
