id: os_writing_tools_disable
title: Ensure the Ability to Use AI Writing Tools is Set to Disabled
discussion: |
  AI writing tools _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95545-0
  cci:
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  indigo:
    - N/A
  cis:
    benchmark:
      - 2.9.4 (level 1 - End-User Owned Devices)
      - 3.10.4 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.1
      - 4.8
      - 15.3
iOS:
  - "26.0"
tags:
  - ios
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowWritingTools: false
