id: os_writing_tools_disable
title: "Ensure the ability to use AI writing tools is set to Disabled"
discussion: |
  AI writing tools _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci: 
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  indigo:
    - ANNEX K
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low 
  - 800-53r5_moderate 
  - 800-53r5_high
  - indigo_base
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowWritingTools: false
