id: os_writing_tools_disable
title: Disable Apple Intelligence Writing Tools
discussion: |-
  Apple Intelligence features such as writing tools that use off device AI _MUST_ be disabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowWritingTools').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  800-171r3:
    - 03.01.20
    - 03.04.06    
  cmmc:
    - AC.L1-3.1.20
    - CM.L2-3.4.6
    - CM.L2-3.4.7
macOS:
  - '15.0'
tags:
  - 800-171
  - cmmc_lvl2
  - cmmc_lvl1
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowWritingTools: false
