id: os_web_distribution_app_installation_disable
title: "Ensure the ability to install apps directly from the web is set to Disabled"
discussion: |
  Web distrubtion of app installation _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95544-3
  cci:
    - CCI-000366
  800-53r5:
    - CM-11
  indigo:
    - ANNEX K
  sfr:
    - 'FMT_SMF_EXT.1.1 #3'
  disa_stig:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - indigo_base
  - indigo_high
  - ios_stig
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowWebDistributionAppInstallation: false