id: os_web_distribution_app_installation_disable
title: "Ensure the ability to install apps directly from the web is set to Disabled"
discussion: |
  Web distrubtion of app installation _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94562-6
  800-53r5:
    - CM-11
iOS:
  - "18.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowWebDistributionAppInstallation: false