id: os_handoff_disable
title: "Disable Handoff"
discussion: |
  Handoff _MUST_ be disabled. 

  Handoff allows you to continue working on a document or project when the user switches from one Apple device to another. Disabling Handoff prevents data transfers to unauthorized devices.
check: ' '
result: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
visionOS:
  - '2.0'
tags:
  - visionos
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowActivityContinuation: false