id: os_allow_documents_managed_sources_unmanaged_destinations_disable
title: "Ensure Allow documents from managed sources in unmanaged destinations is set to Disabled"
discussion: |
  Documents from managed sources _MUST_ not be allowed in unmanaged destinations.
check: ""
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94490-0
  800-53r5:
    - AC-3
    - MP-2
    - SC-7(10)
    - SC-39
visionOS:
  - '2.0'
tags:
  - visionos
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowOpenFromManagedToUnmanaged: false