id: icloud_appleid_prefpane_disable
title: "Disable the System Preference Pane for Apple ID"
discussion: |
  The system preference pane for Apple ID _MUST_ be disabled.

  Disabling the system preference pane prevents login to Apple ID and iCloud. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'com.apple.preferences.AppleID'  
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84731-9
  cci: 
    - CCI-000381
    - CCI-001774
  800-53r4: 
    - CM-7(5)(b)
    - CM-7(a)
  srg: 
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig: 
    - AOSX-14-002018
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes: 
      - com.apple.preferences.AppleIDPrefPane
