id: icloud_managed_apps_store_data_disabled
title: "Ensure Managed Apps Storing Data in iCloud is Set to Disabled"
discussion: |
  Managed Apps _MUST_ not store data in iCloud.
check: ' '
result: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
visionOS:
  - '2.0'
tags:
  - visionos
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowManagedAppsCloudSync: false