id: icloud_drive_disable
title: "Ensure Allow iCloud Documents and Data is set to Disabled"
discussion: |
  Institutionally owned devices _MUST_ not sync data through iCloud.
check: ""
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
visionOS:
  - '26.0'
tags:
  - visionos
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high  
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudDocumentSync: false
