id: icloud_drive_disable
title: "Ensure Allow iCloud Documents and Data is set to Disabled"
discussion: |
  Institutionally owned devices _MUST_ not sync data through iCloud.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - CCI-000097
    - CCI-000366
    - CCI-000370
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - "FMT_MOF_EXT.1.2 #40"
  disa_stig:
    - N/A
  indigo:
    - ANNEX D (Section 5.4 - iCloud restrictions) 
    - ANNEX K
  cis:
    benchmark:
      - 3.2.1.5 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 2.3
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: "medium"
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudDocumentSync: false
