id: icloud_keychain_disable
title: "Disable iCloud Keychain Sync"
discussion: |
  The macOS system’s ability to automatically synchronize a user’s passwords to their iCloud account _MUST_ be disabled. 
  
  Apple’s iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, password management and synchronization _MUST_ be controlled by an organization approved service. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowCloudKeychainSync = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84735-0
  cci:
    - CCI-000381
    - CCI-001774
  800-53r4:
    - CM-7
    - AC-20
  srg:
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig:
    - AOSX-14-002040
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudKeychainSync: false
