id: icloud_managed_apps_store_data_disabled
title: "Ensure Managed Apps Storing Data in iCloud is Set to Disabled"
discussion: |
  Managed Apps _MUST_ not store data in iCloud.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - AIOS-16-007300
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.3 (level 1)
      - 3.2.1.7 (level 1)
    controls v8:
      - 2.3
ios:
  - "16.0"
tags:
  - ios
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowManagedAppsCloudSync: false