id: icloud_photos_disable
title: "Disable iCloud Photo Library"
discussion: |
  The iOS built-in Photos.app connection to Apple's iCloud service _MUST_ be disabled.

  Apple's iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, automated photo synchronization _MUST_ be controlled by an organization approved service.
check: ' '
fix: |
  This is implemented by a Configuration Profile
references:
  cce:
    - CCE-95428-9
  cci:
    - CCI-000381
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - N/A
  indigo:
    - ANNEX D (Section 5.4 - iCloud restrictions)
    - ANNEX K  
  cis:
    benchmark:
      - AIOS-18-003450
    controls v8:
      - 4.1
      - 4.8
      - 15.3
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - ios_stig
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudPhotoLibrary: false
