id: icloud_keychain_disable
title: Disable iCloud Keychain Sync
discussion: |
  The iOS system's ability to automatically synchronize a user's passwords to their iCloud account _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95425-5
  cci:
    - CCI-000097
    - CCI-000366
    - CCI-000370
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_MOF_EXT.1.2 #40'
  disa_stig:
    - AIOS-26-003300
  indigo:
    - ANNEX D (Section 5.4 - iCloud restrictions)
    - ANNEX K
  cis:
    benchmark:
      - 3.2.1.6 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 4.1
      - 4.8
      - 15.3
  bio:
    - 8.12
iOS:
  - '26.0'
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - ios_stig
  - nlmapgov_plus
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudKeychainSync: false
