id: icloud_calendar_disable
title: "Disable the iCloud Calendar Services"
discussion: |
  The macOS built-in Calendar.app connection to Apple’s iCloud service _MUST_ be disabled. 
  
  Apple’s iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, automated calendar synchronization _MUST_ be controlled by an organization approved service.
check:
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowCloudCalendar = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85285-5
  cci: 
    - CCI-000381
    - CCI-001774
  800-53r4:
    - CM-7
    - AC-20
    - AC-20(1)
  srg:
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig:
    - AOSX-15-002012
  800-171r2:
    - 3.1.20
    - 3.4.6
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudCalendar: false
