id: icloud_keychain_disable
title: Disable iCloud Keychain Sync
discussion: |
  The system's ability to automatically synchronize a user's passwords to their iCloud account _MUST_ be disabled.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95556-7
  800-53r5:
  - AC-20
  - AC-20(1)
  - CM-7
  - CM-7(1)
  - SC-7(10)
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudKeychainSync: false
