id: icloud_managed_apps_store_data_disabled
title: Ensure Managed Apps Storing Data in iCloud is Set to Disabled
discussion: |
  Managed Apps _MUST_ not store data in iCloud.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95426-3
  cci:
    - CCI-000097
    - CCI-000366
    - CCI-000370
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_MOF_EXT.1.2 #40'
  disa_stig:
    - AIOS-26-003600
  indigo:
    - ANNEX D (Section 5.4 - iCloud restrictions)
    - ANNEX K
  cis:
    benchmark:
      - 2.2.1.3 (level 1 - End-User Owned Devices)
      - 3.2.1.7 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 2.3
  cmmc:
    - AC.L1-B.1.III
    - AC.L2-3.1.20
    - CM.L2-3.4.6
    - CM.L2-3.4.7
iOS:
  - '26.0'
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - cmmc_lvl1
  - cmmc_lvl2
  - cmmc_lvl3
  - indigo_base
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - ios_stig
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowManagedAppsCloudSync: false
