id: icloud_bookmarks_disable
title: "Disable iCloud Bookmarks"
discussion: |
  The macOS built-in Safari.app bookmark synchronization via the iCloud service _MUST_ be disabled.

  Apple’s iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, automated bookmark synchronization _MUST_ be controlled by an organization approved service.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowCloudBookmarks = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84732-7
  cci:
    - CCI-000381
    - CCI-001774
  800-53r4:
    - CM-7
    - AC-20
    - AC-20(1)
  srg:
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig:
    - AOSX-14-002042
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudBookmarks: false
