id: icloud_backup_disabled
title: "Ensure iCloud Backup is set to Disabled"
discussion: |
  iCloud backup _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - AIOS-16-007300
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 3.2.1.4 (level 1)
    controls v8:
      - 2.3
ios:
  - "16.0"
tags:
  - ios
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudBackup: false