id: icloud_keychain_disable
title: "Disable iCloud Keychain Sync"
discussion: |
  The iOS system's ability to automatically synchronize a user's passwords to their iCloud account _MUST_ be disabled. 
  
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A   
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 3.2.1.6 (level 1 - Institutionally-Owned Devices) 
    controls v8:
      - 4.1
      - 4.8
      - 15.3
ios:
  - "16.0"
tags:
  - ios
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudKeychainSync: false
