id: icloud_appleid_prefpane_disable
title: "Disable the System Preference Pane for Apple ID"
discussion: |
  The system preference pane for Apple ID _MUST_ be disabled.

  Disabling the system preference pane prevents login to Apple ID and iCloud. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'com.apple.preferences.AppleID'  
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84731-9
  cci: 
    - CCI-001774
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
  800-53r4: 
    - CM-7
    - CM-7(1)
    - AC-20
    - AC-20(1)
  srg: 
    - SRG-OS-000370-GPOS-00155
  disa_stig: 
    - AOSX-15-002031
  800-171r2:
    - 3.1.20
    - 3.4.6
  cisv8:
    - 4.1
    - 4.8
macOS:
  - "10.15"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
  - cisv8
severity: "high"
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes: 
      - com.apple.preferences.AppleIDPrefPane
