id: icloud_shared_photo_stream_disable
title: "Ensure Shared Photo Stream is set to Disabled"
discussion: |
  If a user is able to configure the security setting, the user could inadvertently or maliciously set it to a value that poses unacceptable risk to DoD information systems. An adversary could exploit vulnerabilities created by the weaker configuration to compromise DoD sensitive information.
check: " "
fix: |
  This is implemented by a Configuration Profile
references:
  cce:
    - N/A
  cci:
    - CCI-000097
    - CCI-000366
    - CCI-000370
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - "FMT_MOF_EXT.1.2 #40"
  disa_stig:
    - N/A
  indigo:
    - ANNEX D (Section 5.4 - iCloud restrictions) 
    - ANNEX K
  cis:
    benchmark:
      - N/A
    controls v8:
      - N/A
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - indigo_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowSharedStream: false
