id: icloud_sync_disable
title: "Ensure Allow iCloud documents & data is set to Disabled"
discussion: |
  Institutionally owned devices _MUST_ not sync data through iCloud.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - N/A    
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 3.2.1.5 (level 1)
    controls v8:
      - 2.3
ios:
  - "16.0"
tags:
  - ios
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudDocumentSync: false
