id: icloud_photos_disable
title: Disable iCloud Photo Library
discussion: |
  The built-in Photos.app connection to Apple''s iCloud service _MUST_
  be disabled.

  Apple''s iCloud service does not provide an organization with enough control over
  the storage and access of data and, therefore, automated photo synchronization _MUST_
  be controlled by an organization approved service.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95558-3
  cci:
    - CCI-001090
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_MOF_EXT.1.2 #40'
  disa_stig:
    - AVOS-02-003450
visionOS:
  - '26.0'
tags:
  - visionos
  - visionos_stig
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudPhotoLibrary: false
