id: icloud_sync_disable
title: "Disable iCloud Desktop and Document Folder Sync"
discussion: |
  The macOS system's ability to automatically synchronize a user's desktop and documents folder to their iCloud Drive must be disabled. Automated file synchronization shall be planned and controlled to Agency approved storage.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowCloudDesktopAndDocuments = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84740-0
  cci:
    - N/A
  800-53r4:
    - CM-7(a)
    - CM-7(5)(b)
  srg:
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig:
    - N/A
macOS:
  - "10.15"
tags:
  - cnssi-1253
  - fisma-low
  - fisma-moderate
  - fisma-high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudDesktopAndDocuments: false
