id: icloud_managed_apps_store_data_disabled
title: "Ensure Managed Apps Storing Data in iCloud is Set to Disabled"
discussion: |
  Managed Apps _MUST_ not store data in iCloud.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - CCI-000097
    - CCI-000366
    - CCI-000370
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_MOF_EXT.1.2 #40'
  disa_stig:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - 2.2.1.3 (level 1 - End-User Owned Devices)
      - 3.2.1.7 (level 1 - Institutionally-Owned Devices)
    controls v8:
      - 2.3
iOS:
  - "17.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod  
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
  - ios_stig_byoad
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowManagedAppsCloudSync: false
