id: icloud_drive_disable
title: "Disable iCloud Document Sync"
discussion: |
  The macOS built-in iCloud document synchronization service _MUST_ be disabled to prevent organizational data from being synchronized to personal or non-approved storage. 

  Apple’s iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, automated document synchronization _MUST_ be controlled by an organization approved service. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowCloudDocumentSync = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-90889-7
  cci:
    - CCI-000381
    - CCI-001774
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)    
  800-53r4:
    - CM-7
    - CM-7(1)
    - AC-20
    - AC-20(1)
  srg:
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig:
    - N/A
  800-171r2:
    - 3.1.20
    - 3.4.6
macOS:
  - "12.0"
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudDocumentSync: false
