id: icloud_backup_disabled
title: "Ensure iCloud Backup is set to Disabled"
discussion: |
  iCloud backup _MUST_ be disabled.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95422-2
  cci:
    - CCI-001090
  800-53r5:
    - SC-4
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  sfr:
    - 'FMT_MOF_EXT.1.2 #40'
  disa_stig:
    - N/A
  indigo:
    - N/A
iOS:
  - "26.0"
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - ios_stig
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
severity: "medium"
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudBackup: false
