id: settings_siri_disable
title: Disable Siri
discussion: |
  Support for Siri is non-essential and _MUST_ be disabled.


  The information system _MUST_ be configured to provide only essential capabilities.
check: ' '
fix: This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-95598-9
  800-53r5:
  - AC-20
  - CM-7
  - CM-7(1)
  - SC-7(10)
visionOS:
- '26.0'
tags:
- visionos
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAssistant: false
