---
id: system_settings_time_machine_auto_backup_enable
title: Configure Time Machine for Automatic Backups
discussion: |
  Automatic backups _MUST_ be enabled when using Time Machine.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.TimeMachine')\
  .objectForKey('AutoBackup').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94402-5
  cci:
  - N/A
  800-53r5:
  - N/A
  800-53r4:
  - N/A
  srg:
  - N/A
  disa_stig:
  - N/A
  800-171r3:
  - N/A
  cis:
    benchmark:
    - 2.3.4.1 (level 2)
    controls v8:
    - 11.2
operating_system:
- name: macos
  version:
  - 15.0
tags:
- cis_lvl2
- cisv8
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.TimeMachine
  PayloadContent:
    AutoBackup: true
