---
id: system_settings_diagnostics_reports_disable
title: Disable Sending Diagnostic and Usage Data to Apple
discussion: |
  The ability to submit diagnostic data to Apple _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling the submission of diagnostic and usage information will mitigate the risk of unwanted data being sent to Apple.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  function run() {
  let pref1 = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SubmitDiagInfo')\
  .objectForKey('AutoSubmit').js
  let pref2 = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowDiagnosticSubmission').js
  if ( pref1 == false && pref2 == false ){
      return("true")
  } else {
      return("false")
  }
  }
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94359-7
  cci:
  - CCI-001312
  - CCI-001314
  800-53r5:
  - SI-11
  - AC-20
  - SC-7(10)
  800-53r4:
  - AC-20
  - SI-11
  srg:
  - SRG-OS-000206-GPOS-00084
  - SRG-OS-000205-GPOS-00083
  disa_stig:
  - APPL-15-002021
  800-171r3:
  - 03.01.20
  cis:
    benchmark:
    - 2.6.3.1 (level 1)
    - 2.6.3.4 (level 1)
    controls v8:
    - 4.1
    - 4.8
  cmmc:
  - AC.L1-3.1.20
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-53r5_low
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-53r5_moderate
- 800-53r5_high
- 800-171
- cis_lvl1
- cis_lvl2
- cisv8
- cnssi-1253_low
- cnssi-1253_high
- cmmc_lvl2
- cmmc_lvl1
- stig
- cnssi-1253_moderate
severity: medium
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.SubmitDiagInfo
  PayloadContent:
    AutoSubmit: false
- PayloadType: com.apple.applicationaccess
  PayloadContent:
    allowDiagnosticSubmission: false
