---
id: system_settings_hot_corners_disable
title: Disable Hot Corners
discussion: |
  Hot corners _MUST_ be disabled.

  The information system conceals, via the session lock, information previously visible on the display with a publicly viewable image. Although hot comers can be used to initiate a session lock or to launch useful applications, they can also be configured to disable an automatic session lock from initiating. Such a configuration introduces the risk that a user might forget to manually lock the screen before stepping away from the computer.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -Ec '"wvous-bl-corner" = 0|"wvous-br-corner" = 0|"wvous-tl-corner" = 0|"wvous-tr-corner" = 0'
result:
  integer: 4
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94368-8
  cci:
    - CCI-000060
  800-53r5:
    - AC-11(1)
  800-53r4:
    - AC-11(1)
  srg:
    - SRG-OS-000031-GPOS-00012
  disa_stig:
    - APPL-15-000007
  800-171r3:
    - 03.01.10
  cmmc:
    - AC.L2-3.1.10
operating_system:
  - name: macos
    version:
      - 15.0
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253_low
  - cnssi-1253_high
  - stig
  - cmmc_lvl2
  - cnssi-1253_moderate
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.ManagedClient.preferences
    PayloadContent:
      com.apple.dock:
        wvous-bl-corner: 0
        wvous-br-corner: 0
        wvous-tr-corner: 0
        wvous-tl-corner: 0
