---
id: system_settings_touch_id_settings_disable
title: Disable the Touch ID System Settings Pane
discussion: |
  The System Settings pane for Touch ID _MUST_ be disabled.

  Disabling the System Settings pane prevents the users from configuring Touch ID.
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="DisabledSystemSettings"]/following-sibling::*[1]' - | /usr/bin/grep -c "com.apple.Touch-ID-Settings.extension"
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
  - CCE-94407-4
  cci:
  - N/A
  800-53r5:
  - CM-7
  - CM-7(1)
  - CM-7(5)
  800-53r4:
  - CM-7
  - CM-7(5)
  srg:
  - N/A
  disa_stig:
  - N/A
  800-171r3:
  - 03.04.06
  - 03.04.08
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
  cmmc:
  - CM.L2-3.4.6
  - CM.L2-3.4.7
operating_system:
- name: macos
  version:
  - 15.0
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cisv8
- cmmc_lvl2
- cnssi-1253_moderate
- cnssi-1253_low
- cnssi-1253_high
mobileconfig: true
mobileconfig_info:
- PayloadType: com.apple.systempreferences
  PayloadContent:
    DisabledSystemSettings:
    - com.apple.Touch-ID-Settings.extension
