---
id: system_settings_software_update_enforce
title: Enforce Software Update Automatically
discussion: |
  Software Update _MUST_ be configured to enforce automatic update is enabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SoftwareUpdate')\
  .objectForKey('AutomaticCheckEnabled').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94397-7
  cci:
    - N/A
  800-53r5:
    - SI-2(5)
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r3:
    - 3.14.1
    - 3.14.2
    - 3.13.3
  cis:
    benchmark:
      - 1.2 (level 1)
    controls v8:
      - 7.3
      - 7.4
operating_system:
  - name: macos
    version:
      - 15.0
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.SoftwareUpdate
    PayloadContent:
      AutomaticCheckEnabled: true
