---
# yaml-language-server: $schema=../../../../../../schemas/rules.json
id: system_settings_airplay_receiver_disable
title: Disable Airplay Receiver
discussion: |
  Airplay Receiver allows you to send content from another Apple device to be displayed on the screen as it's being played from your other device.

  Support for Airplay Receiver is non-essential and _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowAirPlayIncomingRequests').js
  EOS
result:
  boolean: false
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94348-0
  cci:
    - CCI-000381
    - CCI-001443
  800-53r5:
    - CM-7
    - CM-7(1)
  800-53r4:
    - N/A
  srg:
    - SRG-OS-000300-GPOS-00118
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - N/A
  800-171r3:
    - 03.04.06
  cis:
    benchmark:
      - 2.3.1.2 (level 1)
    controls v8:
      - 4.1
      - 4.8
  cmmc:
    - CM.L2-3.4.6
    - CM.L2-3.4.7
operating_system:
  - name: macos
    version:
      - 15.0
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1
  - cis_lvl2
  - cisv8
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - cmmc_lvl2
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  - PayloadType: com.apple.applicationaccess
    PayloadContent:
      allowAirPlayIncomingRequests: false
