id: system_settings_touchid_unlock_disable
title: "Disable TouchID for Unlocking the Device"
discussion: |
  TouchID enables the ability to unlock a device with a user's fingerprint.

  TouchID _MUST_ be disabled for "Unlocking your device" on all devices that are capable of using Touch ID.

  The system _MUST_ remain locked until the user establishes access using an authorized identification and authentication method.

  NOTE: TouchID is not an approved biometric authenticator for US Federal Government usage as it has not been verified to meet the strength requirements outlined in NIST SP 800-63.
check: ' '
result: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  800-53r5:
    - IA-5
visionOS:
  - '2.0'
tags:
  - visionos
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowFingerprintForUnlock: false