id: system_settings_wifi_menu_enable
title: Enable Wifi Menu
discussion: |
  The WiFi menu _MUST_ be enabled.
check: |

  if [ -n "${CACHED_PROFILES_FILE:-}" ] && [ -f "${CACHED_PROFILES_FILE}" ]; then
    /usr/bin/grep -A20 'com.apple.controlcenter' "${CACHED_PROFILES_FILE}" | /usr/bin/grep -oE 'WiFi = [0-9]+' | /usr/bin/awk '{print $3}' || echo 0
  else
    /usr/bin/sudo /usr/bin/profiles -P -o stdout | /usr/bin/grep -A20 'com.apple.controlcenter' | /usr/bin/grep -oE 'WiFi = [0-9]+' | /usr/bin/awk '{print $3}' || echo 0
  fi
result:
  integer: 18
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94414-0
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r3:
    - N/A
  cis:
    benchmark:
      - 2.4.1 (level 1)
    controls v8:
      - 4.8
      - 12.6
macOS:
  - '15.0'
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.controlcenter:
    WiFi: 18
