id: system_settings_improve_siri_dictation_disable
title: Disable Improve Siri and Dictation Information to Apple
discussion: |
  The ability for Apple to store and review audio of your Siri and Dictation interactions _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling the submission of Siri and Dictation information will mitigate the risk of unwanted data being sent to Apple.
check: |

  if [ -n "${CACHED_PROFILES_FILE:-}" ] && [ -f "${CACHED_PROFILES_FILE}" ]; then
    /usr/bin/grep -qE '"Siri Data Sharing Opt-In Status" = 2' "${CACHED_PROFILES_FILE}" && echo 2 || echo 1
  else
    /usr/bin/sudo /usr/bin/profiles -P -o stdout | /usr/bin/grep -qE '"Siri Data Sharing Opt-In Status" = 2' && echo 2 || echo 1
  fi
result:
  integer: 2
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94372-0
  cci:
    - CCI-000381
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
    - SC-7(10)
  800-53r4:
    - CM-7
    - CM-7(1)
    - AC-20
    - SC-7(10)
  800-171r3:
    - 03.01.20
    - 03.04.06
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - APPL-15-002210
  cis:
    benchmark:
      - 2.6.3.2 (level 1)
    controls v8:
      - 4.1
      - 4.8
  cmmc:
    - AC.L1-3.1.20
    - CM.L2-3.4.6
    - CM.L2-3.4.7
macOS:
  - '15.0'
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
  - cnssi-1253_low
  - cnssi-1253_high
  - cmmc_lvl2
  - cmmc_lvl1
  - stig
  - cis_lvl1
  - cis_lvl2
  - cnssi-1253_moderate
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.assistant.support:
    Siri Data Sharing Opt-In Status: 2
