id: system_settings_improve_search_disable
title: Disable Improve Search Information to Apple
discussion: |
  Sending data to Apple to help improve search _MUST_ be disabled. This will disable "Improve Search" within Spotlight in System Settings.
  
  The information system _MUST_ be configured to provide only essential capabilities. Disabling the submission of search data will mitigate the risk of unwanted data being sent to Apple.
  
check: |

  if [ -n "${CACHED_PROFILES_FILE:-}" ] && [ -f "${CACHED_PROFILES_FILE}" ]; then
    /usr/bin/grep -qE '"Search Queries Data Sharing Status" = 2' "${CACHED_PROFILES_FILE}" && echo 2 || echo 1
  else
    /usr/bin/sudo /usr/bin/profiles -P -o stdout | /usr/bin/grep -qE '"Search Queries Data Sharing Status" = 2' && echo 2 || echo 1
  fi
result:
  integer: 2
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-94371-2
  cci:
    - CCI-000381
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
    - SC-7(10)
  800-53r4:
    - CM-7
    - CM-7(1)
    - AC-20
    - SC-7(10)
  800-171r3:
    - 03.01.20
    - 03.04.06
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - APPL-15-002024
  cis:
    benchmark:
      - 2.9.1 (level 1)
    controls v8:
      - 4.1
      - 4.8
  cmmc:
    - AC.L1-3.1.20
    - CM.L2-3.4.6
    - CM.L2-3.4.7
macOS:
  - '15.0'
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
  - cnssi-1253_low
  - cnssi-1253_high
  - cmmc_lvl2
  - cmmc_lvl1
  - stig
  - cnssi-1253_moderate
  - cis_lvl1
  - cis_lvl2
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.assistant.support:
    Search Queries Data Sharing Status: 2
