id: system_settings_screensaver_password_enforce
title: "Enforce Screen Saver Password"
discussion: |
  Users _MUST_ authenticate when unlocking the screen saver. 
  
  The screen saver acts as a session lock and prevents unauthorized users from accessing the current user's account.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
  .objectForKey('askForPassword').js
  EOS
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-91974-6
  cci: 
    - N/A
  800-53r5:
    - AC-11
  800-53r4: 
    - AC-11
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - 3.1.10
  cmmc:
    - AC.L2-3.1.10
macOS:
  - "13.0"
tags:
  - 800-53r5_moderate 
  - 800-53r5_high 
  - 800-53r4_moderate 
  - 800-53r4_high 
  - 800-171 
  - cnssi-1253
  - cmmc_lvl3
  - cmmc_lvl2
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPassword: true