id: system_settings_airplay_receiver_disable
title: Disable Airplay Receiver
discussion: "Airplay Receiver allows you to send content from another Apple device to be displayed on the screen as it's being played from your other device.  \n\nSupport for Airplay Receiver is non-essential and _MUST_ be disabled.\n\nThe information system _MUST_ be configured to provide only essential capabilities.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowAirPlayIncomingRequests').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - N/A
  cci:
    - N/A
  800-53r5:
    - CM-7
    - CM-7(1)
  800-53r4:
    - N/A
  srg:
    - SRG-OS-000300-GPOS-00118
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - N/A
  800-171r2:
    - 3.4.6
  cis:
    benchmark:
      - 2.3.1.2 (level 1)
    controls v8:
      - 4.1
      - 4.8
  cmmc:
    - CM.L2-3.4.6
    - CM.L2-3.4.7
macOS:
  - '14.0'
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1
  - cis_lvl2
  - cisv8
  - cnssi-1253_moderate
  - cnssi-1253_low
  - cnssi-1253_high
  - cmmc_lvl2
  - newstig
  - newstig
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirPlayIncomingRequests: false
